{
  "acrobatic_spellcaster" : {
    "_name" : "Acrobatic Spellcaster",
    "_description" : "Your skillful movements prevent foes from disrupting your spells.",
    "_icon" : "",
    "+feats.acrobatic_spellcaster" : {
      "_name" : "Acrobatic Spellcaster",
      "_description" : "When you succeed at an Acrobatics check to move through a threatened square without provoking attacks of opportunity or to move through an enemy’s space, creatures denied attacks of opportunity by your Acrobatics check also cannot make attacks of opportunity against you when you cast spells for the remainder of your turn.",
      "_icon" : "",
      "_requires" : ["Combat Casting","Skill Focus (Acrobatics)"]
    }
  },
  "adder_strike" : {
    "_name" : "Adder Strike",
    "_description" : "You can quickly apply poison to gloved hands, protected feet, or other protected body parts, delivering the poison with your unarmed strikes.",
    "_icon" : "",
    "+feats.adder_strike" : {
      "_name" : "Adder Strike",
      "_description" : "As a swift action, you can apply one dose of contact or injury poison to two body parts that you use for unarmed strikes. You must still protect yourself against exposure to contact poisons you apply in this way.",
      "_icon" : "",
      "_requires" : ["Poison use class feature","Craft (alchemy) 1 rank", "Improved Unarmed Strike"]
    }
  },
  "pinpoint_poisoner" : {
    "_name" : "Pinpoint Poisoner",
    "_description" : "You deftly use specially prepared needles to apply poison for maximum effect.",
    "_icon" : "",
    "+feats.pinpoint_poisoner" : {
      "_name" : "Pinpoint Poisoner",
      "_description" : "When you use Adder Strike, you can instead poison up to two blowgun darts that you can then use to strike your opponent in melee. (Drawing such darts is a free action.) While holding these darts, you can spend a standard action to attack with one or a full-attack action to attack with both. Such attacks are considered melee touch attacks that deal 1d2 damage plus any bonuses you gain on your normal unarmed strike damage, and they deliver the poison. You can instead throw such darts as if they were shuriken, making your ranged attack rolls against the target’s AC.",
      "_icon" : "",
      "_requires" : ["Poison user class feature","Craft (alchemy) 6 ranks","Adder Strike","Improved Unarmed Strike","Two-Weapon Fighting or Flurry of Blows"]
    }
  },
  "advanced_armor_training" : {
    "_name" : "Advanced Armor Training",
    "_description" : "You are specially trained to use your armor proficiencies in new ways.",
    "_icon" : "",
    "+feats.advanced_armor_training" : {
      "_name" : "Advanced Armor Training",
      "_description" : "Select one Advanced Armor Training option. This feat can be taken more than once, but at most once per 3 Fighter levels.",
      "_icon" : "",
      "_requires" : ["Armor Training class feature","Fighter level 3"]
    }
  },
  "advanced_defensive_combat_training" : {
    "_name" : "Advanced Defensive Combat Training",
    "_description" : "You are a master at defending yourself from all manner of combat maneuvers.",
    "_icon" : "",
    "+feats.advanced_defensive_combat_training" : {
      "_name" : "Advanced Defensive Combat Training",
      "_description" : "You gain a +4 bonus to your CMD",
      "_icon" : "",
      "_requires" : ["Defensive Combat Training","Faction membership 10 TPA"]
    },
    "+skills.cmd" : 4
  },
  "advanced_weapon_training" : {
    "_name" : "Advanced Weapon Training",
    "_description" : "You are specially trained to use your weapon skills in new ways.",
    "_icon" : "",
    "+feats.advanced_weapon_training" : {
      "_name" : "Advanced Weapon Training",
      "_description" : "Select one advanced weapon training option, applying to one fighter weapon group you have already selected with the weapon training class feature. This feat can be taken more than once, but at most once per 5 fighter levels. Fighters that have the weapon master archetype can select this feat beginning at 4th level. The benefits of a weapon master’s advanced weapon training options apply only to his selected weapon rather than all weapons in the same fighter weapon group, and he can’t select the weapon specialist advanced weapon training option. A weapon master can select this feat as a bonus feat; if he does so, it doesn’t count for the purpose of the requirement that it can be taken at most once per 5 fighter levels.",
      "_icon" : "",
      "_requires" : ["Fighter level 5","Weapon Training class feature"]
    }
  },
  "agile_maiden" : {
    "_name" : "Agile Maiden",
    "_description" : "Your armor hinders you less than others.",
    "_icon" : "",
    "+feats.agile_maiden" : {
      "_name" : "Agile Maiden",
      "_description" : "For the purpose of class features (such as a ranger’s combat style, a barbarian’s fast movement, or a magus’s spellcasting), you treat Gray Maiden plate as medium armor or heavy armor, whichever is more beneficial to a given ability. This does not affect the armor’s statistics, and it is still considered heavy armor for all other purposes.",
      "_icon" : "",
      "_requires" : ["Strength 13","Dexterity 13", "Endurance or Armor Training", "proficiency with Heavy Armor"]
    }
  },
  "agile_maneuvers" : {
    "_name" : "Agile Maneuvers",
    "_description" : "You’ve learned to use your quickness in place of brute force when performing combat maneuvers.",
    "_icon" : "",
    "+feats.agile_maneuvers" : {
      "_name" : "Agile Maneuvers",
      "_description" : "You add your Dexterity bonus to your base attack bonus and size bonus when determining your Combat Maneuver Bonus instead of your Strength bonus.",
      "_icon" : "",
      "_requires" : []
    }
  },
  "alchemical_strike" : {
    "_name" : "Alchemical Strike",
    "_description" : "By focusing all your attention into a single attack, you vastly increase the effectiveness of thrown alchemical items.",
    "_icon" : "",
    "+feats.alchemical_strike" : {
      "_name" : "Alchemical Strike",
      "_description" : "You can throw a single alchemical item as a full-attack action, increasing the effectiveness of the alchemical agent thrown. When throwing a single alchemical item as a full-attack action, you increase the DC of any effects associated with that alchemical item by 2. When your base attack bonus reaches +11 and every 5 points of bonus thereafter, increase the saving throw DC of the alchemical item by an additional 2. This feat does not apply to an alchemist’s bombs. An alchemist can take this feat in place of an alchemist discovery. He does not need to meet its prerequisites. The alchemist uses his class level, rather than the base attack bonus granted by the alchemist class, to calculate his total base attack bonus for the purposes of determining the bonus granted by this feat.",
      "_icon" : "",
      "_requires" : ["Throw Anything","Base Attack Bonus +6"]
    }
  },
  "all_consuming_swing" : {
    "_name" : "All-Consuming Swing",
    "_description" : "You deliver unchecked destruction when you stand against multiple foes, sometimes to your own detriment.",
    "_icon" : "",
    "+feats.all_consuming_swing" : {
      "_name" : "All-Consuming Swing",
      "_description" : "Whenever you use Cleave or Great Cleave, you can apply the additional damage you would gain from Vital Strike, Improved Vital Strike, or Greater Vital Strike to the initial target of your attack. When you do so, the strain on your body causes you to take an amount of damage equal to the extra damage dealt by your Vital Strike feat. This self-inflicted damage is not reduced by damage reduction.",
      "_icon" : "",
      "_requires" : ["Strength 13","Power Attack","Cleave","Vital Strike","base attack bonus +8"]
    }
  },
  "amateur_gunslinger" : {
    "_name" : "Amateur Gunslinger",
    "_description" : "Although you are not a gunslinger, you have and can use grit.",
    "_icon" : "",
    "+feats.amateur_gunslinger" : {
      "_name" : "Amateur Gunslinger",
      "_description" : "You gain a small amount of grit and the ability to perform a single 1st-level deed from the gunslinger deed class feature. At the start of the day, you gain 1 grit point, though throughout the day you can gain grit points up to a maximum of your Wisdom modifier (minimum 1). You can regain grit using the rules for the gunslinger’s grit class feature. You can spend this grit to perform the 1st-level deed you chose upon taking this feat, and any other deed you have gained through feats or magic items. If you gain levels in a class that grants the grit class feature, you can immediately trade this feat for the Extra Grit feat.",
      "_icon" : "",
      "_requires" : ["No levels in a class that has the grit class feature"]
    }
  },
  "amateur_swashbuckler" : {
    "_name" : "Amateur Swashbuckler",
    "_description" : "Though not a swashbuckler, you have and can use panache.",
    "_icon" : "",
    "+feats.amateur_swashbuckler" : {
      "_name" : "Amateur Swashbuckler",
      "_description" : "You gain a small amount of panache and the ability to perform a single 1st-level swashbuckler deed. Choose a 1st-level deed from the swashbuckler’s deeds class feature (you can’t select opportune parry and riposte). Once chosen, this deed can’t be changed. At the start of each day, you gain 1 panache point. Throughout the day, you can gain a number of panache points up to a maximum of your Charisma modifier (minimum 1). You can regain panache points as the swashbuckler’s panache class feature. You can spend these panache points to perform the 1st-level deed you chose upon taking this feat as well as any other deeds you have gained through feats or magic items. If you gain levels in a class that has the panache class feature, you can immediately trade this feat for the Extra Panache feat.",
      "_icon" : "",
      "_requires" : ["No levels in a class that has the panache class feature."]
    }
  },
  "ambush_awareness" : {
    "_name" : "Ambush Awareness",
    "_description" : "You are always on your toes and are rarely caught off-guard for long, even when an enemy gets the jump on you.",
    "_icon" : "",
    "+feats.ambush_awareness" : {
      "_name" : "Ambush Awareness",
      "_description" : "If you are unable to act in the surprise round because you failed a Perception check, you can still act on your initiative count in the surprise round, but only to take the total defense action.",
      "_icon" : "",
      "_requires" : ["Alertness"]
    }
  },
  "ambush_sense" : {
    "_name" : "Ambush Sense",
    "_description" : "You live in dangerous times, and are alert for betrayal or unexpected attack.",
    "_icon" : "",
    "+feats.ambush_sense" : {
      "_name" : "Ambush Sense",
      "_description" : "You gain a bonus on Perception checks made to determine awareness for the surprise round of combat, and a dodge bonus to AC in any surprise round in which you get to act. These bonuses are equal to the bonus you gain from trap sense.",
      "_icon" : "",
      "_requires" : ["Intelligence 13","Trap Sense class feature"]
    }
  },
  "ambush_squad" : {
    "_name" : "Ambush Squad",
    "_description" : "You know that the keys to victory are sudden attacks and even more sudden retreats.",
    "_icon" : "",
    "+feats.ambush_squad" : {
      "_name" : "Ambush Squad",
      "_description" : "When you’re adjacent to an ally who also has this feat at the beginning of a surprise round, and both you and that ally can act during that surprise round, you can take both a standard action and a move action during that surprise round.",
      "_icon" : "",
      "_requires" : ["base attack bonus +1","Kobold"]
    }
  },
  "ammo_drop" : {
    "_name" : "Ammo Drop",
    "_description" : "Your coordination is so perfect that you can simply drop ammunition from your hand at the exact moment required for it to fall into an open sling as your twirl it around.",
    "_icon" : "",
    "+feats.ammo_drop" : {
      "_name" : "Ammo Drop",
      "_description" : "You can load a sling or one end of a double sling with one hand as a swift action or move action. This does not provoke an attack of opportunity.",
      "_icon" : "",
      "_requires" : ["Sleight of Hand 1 rank","proficient with sling"]
    }
  },
  "anatomical_savant" : {
    "_name" : "Anatomical Savant",
    "_description" : "You know how to perform deadly strikes against even the nebulous of targets.",
    "_icon" : "",
    "+feats.anatomical_savant" : {
      "_name" : "Anatomical Savant",
      "_description" : "Choose one weapon with which you have the Weapon Focus feat. When you strike an opponent that has a chance of negating critical hits or sneak attacks, such as from the fortification armor special ability, reduce that chance by 25%. Treat creatures that are normally immune to critical hits and sneak attacks as instead having a 75% chance to negate the critical hit or sneak attack, taking only the attack’s normal damage. You can take this feat multiple times. Each time you take the feat, it applies to a different weapon.",
      "_icon" : "",
      "_requires" : ["Weapon Focus","base attack bonus +12"]
    }
  },
  "ancestral_enmity" : {
    "_name" : "Ancestry Enmity",
    "_description" : "You can counter the special defensive training the stouter races have against your kind.",
    "_icon" : "",
    "+feats.ancestral_enmity" : {
      "_name" : "Ancestral Enmity",
      "_description" : "You gain a +2 bonus on melee attack rolls against dwarves and gnomes.",
      "_icon" : "",
      "_requires" : ["Giant subtype"]
    }
  },
  "ancestral_weapon_mastery" : {
    "_name" : "Ancestral Weapon Mastery",
    "_description" : "You have mastered ancient techniques that increase the effectiveness of your race's ancestral weapons.",
    "_icon" : "",
    "+feats.ancestral_weapon_mastery" : {
      "_name" : "Ancestral Weapon Mastery",
      "_description" : "You’re proficient with all of your race’s racial weapons (the weapons mentioned in your race’s weapon familiarity racial trait). If you’re already proficient with any of those weapons, you instead gain Weapon Focus for one of those weapons as a bonus feat. Furthermore, if you gain Weapon Focus as a bonus feat with one of your racial weapons as a result of this feat, you can change which racial weapon your bonus Weapon Focus feat applies to by engaging in 10 minutes of practice with the new weapon. The benefits of this bonus Weapon Focus feat last until you choose to practice and apply it to a different racial weapon.",
      "_icon" : "",
      "_requires" : ["base attack bonus +1","weapon familiarity racial trait"]
    }
  },
  "animal_ferocity" : {
    "_name" : "Animal Ferocity",
    "_description" : "When cornered and wounded, you fight like a feral beast.",
    "_icon" : "",
    "+feats.animal_ferocity" : {
      "_name" : "Animal Ferocity",
      "_description" : "When your hit points are reduced below 0, you can still take the full attack action, but you take a –5 penalty on each attack roll.",
      "_icon" : "",
      "_requires" : ["base attack bonus +3","ferocity racial ability"]
    }
  },
  "ankle_biter" : {
    "_name" : "Ankle Biter (Goblin)",
    "_description" : "You know how to take a mouthful out of anyone who tries to overpower you.",
    "_icon" : "",
    "+feats.ankle_biter" : {
      "_name" : "Ankle Biter",
      "_description" : "If you are the target of a combat maneuver you can, as an immediate action, attempt to bite your opponent in addition to any attacks of opportunity or other consequences your opponent might incur from attacking you. This bonus natural attack does not provoke an attack of opportunity itself and deals base damage appropriate for a creature of your current size (usually 1d4 for Small creatures). If grappled or pinned, you can continue to make this additional bite attack each round as swift action on your turn. You gain a bonus on any attempt to break the grapple equal to the damage you dealt with your bite that round. You cannot make this bite attack when you are the aggressor, including if you manage to reverse a grapple or make any other attack of opportunity.",
      "_icon" : "",
      "_requires" : ["Goblin","Escape Artist 1 rank"]
    }
  },
  "anticipate_dodge" : {
    "_name" : "Anticipate Dodge",
    "_description" : "You automatically know whether a creature you can see has a dodge bonus to its AC. You gain up to a +2 bonus on attack rolls against a target that has a dodge bonus. This bonus cannot exceed the dodge bonus of the creature you attack.",
    "_icon" : "",
    "+feats.anticipate_dodge" : {
      "_name" : "Anticipate Dodge",
      "_description" : "You automatically know whether a creature you can see has a dodge bonus to its AC. You gain up to a +2 bonus on attack rolls against a target that has a dodge bonus. This bonus cannot exceed the dodge bonus of the creature you attack.",
      "_icon" : "",
      "_requires" : ["Dodge","Mobility","base attack bonus +7","brawler level 4 or monk level 4"]
    }
  },
  "aquatic_combatant" : {
    "_name" : "Aquatic Combatant",
    "_description" : "You gain a +2 bonus on Swim checks and don’t take the usual penalties on melee attack rolls made underwater. Your slashing melee attacks and unarmed bludgeoning attacks deal full damage underwater.",
    "_icon" : "",
    "+feats.aquatic_combatant" : {
      "_name" : "Aquatic Combatant",
      "_description" : "You gain a +2 bonus on Swim checks and don’t take the usual penalties on melee attack rolls made underwater. Your slashing melee attacks and unarmed bludgeoning attacks deal full damage underwater.",
      "_icon" : "",
      "_requires" : ["Swim rank 1"]
    }
  },
  "arc_slinger" : {
    "_name" : "Arc Slinger",
    "_description" : "When using a sling or sling staff, you reduce your penalty on ranged attack rolls due to range by 2. Point-Blank Shot’s damage bonus applies within the first normal range increment of your sling (50 feet) or sling staff (80 feet).",
    "_icon" : "",
    "+feats.arc_slinger" : {
      "_name" : "Arc Slinger",
      "_description" : "When using a sling or sling staff, you reduce your penalty on ranged attack rolls due to range by 2. Point-Blank Shot’s damage bonus applies within the first normal range increment of your sling (50 feet) or sling staff (80 feet).",
      "_icon" : "",
      "_requires" : ["Point-Blank Shot","proficient with sling or halfling sling staff"]
    }
  },
  "arcane_armor_mastery" : {
    "_name" : "Arcane Armor Mastery",
    "_description" : "As a swift action, reduce the arcane spell failure chance due to the armor you are wearing by 20% for any spells you cast this round. This bonus replaces, and does not stack with, the bonus granted by Arcane Armor Training.",
    "_icon" : "",
    "+feats.arcane_armor_mastery" : {
      "_name" : "Arcane Armor Mastery",
      "_description" : "As a swift action, reduce the arcane spell failure chance due to the armor you are wearing by 20% for any spells you cast this round. This bonus replaces, and does not stack with, the bonus granted by Arcane Armor Training.",
      "_icon" : "",
      "_requires" : ["Arcane Armor Training","Medium Armor Proficiency","caster level 7"]
    }
  },
  "arcane_armor_training" : {
    "_name" : "Arcane Armor Training",
    "_description" : "As a swift action, reduce the arcane spell failure chance due to the armor you are wearing by 10% for any spells you cast this round.",
    "_icon" : "",
    "+feats.arcane_armor_training" : {
      "_name" : "Arcane Armor Training",
      "_description" : "As a swift action, reduce the arcane spell failure chance due to the armor you are wearing by 10% for any spells you cast this round.",
      "_icon" : "",
      "_requires" : ["Light Armor Proficiency","caster level 3"]
    }
  },
  "arcane_strike" : {
    "_name" : "Arcane Strike",
    "_description" : "As a swift action, you can imbue your weapons with a fraction of your power. For 1 round, your weapons deal +1 damage and are treated as magic for the purpose of overcoming damage reduction. For every five caster levels you possess, this bonus increases by +1, to a maximum of +5 at 20th level.",
    "_icon" : "",
    "+feats.arcane_strike" : {
      "_name" : "Arcane Strike",
      "_description" : "As a swift action, you can imbue your weapons with a fraction of your power. For 1 round, your weapons deal +1 damage and are treated as magic for the purpose of overcoming damage reduction. For every five caster levels you possess, this bonus increases by +1, to a maximum of +5 at 20th level.",
      "_icon" : "",
      "_requires" : ["Ability to cast arcane spells."]
    }
  },
  "archon_style" : {
    "_name" : "Archon Style",
    "_description" : "While using this style, as a move action, you can protect adjacent allies from a single opponent that you currently threaten. This grants adjacent allies a +2 dodge bonus to AC against that opponent’s next melee attack (as long as that attack comes before the beginning of your next turn), but causes you to take a –2 penalty to AC against that opponent until your next turn. The dodge bonus against the designated opponent’s attacks persists even if your allies move away from you.",
    "_icon" : "",
    "+feats.archon_style" : {
      "_name" : "Archon Style",
      "_description" : "While using this style, as a move action, you can protect adjacent allies from a single opponent that you currently threaten. This grants adjacent allies a +2 dodge bonus to AC against that opponent’s next melee attack (as long as that attack comes before the beginning of your next turn), but causes you to take a –2 penalty to AC against that opponent until your next turn. The dodge bonus against the designated opponent’s attacks persists even if your allies move away from you.",
      "_icon" : "",
      "_requires" : ["Combat Expertise", "Combat Reflexes", "base attack bonus +2", "monk level 1"]
    }
  },
  "archon_diversion" : {
    "_name" : "Archon Diversion",
    "_description" : "The penalty to AC for using Archon Style to grant nearby allies a bonus to AC against a single opponent decreases to –1. Once per round while using Archon Style, when you have at least one hand free or when wielding a shield, you can divert one melee weapon attack targeting an adjacent ally to yourself. After resolving the attack, the ally you protected can make an attack of opportunity against the diverted opponent. You expend no action to divert the attack, but you must be aware of it and must not be flat-footed. You must choose to divert the attack after the opponent has declared the melee attack, but before the attack roll is rolled.",
    "_icon" : "",
    "+feats.archon_diversion" : {
      "_name" : "Archon Diversion",
      "_description" : "The penalty to AC for using Archon Style to grant nearby allies a bonus to AC against a single opponent decreases to –1. Once per round while using Archon Style, when you have at least one hand free or when wielding a shield, you can divert one melee weapon attack targeting an adjacent ally to yourself. After resolving the attack, the ally you protected can make an attack of opportunity against the diverted opponent. You expend no action to divert the attack, but you must be aware of it and must not be flat-footed. You must choose to divert the attack after the opponent has declared the melee attack, but before the attack roll is rolled.",
      "_icon" : "",
      "_requires" : ["Archon Style", "Combat Expertise", "Combat Reflexes", "base attack bonus +4 or monk level 3"]
    }
  },
  "archon_justice" : {
    "_name" : "Archon Justice",
    "_description" : "You no longer take a penalty to AC for using Archon Style to grant nearby allies a bonus to AC, and you can activate this effect as a swift action or a move action. Whenever you take damage from an attack you diverted to yourself using Archon Diversion, each ally threatening the attacking creature can make an attack of opportunity against that creature.",
    "_icon" : "",
    "+feats.archon_justice" : {
      "_name" : "Archon Justice",
      "_description" : "You no longer take a penalty to AC for using Archon Style to grant nearby allies a bonus to AC, and you can activate this effect as a swift action or a move action. Whenever you take damage from an attack you diverted to yourself using Archon Diversion, each ally threatening the attacking creature can make an attack of opportunity against that creature.",
      "_icon" : "",
      "_requires" : ["Archon Diversion", "Archon Style","Combat Expertise","Combat Reflexes","base attack bonus +8 or monk level 7"]
    }
  },
  "armor_adept" : {
    "_name" : "Armor Adept",
    "_description" : "Choose two armor modifications (such as deflecting or jarring). You no longer suffer the drawbacks of wearing armor with those modifications.",
    "_icon" : "",
    "+feats.armor_adept" : {
      "_name" : "Armor Adept",
      "_description" : "Choose two armor modifications (such as deflecting or jarring). You no longer suffer the drawbacks of wearing armor with those modifications. You can gain this feat multiple times, choosing two different armor modifications each time.",
      "_icon" : "",
      "_requires" : [""]
    }
  },
  "armor_focus" : {
    "_name" : "Armor Focus",
    "_description" : "Select one type of armor, such as chain shirt or splint mail. The AC bonus granted by the selected armor increases by 1.",
    "_icon" : "",
    "+feats.armor_adept" : {
      "_name" : "Armor Adept",
      "_description" : "Select one type of armor, such as chain shirt or splint mail. The AC bonus granted by the selected armor increases by 1. You can gain this feat multiple times. Its effects do not stack. Each time you take the feat, it applies to a new type of armor. The Armor Focus feat counts as the armor training class feature for the purpose of armor mastery feat prerequisites and determines what types of armor you can use with armor mastery feats.",
      "_icon" : "",
      "_requires" : ["base attack bonus +1","proficiency with selected armor"]
    }
  },
  "improved_armor_focus" : {
    "_name" : "Improved Armor Focus",
    "_description" : "The armor check penalty of the selected armor decreases by 1 (to a minimum of 0). You also use your character level in place of your base attack bonus for the purpose of armor mastery feat prerequisites.",
    "_icon" : "",
    "+feats.armor_adept" : {
      "_name" : "Improved Armor Focus",
      "_description" : "The armor check penalty of the selected armor decreases by 1 (to a minimum of 0). You also use your character level in place of your base attack bonus for the purpose of armor mastery feat prerequisites. You can gain this feat multiple times. Its effects do not stack. Each time you take the feat, it applies to a new type of armor.",
      "_icon" : "",
      "_requires" : ["Armor Focus","base attack bonus +6","proficiency with selected armor"]
    }
  },
  "armor_proficiency_light" : {
    "_name" : "Armor Proficiency, Light",
    "_description" : "When you wear light armor, the armor check penalty for that armor applies only to Dexterity- and Strength-based skill checks.",
    "_icon" : "",
    "+feats.armor_proficiency_light" : {
      "_name" : "Armor Proficiency, Light",
      "_description" : "When you wear light armor, the armor check penalty for that armor applies only to Dexterity- and Strength-based skill checks. All characters except monks, sorcerers, and wizards automatically have Light Armor Proficiency as a bonus feat. They need not select it.",
      "_icon" : "",
      "_requires" : [""]
    }
  },
  "armor_proficiency_medium" : {
    "_name" : "Armor Proficiency, Medium",
    "_description" : "When you wear medium armor, the armor check penalty for that armor applies only to Dexterity- and Strength-based skill checks.",
    "_icon" : "",
    "+feats.armor_proficiency_medium" : {
      "_name" : "Armor Proficiency, Medium",
      "_description" : "When you wear medium armor, the armor check penalty for that armor applies only to Dexterity- and Strength-based skill checks. Barbarians, clerics, druids, fighters, paladins, and rangers automatically have Medium Armor Proficiency as a bonus feat. They need not select it.",
      "_icon" : "",
      "_requires" : [""]
    }
  },
  "armor_proficiency_heavy" : {
    "_name" : "Armor Proficiency, Heavy",
    "_description" : "When you wear heavy armor, the armor check penalty for that armor applies only to Dexterity- and Strength-based skill checks.",
    "_icon" : "",
    "+feats.armor_proficiency_heavy" : {
      "_name" : "Armor Proficiency, Heavy",
      "_description" : "When you wear heavy armor, the armor check penalty for that armor applies only to Dexterity- and Strength-based skill checks. Fighters and paladins automatically have Heavy Armor Proficiency as a bonus feat. They need not select it.",
      "_icon" : "",
      "_requires" : [""]
    }
  },
  "armor_trick" : {
    "_name" : "Armor Trick",
    "_description" : "You can use any armor tricks related to the chosen armor option if you meet the trick’s prerequisites and are proficient with any armor that you use as part of the trick.",
    "_icon" : "",
    "+feats.armor_trick" : {
      "_name" : "Armor Trick",
      "_description" : "You can use any armor tricks related to the chosen armor option if you meet the trick’s prerequisites and are proficient with any armor that you use as part of the trick. You can gain Armor Trick multiple times. Each time you take the feat, it applies to a new armor trick option.",
      "_icon" : "",
      "_requires" : ["base attack bonus +1"]
    }
  },
  "armored_athlete" : {
    "_name" : "Armored Athlete",
    "_description" : "Choose one Dexterity– or Strength-based skill in which you possess at least 3 ranks. When you attempt a check for the chosen skill, your armor check penalty on that check for wearing light or medium armor is reduced by 3 (to a minimum of 0). If you have 10 or more ranks in the skill, the penalty is instead reduced by 6 (to a minimum of 0). If you have armor training 2 and are proficient with heavy armor, this benefit also applies to armor check penalties for wearing heavy armor.",
    "_icon" : "",
    "+feats.armored_athlete" : {
      "_name" : "Armored Athlete",
      "_description" : "Choose one Dexterity– or Strength-based skill in which you possess at least 3 ranks. When you attempt a check for the chosen skill, your armor check penalty on that check for wearing light or medium armor is reduced by 3 (to a minimum of 0). If you have 10 or more ranks in the skill, the penalty is instead reduced by 6 (to a minimum of 0). If you have armor training 2 and are proficient with heavy armor, this benefit also applies to armor check penalties for wearing heavy armor. You can gain this feat multiple times. Each time you take the feat, it applies to a new skill.",
      "_icon" : "",
      "_requires" : ["Light armor proficiency","medium armor proficiency","3 ranks in any Dexterity- or Strength- based skill."]
    }
  },
  "artful_dodge" : {
    "_name" : "Artful Dodge",
    "_description" : "If you are the only character threatening an opponent, you gain a +1 dodge bonus to AC against that opponent.",
    "_icon" : "",
    "+feats.artful_dodge" : {
      "_name" : "Artful Dodge",
      "_description" : "If you are the only character threatening an opponent, you gain a +1 dodge bonus to AC against that opponent. The Artful Dodge feat acts as the Dodge feat for the purpose of satisfying prerequisites that require Dodge. You can use Intelligence, rather than Dexterity, for feats with a minimum Dexterity prerequisite.",
      "_icon" : "",
      "_requires" : ["Intelligence 13"]
    }
  },
  "artillery_team" : {
    "_name" : "Artillery Team",
    "_description" : "When you’re adjacent to an ally who also has this feat, together you count as being Large for the purpose of using Large light crossbows, Large heavy crossbows, and Large muskets. Firing such a weapon this way requires your ally to support the barrel or bow of the weapon. You must be able to trace a line from your space to the target’s space in such a way that the line passes through the ally’s space. The ally doesn’t provide soft cover to your target. Your ally uses her actions to load the weapon, and you use your actions to make attacks. Similarly, your ally’s feats and abilities apply to reloading, while your feats and abilities apply to making attacks. This feat does not allow you and your ally to act simultaneously on the same initiative.",
    "_icon" : "",
    "+feats.artillery_team" : {
      "_name" : "Artillery Team",
      "_description" : "When you’re adjacent to an ally who also has this feat, together you count as being Large for the purpose of using Large light crossbows, Large heavy crossbows, and Large muskets. Firing such a weapon this way requires your ally to support the barrel or bow of the weapon. You must be able to trace a line from your space to the target’s space in such a way that the line passes through the ally’s space. The ally doesn’t provide soft cover to your target. Your ally uses her actions to load the weapon, and you use your actions to make attacks. Similarly, your ally’s feats and abilities apply to reloading, while your feats and abilities apply to making attacks. This feat does not allow you and your ally to act simultaneously on the same initiative.",
      "_icon" : "",
      "_requires" : ["Proficiency with light crossbow, heavy crossbow, or musket","size Small or Medium"]
    }
  },
  "artistry" : {
    "_name" : "Artistry",
    "_description" : "Choose one of the following combat maneuvers: disarm, reposition, steal, sunder, or trip. You gain a +2 bonus when performing the selected maneuver while wielding a dueling sword. This bonus does not stack with the bonus provided by a combat maneuver feat with -improved- in its name (such as Improved Trip).",
    "_icon" : "",
    "+feats.artistry" : {
      "_name" : "Artistry",
      "_description" : "Choose one of the following combat maneuvers: disarm, reposition, steal, sunder, or trip. You gain a +2 bonus when performing the selected maneuver while wielding a dueling sword. This bonus does not stack with the bonus provided by a combat maneuver feat with -improved- in its name (such as Improved Trip). You can select this feat multiple times, choosing a different combat maneuver each time.",
      "_icon" : "",
      "_requires" : ["Exotic Weapon Proficiency - dueling sword","Weapon Finesse","base attack bonus +2"]
    }
  },
  "ascetic_style" : {
    "_name" : "Ascetic Style",
    "_description" : "Choose one weapon from the monk fighter weapon group. While using this style and wielding the chosen weapon, you can apply the effects of feats that have Improved Unarmed Strike as a prerequisite, as well as effects that augment an unarmed strike, as if attacks with the weapon were unarmed attacks.",
    "_icon" : "",
    "+feats.ascetic_style" : {
      "_name" : "Ascetic Style",
      "_description" : "Choose one weapon from the monk fighter weapon group. While using this style and wielding the chosen weapon, you can apply the effects of feats that have Improved Unarmed Strike as a prerequisite, as well as effects that augment an unarmed strike, as if attacks with the weapon were unarmed attacks. A 5th-level monk or character with the weapon training (monk) class feature can use Ascetic Style with any monk weapon, in addition to the chosen melee weapon.",
      "_icon" : "",
      "_requires" : ["Weapon Focus with the chosen melee weapon","base attack bonus +1 or monk level 1"]
    }
  },
  "ascetic_form" : {
    "_name" : "Ascetic Form",
    "_description" : "You can use the chosen melee weapon with any class ability that can be used with an unarmed strike, such as an unchained monk’s style strike ability. In addition, you are treated as a monk with a level equal to your character level for the purpose of determining the number of times per day that you can use feats with uses per day that depend upon your monk level, such as the Stunning Fist or Perfect Strike feats.",
    "_icon" : "",
    "+feats.acetic_form" : {
      "_name" : "Ascetic Form",
      "_description" : "You can use the chosen melee weapon with any class ability that can be used with an unarmed strike, such as an unchained monk’s style strike ability. In addition, you are treated as a monk with a level equal to your character level for the purpose of determining the number of times per day that you can use feats with uses per day that depend upon your monk level, such as the Stunning Fist or Perfect Strike feats.",
      "_icon" : "",
      "_requires" : ["Ascetic Style","Weapon Focus with the chosen melee weapon","base attack bonus +5 or monk level 5"]
    }
  },
  "ascetic_strike" : {
    "_name" : "Ascetic Strike",
    "_description" : "You can use the unarmed strike damage of a monk 4 levels lower than your character level (minimum 1st) instead of the base damage for the chosen weapon. Ascetic Strike functions in all other ways as the brawler’s close weapon mastery class feature. In addition, you ignore the still mind class feature prerequisite for the Monastic Legacy feat.",
    "_icon" : "",
    "+feats.ascetic_strike" : {
      "_name" : "Ascetic Strike",
      "_description" : "You can use the unarmed strike damage of a monk 4 levels lower than your character level (minimum 1st) instead of the base damage for the chosen weapon. Ascetic Strike functions in all other ways as the brawler’s close weapon mastery class feature. In addition, you ignore the still mind class feature prerequisite for the Monastic Legacy feat.",
      "_icon" : "",
      "_requires" : ["Ascetic Form","Ascetic Style","Weapon Focus with the chosen weapon","base attack bonus +7 or monk level 7"]
    }
  },
  "awe_inspiring_smash" : {
    "_name" : "Awe-Inspiring Smash",
    "_description" : "You can apply your Strength modifier instead of your Charisma modifier to performance combat checks. In addition, when you spend a swift action to attempt a performance combat check that was triggered by a successful bull rush or sunder combat maneuver check, you gain a +2 bonus on the performance combat check. For every 5 points by which your attack exceeded your opponent’s CMD, this bonus increases by 2.",
    "_icon" : "",
    "+feats.awe_inspiring_smash" : {
      "_name" : "Awe-Inspiring Smash",
      "_description" : "You can apply your Strength modifier instead of your Charisma modifier to performance combat checks. In addition, when you spend a swift action to attempt a performance combat check that was triggered by a successful bull rush or sunder combat maneuver check, you gain a +2 bonus on the performance combat check. For every 5 points by which your attack exceeded your opponent’s CMD, this bonus increases by 2.",
      "_icon" : "",
      "_requires" : ["Strength 15","Power Attack","base attack bonus +3"]
    }
  },
  "awesome_blow" : {
    "_name" : "Awesome Blow",
    "_description" : "As a standard action, the creature may perform an awesome blow combat maneuver. If the creature’s maneuver succeeds against a corporeal opponent smaller than itself, its opponent takes damage (typically slam damage plus Strength bonus) and is knocked flying 10 feet in a direction of the attacking creature’s choice and falls prone. The attacking creature can only push the opponent in a straight line, and the opponent can’t move closer to the attacking creature than the square it started in. If an obstacle prevents the completion of the opponent’s move, the opponent and the obstacle each take 1d6 points of damage, and the opponent is knocked prone in the space adjacent to the obstacle.",
    "_icon" : "",
    "+feats.awesome_blow" : {
      "_name" : "Awesome Blow",
      "_description" : "As a standard action, the creature may perform an awesome blow combat maneuver. If the creature’s maneuver succeeds against a corporeal opponent smaller than itself, its opponent takes damage (typically slam damage plus Strength bonus) and is knocked flying 10 feet in a direction of the attacking creature’s choice and falls prone. The attacking creature can only push the opponent in a straight line, and the opponent can’t move closer to the attacking creature than the square it started in. If an obstacle prevents the completion of the opponent’s move, the opponent and the obstacle each take 1d6 points of damage, and the opponent is knocked prone in the space adjacent to the obstacle.",
      "_icon" : "",
      "_requires" : ["Strength 25","Power Attack","Improved Bull Rush","size Large or larger"]
    }
  },
  "improved_awesome_blow" : {
    "_name" : "Improved Awesome Blow",
    "_description" : "You receive a +2 bonus on checks to perform an awesome blow combat maneuver. You also gain a +2 bonus to your combat maneuver defense whenever an opponent tries to perform an awesome blow combat maneuver against you. Whenever you successfully perform an awesome blow combat maneuver, your opponent’s movement provokes attacks of opportunity from all your allies (but not you). ",
    "_icon" : "",
    "+feats.improved_awesome_blow" : {
      "_name" : "Improved Awesome Blow",
      "_description" : "You receive a +2 bonus on checks to perform an awesome blow combat maneuver. You also gain a +2 bonus to your combat maneuver defense whenever an opponent tries to perform an awesome blow combat maneuver against you. Whenever you successfully perform an awesome blow combat maneuver, your opponent’s movement provokes attacks of opportunity from all your allies (but not you). ",
      "_icon" : "",
      "_requires" : ["Strength 13","Awesome Blow or awesome blow class feature","Power Attack"]
    }
  },
  "awesome_charge" : {
    "_name" : "Awesome Charge",
    "_description" : "When you hit your opponent with a charge attack, you can attempt an awesome blow combat maneuver against that opponent as a free action.",
    "_icon" : "",
    "+feats.awesome_charge" : {
      "_name" : "Awesome Charge",
      "_description" : "When you hit your opponent with a charge attack, you can attempt an awesome blow combat maneuver against that opponent as a free action.",
      "_icon" : "",
      "_requires" : ["Strength 25","Awesome Blow","Improved Bull Rush","Power Attack"]
    }
  },
  "awesome_throw" : {
    "_name" : "Awesome Throw",
    "_description" : "As a standard action, you can perform the awesome throw combat maneuver. You do this by making a thrown weapon attack; if you don’t have the Throw Anything feat, you must use a large, bulky, and relatively regular-shaped object with a hardness of at least 5 (such as a rock or treasure chest). If that attack hits a corporeal opponent smaller than you, the opponent takes damage and is knocked away, flying 10 feet in a straight line away from you and falling prone. If an obstacle prevents the completion of your target’s move, the target and the obstacle each take 1d6 points of damage, and the target is knocked prone in a space adjacent to the obstacle.",
    "_icon" : "",
    "+feats.awesome_throw" : {
      "_name" : "Awesome Throw",
      "_description" : "As a standard action, you can perform the awesome throw combat maneuver. You do this by making a thrown weapon attack; if you don’t have the Throw Anything feat, you must use a large, bulky, and relatively regular-shaped object with a hardness of at least 5 (such as a rock or treasure chest). If that attack hits a corporeal opponent smaller than you, the opponent takes damage and is knocked away, flying 10 feet in a straight line away from you and falling prone. If an obstacle prevents the completion of your target’s move, the target and the obstacle each take 1d6 points of damage, and the target is knocked prone in a space adjacent to the obstacle.",
      "_icon" : "",
      "_requires" : ["Strength 25","Throw Anything or Rock Throwing","Improved Bull Rush","size Large or larger"]
    }
  },
  "banner_of_doom" : {
    "_name" : "Banner of Doom",
    "_description" : "As long your banner is clearly visible, all enemies within 60 feet take a –2 penalty on saving throws against fear. This penalty does not stack with other effects that provide enemies with penalties on saving throws against fear.",
    "_icon" : "",
    "+feats.banner_of_doom" : {
      "_name" : "Banner of Doom",
      "_description" : "As long your banner is clearly visible, all enemies within 60 feet take a –2 penalty on saving throws against fear. This penalty does not stack with other effects that provide enemies with penalties on saving throws against fear.",
      "_icon" : "",
      "_requires" : ["Base attack bonus +8","banner class feature","Tiefling"]
    }
  },
  "barrage_of_styles" : {
    "_name" : "Barrage of Styles",
    "_description" : "You gain a cumulative +1 morale bonus (maximum +4) on combat maneuver checks for each human ally who also has this feat, is threatening the same foe, and does not share an ethnicity with you or any other ally threatening that foe.",
    "_icon" : "",
    "+feats.barrage_of_styles" : {
      "_name" : "Barrage of Styles",
      "_description" : "You gain a cumulative +1 morale bonus (maximum +4) on combat maneuver checks for each human ally who also has this feat, is threatening the same foe, and does not share an ethnicity with you or any other ally threatening that foe.",
      "_icon" : "",
      "_requires" : ["Base attack bonus +1","Human"]
    }
  },
  "barroom_brawler" : {
    "_name" : "Barroom Brawler",
    "_description" : "Once per day as a move action, you can gain the benefit of a combat feat that you do not possess for 1 minute. You must otherwise meet the feat’s requirements.",
    "_icon" : "",
    "+feats.barroom_brawler" : {
      "_name" : "Barroom Brawler",
      "_description" : "Once per day as a move action, you can gain the benefit of a combat feat that you do not possess for 1 minute. You must otherwise meet the feat’s requirements. If you have the martial flexibility class feature, this feat instead grants you one additional use per day of that ability.",
      "_icon" : "",
      "_requires" : ["Base attack bonus +4"]
    }
  },
  "bashing_finish" : {
    "_name" : "Bashing Finish",
    "_description" : "Whenever you score a critical hit with a melee weapon, you can make a shield bash attack against the same target using the same bonus as a free action.",
    "_icon" : "",
    "+feats.bashing_finish" : {
      "_name" : "Bashing Finish",
      "_description" : "Whenever you score a critical hit with a melee weapon, you can make a shield bash attack against the same target using the same bonus as a free action.",
      "_icon" : "",
      "_requires" : ["Improved Shield Bash","Shield Master","Two-Weapon Fighting","Base attack bonus +11"]
    }
  },
  "battle_cry" : {
    "_name" : "Battle Cry",
    "_description" : "A number of times per day equal to your Charisma bonus, you can let out a battle cry as a swift action. When you do, allies within 30 feet who can hear you gain a +1 morale bonus on attack rolls and a +4 morale bonus on saving throws against fear. This effect lasts for 1 minute. If an ally is under the effect of this feat and fails a saving throw, she can choose to end the battle cry’s effect on her to reroll the failed save against a fear effect. The ally must take the result of the reroll, even if it’s lower. Each ally can use this effect only once per use of this feat. This is a combat feat, and can be selected as a brawler, fighter, gunslinger, swashbuckler, and warpriest bonus feat.",
    "_icon" : "",
    "+feats.battle_cry" : {
      "_name" : "Battle Cry",
      "_description" : "A number of times per day equal to your Charisma bonus, you can let out a battle cry as a swift action. When you do, allies within 30 feet who can hear you gain a +1 morale bonus on attack rolls and a +4 morale bonus on saving throws against fear. This effect lasts for 1 minute. If an ally is under the effect of this feat and fails a saving throw, she can choose to end the battle cry’s effect on her to reroll the failed save against a fear effect. The ally must take the result of the reroll, even if it’s lower. Each ally can use this effect only once per use of this feat. This is a combat feat, and can be selected as a brawler, fighter, gunslinger, swashbuckler, and warpriest bonus feat.",
      "_icon" : "",
      "_requires" : ["Charisma 13","base attack bonus +5 or Perform (act, oratory, or sing) rank 5"]
    }
  },
  "bears_balance" : {
    "_name" : "Bear's Balance",
    "_description" : "You gain a +2 bonus on Intimidate checks when not raging. When you fail a saving throw against a fear effect, you can choose to enter your rage rather than succumb to fear. You can not voluntarily end your rage until the fear effect expires or is ended in some other way (such as due to the death of the fear-inducing creature) or you exhaust your rounds of rage for the day. This feat has no effect if you are already raging when exposed to a fear effect.",
    "_icon" : "",
    "+feats.bears_balance" : {
      "_name" : "Bear's Balance",
      "_description" : "You gain a +2 bonus on Intimidate checks when not raging. When you fail a saving throw against a fear effect, you can choose to enter your rage rather than succumb to fear. You can not voluntarily end your rage until the fear effect expires or is ended in some other way (such as due to the death of the fear-inducing creature) or you exhaust your rounds of rage for the day. This feat has no effect if you are already raging when exposed to a fear effect.",
      "_icon" : "",
      "_requires" : ["Iron Will","Rage class feature"]
    }
  },
  "beast_hunter" : {
    "_name" : "Beast Hunter",
    "_description" : "Pick one of the ranger’s favored terrains. You gain a +2 bonus on Survival checks to track animals native to that terrain. Additionally, against animals native to that terrain that are at least one size category larger than you, you gain a +1 dodge bonus to your AC and a +1 insight bonus on attack rolls.",
    "_icon" : "",
    "+feats.beast_hunter" : {
      "_name" : "Beast Hunter",
      "_description" : "Pick one of the ranger’s favored terrains. You gain a +2 bonus on Survival checks to track animals native to that terrain. Additionally, against animals native to that terrain that are at least one size category larger than you, you gain a +1 dodge bonus to your AC and a +1 insight bonus on attack rolls. You can take this feat multiple times. Each time you select this feat, you can choose an additional favored terrain to gain the listed benefits in.",
      "_icon" : "",
      "_requires" : ["Base attack bonus +1","Knowledge (nature) or Survival rank 1"]
    }
  },
  "improved_beast_hunter" : {
    "_name" : "Improved Beast Hunter",
    "_description" : "When fighting animals that are at least one size category larger than you and that are native to the terrain you have chosen with Beast Hunter, you gain a +4 bonus on combat maneuver checks and a +4 to your CMD against such animals‘ attempts to use combat maneuvers against you. Additionally, you gain a +2 bonus on Reflex saves against attacks by the animal that allow a Reflex save (such as attempting to avoid a trample attack).",
    "_icon" : "",
    "+feats.improved_beast_hunter" : {
      "_name" : "Improved Beast Hunter",
      "_description" : "When fighting animals that are at least one size category larger than you and that are native to the terrain you have chosen with Beast Hunter, you gain a +4 bonus on combat maneuver checks and a +4 to your CMD against such animals‘ attempts to use combat maneuvers against you. Additionally, you gain a +2 bonus on Reflex saves against attacks by the animal that allow a Reflex save (such as attempting to avoid a trample attack). If you have selected Beast Hunter multiple times, you gain this benefit for all of the terrains you have chosen for those feats.",
      "_icon" : "",
      "_requires" : ["Beast Hunter","Base attack bonus +3","Knowledge (nature) or Survival rank 3"]
    }
  },
  "greater_beast_hunter" : {
    "_name" : "Greater Beast Hunter",
    "_description" : "If you are surprised by an animal native to the terrain you have chosen for Beast Hunter, you can act normally in the surprise round, though you are still considered flat-footed until it is your turn to act. You also gain a +4 bonus to confirm critical threats against animals native to the terrain you have chosen.",
    "_icon" : "",
    "+feats.greater_beast_hunter" : {
      "_name" : "Greater Beast Hunter",
      "_description" : "If you are surprised by an animal native to the terrain you have chosen for Beast Hunter, you can act normally in the surprise round, though you are still considered flat-footed until it is your turn to act. You also gain a +4 bonus to confirm critical threats against animals native to the terrain you have chosen. If you have selected Beast Hunter multiple times, you gain the benefits of this feat for all of the terrains you have chosen for those feats.",
      "_icon" : "",
      "_requires" : ["Beast Hunter","Improved Beast Hunter","Base attack bonus +6","Knowledge (nature) or Survival rank 6"]
    }
  },
  "befuddling_strike" : {
    "_name" : "Befuddling Strike",
    "_description" : "Befuddling Strike forces a foe damaged by your unarmed attack to attempt a Fortitude saving throw (DC = 10 + 1/2 your character level + your Wisdom modifier), in addition to dealing damage normally. You must declare that you are using this feat before you make your attack roll—thus, a failed attack roll ruins the attempt. A defender who fails this saving throw is confused for 1d4 rounds. You can attempt to use Befuddling Strike once per day for every 4 character levels you have, but can use it no more than once per round. Constructs, incorporeal creatures, mindless creatures, plants, undead, and creatures that are immune to critical hits cannot be affected by this ability.",
    "_icon" : "",
    "+feats.befuddling_strike" : {
      "_name" : "Befuddling Strike",
      "_description" : "Befuddling Strike forces a foe damaged by your unarmed attack to attempt a Fortitude saving throw (DC = 10 + 1/2 your character level + your Wisdom modifier), in addition to dealing damage normally. You must declare that you are using this feat before you make your attack roll—thus, a failed attack roll ruins the attempt. A defender who fails this saving throw is confused for 1d4 rounds. You can attempt to use Befuddling Strike once per day for every 4 character levels you have, but can use it no more than once per round. Constructs, incorporeal creatures, mindless creatures, plants, undead, and creatures that are immune to critical hits cannot be affected by this ability.",
      "_icon" : "",
      "_requires" : ["Dexterity 13","Wisdom 13","Improved Unarmed Strike","base attack bonus +8"]
    }
  },
  "betrayal_sense" : {
    "_name" : "Betrayal Sense",
    "_description" : "You gain a bonus on Perception checks to pierce another creature’s disguise and Sense Motive checks to avoid being surprised by an attack. These bonuses are equal to the bonus you gain from trap sense.",
    "_icon" : "",
    "+feats.betrayal_sense" : {
      "_name" : "Betrayal Sense",
      "_description" : "You gain a bonus on Perception checks to pierce another creature’s disguise and Sense Motive checks to avoid being surprised by an attack. These bonuses are equal to the bonus you gain from trap sense.",
      "_icon" : "",
      "_requires" : ["Wisdom 13","Rogue level 3","Trap Sense class feature"]
    }
  },
  "betraying_blow" : {
    "_name" : "Betraying Blow",
    "_description" : "Whenever you use a melee attack to deal nonlethal damage to a creature that only you threaten, roll a Bluff check opposed by your opponent’s Sense Motive check. You deal an additional amount of nonlethal damage equal to 1/2 the difference between your Bluff check and your opponent’s Sense Motive check (minimum 0). If your opponent has an attitude of friendly or helpful toward you (including temporarily due to Intimidate checks, charm person, and similar effects), you instead deal an amount of extra nonlethal damage equal to the difference between your checks. Regardless, the amount of extra nonlethal damage you deal with this feat cannot exceed your Hit Dice.",
    "_icon" : "",
    "+feats.betraying_blow" : {
      "_name" : "Betraying Blow",
      "_description" : "Whenever you use a melee attack to deal nonlethal damage to a creature that only you threaten, roll a Bluff check opposed by your opponent’s Sense Motive check. You deal an additional amount of nonlethal damage equal to 1/2 the difference between your Bluff check and your opponent’s Sense Motive check (minimum 0). If your opponent has an attitude of friendly or helpful toward you (including temporarily due to Intimidate checks, charm person, and similar effects), you instead deal an amount of extra nonlethal damage equal to the difference between your checks. Regardless, the amount of extra nonlethal damage you deal with this feat cannot exceed your Hit Dice.",
      "_icon" : "",
      "_requires" : ["Solo Maneuvers","base attack bonus +8"]
    }
  },
  "binding_throw" : {
    "_name" : "Binding Throw",
    "_description" : "After you successfully use the Ki Throw feat on an opponent, you can use a swift action to attempt a grapple combat maneuver against that opponent.",
    "_icon" : "",
    "+feats.binding_throw" : {
      "_name" : "Binding Throw",
      "_description" : "After you successfully use the Ki Throw feat on an opponent, you can use a swift action to attempt a grapple combat maneuver against that opponent.",
      "_icon" : "",
      "_requires" : ["Improved Grapple","Improved Trip","Improved Unarmed Strike","Ki Throw"]
    }
  },
  "blade_binder" : {
    "_name" : "Blade Binder",
    "_description" : "You receive a +2 bonus on CMB checks made to bind an opponent’s weapon, as well as any opposed checks to maintain the bind. This bonus stacks with the +2 bonus from wielding a khopesh or temple sword. If you succeed in blade binding your opponent, your opponent becomes flat-footed until he either wrestles his blade free or drops his weapon.",
    "_icon" : "",
    "+feats.blade_binder" : {
      "_name" : "Blade Binder",
      "_description" : "You receive a +2 bonus on CMB checks made to bind an opponent’s weapon, as well as any opposed checks to maintain the bind. This bonus stacks with the +2 bonus from wielding a khopesh or temple sword. If you succeed in blade binding your opponent, your opponent becomes flat-footed until he either wrestles his blade free or drops his weapon. A monk may add Blade Binder to their bonus feat list at 6th level.",
      "_icon" : "",
      "_requires" : ["Base attack bonus +4","Proficiency with Khopesh or Temple Sword"]
    }
  },
  "blades_above_and_below" : {
    "_name" : "Blades Above and Below",
    "_description" : "When you and your ally who also has this feat threaten the same enemy, you’re both considered to be flanking that enemy, regardless of your actual positioning. To gain this benefit, you and your ally must be of different size categories, and your target must be the same size category as either you or your ally.",
    "_icon" : "",
    "+feats.blades_above_and_below" : {
      "_name" : "Blades Above and Below",
      "_description" : "When you and your ally who also has this feat threaten the same enemy, you’re both considered to be flanking that enemy, regardless of your actual positioning. To gain this benefit, you and your ally must be of different size categories, and your target must be the same size category as either you or your ally.",
      "_icon" : "",
      "_requires" : ["Base attack bonus +6"]
    }
  },
  "blazing_aura" : {
    "_name" : "Blazing Aura",
    "_description" : "When you use Scorching Weapons, on your turn as a free action, you may create an aura of heat that lasts for 1 round. This aura deals 1d6 points of fire damage to any creature that begins its turn adjacent to you.",
    "_icon" : "",
    "+feats.blazing_aura" : {
      "_name" : "Blazing Aura",
      "_description" : "When you use Scorching Weapons, on your turn as a free action, you may create an aura of heat that lasts for 1 round. This aura deals 1d6 points of fire damage to any creature that begins its turn adjacent to you.",
      "_icon" : "",
      "_requires" : ["Inner Flame","Scorching Weapons","Character level 13","Ifrit"]
    }
  },
  "bleeding_attack" : {
    "_name" : "Bleeding Attack",
    "_description" : "When you damage an opponent with an unarmed strike, you deal an extra 1d4 bleed damage.",
    "_icon" : "",
    "+feats.bleeding_attack" : {
      "_name" : "Bleeding Attack",
      "_description" : "When you damage an opponent with an unarmed strike, you deal an extra 1d4 bleed damage. This ability does not stack with other special abilities, attacks, or items that allow you to deal bleed damage.",
      "_icon" : "",
      "_requires" : ["Improved Unarmed Strike"]
    }
  },
  "blind_fight" : {
    "_name" : "Blind-Fight",
    "_description" : "In melee, every time you miss because of concealment (see Combat), you can reroll your miss chance percentile roll one time to see if you actually hit. An invisible attacker gets no advantages related to hitting you in melee. That is, you don’t lose your Dexterity bonus to Armor Class, and the attacker doesn’t get the usual +2 bonus for being invisible. The invisible attacker’s bonuses do still apply for ranged attacks, however. You do not need to make Acrobatics skill checks to move at full speed while blinded.",
    "_icon" : "",
    "+feats.blind_fight" : {
      "_name" : "Blind-Fight",
      "_description" : "In melee, every time you miss because of concealment (see Combat), you can reroll your miss chance percentile roll one time to see if you actually hit. An invisible attacker gets no advantages related to hitting you in melee. That is, you don’t lose your Dexterity bonus to Armor Class, and the attacker doesn’t get the usual +2 bonus for being invisible. The invisible attacker’s bonuses do still apply for ranged attacks, however. You do not need to make Acrobatics skill checks to move at full speed while blinded. The Blind-Fight feat is of no use against a character who is the subject of a blink spell.",
      "_icon" : "",
      "_requires" : ["Improved Unarmed Strike"]
    }
  },
  "improved_blind_fight" : {
    "_name" : "Improved Blind-Fight",
    "_description" : "Your melee attacks ignore the miss chance for less than total concealment. You may still reroll your miss chance percentile roll for total concealment. If you successfully pinpoint an invisible or hidden attacker within 30 feet, that attacker gets no advantages related to hitting you with ranged attacks. That is, you don’t lose your Dexterity bonus to Armor Class, and the attacker doesn’t get the usual +2 bonus for being invisible.",
    "_icon" : "",
    "+feats.improved_blind_fight" : {
      "_name" : "Improved Blind-Fight",
      "_description" : "Your melee attacks ignore the miss chance for less than total concealment. You may still reroll your miss chance percentile roll for total concealment. If you successfully pinpoint an invisible or hidden attacker within 30 feet, that attacker gets no advantages related to hitting you with ranged attacks. That is, you don’t lose your Dexterity bonus to Armor Class, and the attacker doesn’t get the usual +2 bonus for being invisible. The Improved Blind-Fight feat is of no use against a character who is the subject of a blink spell.",
      "_icon" : "",
      "_requires" : ["Perception rank 10","Blind-Fight"]
    }
  },
  "greater_blind_fight" : {
    "_name" : "Greater Blind-Fight",
    "_description" : "Your melee attacks ignore the miss chance for less than total concealment, and you treat opponents with total concealment as if they had normal concealment (20% miss chance instead of 50%). You may still reroll a miss chance percentile roll as normal. If you successfully pinpoint an invisible or hidden attacker, that attacker gets no advantages related to hitting you with ranged attacks, regardless of the range. That is, you don’t lose your Dexterity bonus to Armor Class, and the attacker doesn’t get the usual +2 bonus for being invisible.",
    "_icon" : "",
    "+feats.greater_blind_fight" : {
      "_name" : "Greater Blind-Fight",
      "_description" : "Your melee attacks ignore the miss chance for less than total concealment, and you treat opponents with total concealment as if they had normal concealment (20% miss chance instead of 50%). You may still reroll a miss chance percentile roll as normal. If you successfully pinpoint an invisible or hidden attacker, that attacker gets no advantages related to hitting you with ranged attacks, regardless of the range. That is, you don’t lose your Dexterity bonus to Armor Class, and the attacker doesn’t get the usual +2 bonus for being invisible. The Greater Blind-Fight feat is of no use against a character who is the subject of a blink spell.",
      "_icon" : "",
      "_requires" : ["Perception rank 15","Improved Blind-Fight"]
    }
  },
  "blinded_blade_style" : {
    "_name" : "Blinded Blade Style",
    "_description" : "While you are using this style, you gain a number of benefits whenever you are blinded or unable to see (including when you wear a blindfold or close your eyes). Under such circumstances, you do not take any penalties on Strength– or Dexterity-based skill checks due to blindness. In addition, you gain a +4 bonus on hearing- and smell-based Perception checks and gain the scent special ability with a range of 10 feet; if you already have scent, the range of your scent ability increases by 10 feet instead. Having this feat counts as having 10 ranks in Perception for the purpose of satisfying the prerequisites of the Improved Blind-Fight feat, as well as any feat that lists Improved Blind-Fight as a prerequisite.",
    "_icon" : "",
    "+feats.blinded_blade_style" : {
      "_name" : "Blinded Blade Style",
      "_description" : "While you are using this style, you gain a number of benefits whenever you are blinded or unable to see (including when you wear a blindfold or close your eyes). Under such circumstances, you do not take any penalties on Strength– or Dexterity-based skill checks due to blindness. In addition, you gain a +4 bonus on hearing- and smell-based Perception checks and gain the scent special ability with a range of 10 feet; if you already have scent, the range of your scent ability increases by 10 feet instead. Having this feat counts as having 10 ranks in Perception for the purpose of satisfying the prerequisites of the Improved Blind-Fight feat, as well as any feat that lists Improved Blind-Fight as a prerequisite.",
      "_icon" : "",
      "_requires" : ["Blind-Fight","Perception rank 5"]
    }
  },
  "blinded_competence" : {
    "_name" : "Blinded Competence",
    "_description" : "While you are using Blinded Blade Style and you are blinded or unable to see, you do not need to succeed at Perception checks to pinpoint the location of creatures within reach of your melee weapon, or your unmodified reach if you are not wielding a melee weapon. This ability functions like blindsense, except creatures you cannot see do not gain total concealment against you. Having this feat counts as having 15 ranks in Perception for the purpose of satisfying the prerequisites of the Greater Blind-Fight feat, as well as any feat that lists Greater Blind-Fight as a prerequisite.",
    "_icon" : "",
    "+feats.blinded_competence" : {
      "_name" : "Blinded Competence",
      "_description" : "While you are using Blinded Blade Style and you are blinded or unable to see, you do not need to succeed at Perception checks to pinpoint the location of creatures within reach of your melee weapon, or your unmodified reach if you are not wielding a melee weapon. This ability functions like blindsense, except creatures you cannot see do not gain total concealment against you. Having this feat counts as having 15 ranks in Perception for the purpose of satisfying the prerequisites of the Greater Blind-Fight feat, as well as any feat that lists Greater Blind-Fight as a prerequisite.",
      "_icon" : "",
      "_requires" : ["Blinded Blade Style","Blind-Fight","Improved Blind-Fight","Perception rank 10"]
    }
  },
  "blinded_master" : {
    "_name" : "Blinded Master",
    "_description" : "While you are using Blinded Blade Style and you are blinded or unable to see, your ability to pinpoint creatures’ locations using Blinded Competence improves to function like blindsight rather than blindsense, and the range increases to 30 feet. In addition, you add half your character level to the DCs of Bluff checks to feint you in combat.",
    "_icon" : "",
    "+feats.blinded_master" : {
      "_name" : "Blinded Master",
      "_description" : "While you are using Blinded Blade Style and you are blinded or unable to see, your ability to pinpoint creatures’ locations using Blinded Competence improves to function like blindsight rather than blindsense, and the range increases to 30 feet. In addition, you add half your character level to the DCs of Bluff checks to feint you in combat.",
      "_icon" : "",
      "_requires" : ["Blind-Fight","Blinded Competence","Blinded Blade Style","Greater Blind-Fight","Improved Blind-Fight","Perception rank 15"]
    }
  },
  "blinding_flash" : {
    "_name" : "Blinding Flash",
    "_description" : "As a move action, you can expertly angle the blade of your weapon or shield to reflect light into an opponent’s eyes, dazzling your foe for 1 round. This feat functions as a gaze attack, and the target must make a Fortitude save (DC 10 + 1/2 your character level + your Dex modifier) to resist the effect. This is a sight-dependent effect, and does not work on creatures that are already blinded or creatures that do not rely on sight as their primary sense. You must be wielding a weapon or shield with a polished or reflective surface in order to use this feat. You must be in an area of bright light to use this feat.",
    "_icon" : "",
    "+feats.blinding_flash" : {
      "_name" : "Blinding Flash",
      "_description" : "As a move action, you can expertly angle the blade of your weapon or shield to reflect light into an opponent’s eyes, dazzling your foe for 1 round. This feat functions as a gaze attack, and the target must make a Fortitude save (DC 10 + 1/2 your character level + your Dex modifier) to resist the effect. This is a sight-dependent effect, and does not work on creatures that are already blinded or creatures that do not rely on sight as their primary sense. You must be wielding a weapon or shield with a polished or reflective surface in order to use this feat. You must be in an area of bright light to use this feat.",
      "_icon" : "",
      "_requires" : ["Dexterity 13","Combat Expertise"]
    }
  },
  "blinding_light" : {
    "_name" : "Blinding Light",
    "_description" : "Whenever an enemy unsuccessfully attempts to counter or dispel your daylight spell-like ability, it must succeed at a Fortitude saving throw (DC 10 + 1/2 your character level + your Charisma modifier) or become blinded for 1 round as its mind is overwhelmed with celestial light. This is a supernatural mind-affecting effect.",
    "_icon" : "",
    "+feats.blinding_light" : {
      "_name" : "Blinding Light",
      "_description" : "Whenever an enemy unsuccessfully attempts to counter or dispel your daylight spell-like ability, it must succeed at a Fortitude saving throw (DC 10 + 1/2 your character level + your Charisma modifier) or become blinded for 1 round as its mind is overwhelmed with celestial light. This is a supernatural mind-affecting effect.",
      "_icon" : "",
      "_requires" : ["Inner Light","Aasimar","daylight spell-like ability"]
    }
  },
  "blinding_sneak_attack" : {
    "_name" : "Blinding Sneak Attack",
    "_description" : "When you successfully deal sneak attack damage to a foe while you are within an area of magical darkness, you temporarily blind your opponent for 1 round. A successful Fortitude save (DC 10 + the amount of sneak attack damage dealt) negates this effect.",
    "_icon" : "",
    "+feats.blinding_sneak_attack" : {
      "_name" : "Blinding Sneak Attack",
      "_description" : "When you successfully deal sneak attack damage to a foe while you are within an area of magical darkness, you temporarily blind your opponent for 1 round. A successful Fortitude save (DC 10 + the amount of sneak attack damage dealt) negates this effect.",
      "_icon" : "",
      "_requires" : ["Base attack bonus +5","darkness spell-like ability","sneak attack class feature","Tiefling"]
    }
  },
  "blistering_feint" : {
    "_name" : "Blistering Feint",
    "_description" : "You gain a +2 bonus on feint checks made while wielding a weapon that deals fire damage. Anytime you successfully feint a creature while using such a weapon, you may deal its fire damage to the enemy.",
    "_icon" : "",
    "+feats.blistering_feint" : {
      "_name" : "Blistering Feint",
      "_description" : "You gain a +2 bonus on feint checks made while wielding a weapon that deals fire damage. Anytime you successfully feint a creature while using such a weapon, you may deal its fire damage to the enemy.",
      "_icon" : "",
      "_requires" : ["Combat Expertise","Improved Feint","Ifrit"]
    }
  },
  "blood_beak" : {
    "_name" : "Blood Beak",
    "_description" : "Increase the damage of your beak attack to 1d6. Furthermore, when you confirm a critical hit with your beak attack, you also deal 1 point of bleed damage.",
    "_icon" : "",
    "+feats.blood_beak" : {
      "_name" : "Blood Beak",
      "_description" : "Increase the damage of your beak attack to 1d6. Furthermore, when you confirm a critical hit with your beak attack, you also deal 1 point of bleed damage. The bleed effect from this feat stacks with that of the Bleeding Critical feat and similar effects, adding 1 point to your bleed damage.",
      "_icon" : "",
      "_requires" : ["Base attack bonus +5","natural weapon racial trait","Tengu"]
    }
  },
  "blooded_arcane_strike" : {
    "_name" : "Blooded Arcane Strike",
    "_description" : "While you are bloodraging, you don’t need to spend a swift action to use your Arcane Strike—it is always in effect. When you use this ability with Vital Strike, Improved Vital Strike, or Greater Vital Strike, the bonus on damage rolls for Arcane Strike is multiplied by the number of times (two, three, or four) you roll damage dice for one of those feats.",
    "_icon" : "",
    "+feats.blooded_arcane_strike" : {
      "_name" : "Blooded Arcane Strike",
      "_description" : "While you are bloodraging, you don’t need to spend a swift action to use your Arcane Strike—it is always in effect. When you use this ability with Vital Strike, Improved Vital Strike, or Greater Vital Strike, the bonus on damage rolls for Arcane Strike is multiplied by the number of times (two, three, or four) you roll damage dice for one of those feats.",
      "_icon" : "",
      "_requires" : ["Arcane Strike","ability to cast arcane spells","bloodrage class feature"]
    }
  },
  "blood_feast" : {
    "_name" : "Blood Feast",
    "_description" : "When you damage a living creature with your bite attack, you gain a +1 morale bonus on attack and damage rolls with your bite attack until the end of your next turn.",
    "_icon" : "",
    "+feats.blood_feast" : {
      "_name" : "Blood Feast",
      "_description" : "When you damage a living creature with your bite attack, you gain a +1 morale bonus on attack and damage rolls with your bite attack until the end of your next turn.",
      "_icon" : "",
      "_requires" : ["Bite attack"]
    }
  },
  "blood_spurt" : {
    "_name" : "Blood Spurt",
    "_description" : "Whenever a creature adjacent to you hits you with a melee attack that deals bleed damage, that creature must succeed at a Fortitude save (DC = 10 + 1/2 your character level + your Constitution modifier) or become blinded for 1d4 rounds as your blood sprays it in the face. Additionally, if you have a special ability that deals bleed damage (such as a rogue’s bleeding strike rogue talent), as a standard action, you can deal 1 point of bleed damage to yourself to spray blood in the face of an adjacent creature of your choice, causing the same effect. The creature only needs to attempt the saving throw for the first of its attacks that deals bleed damage.",
    "_icon" : "",
    "+feats.blood_spurt" : {
      "_name" : "Blood Spurt",
      "_description" : "Whenever a creature adjacent to you hits you with a melee attack that deals bleed damage, that creature must succeed at a Fortitude save (DC = 10 + 1/2 your character level + your Constitution modifier) or become blinded for 1d4 rounds as your blood sprays it in the face. Additionally, if you have a special ability that deals bleed damage (such as a rogue’s bleeding strike rogue talent), as a standard action, you can deal 1 point of bleed damage to yourself to spray blood in the face of an adjacent creature of your choice, causing the same effect. The creature only needs to attempt the saving throw for the first of its attacks that deals bleed damage.",
      "_icon" : "",
      "_requires" : ["Base attack bonus +2","susceptibility to bleed damage"]
    }
  },
  "bloody_assault" : {
    "_name" : "Bloody Assault",
    "_description" : "You can choose to take a –5 penalty on all melee attack rolls and combat maneuver checks to inflict 1d4 points of bleed damage with your weapon melee attacks, in addition to the normal damage dealt by the weapon. A creature continues to take bleed damage every round at the start of its turn. Bleed damage can be stopped by a DC 15 Heal check or through any magical healing. Bleed damage from this feat does not stack with itself. You must choose to use this feat before making the attack roll, and its effects last until your next turn (although the bleeding lasts until healed, as normal).",
    "_icon" : "",
    "+feats.bloody_assault" : {
      "_name" : "Bloody Assault",
      "_description" : "You can choose to take a –5 penalty on all melee attack rolls and combat maneuver checks to inflict 1d4 points of bleed damage with your weapon melee attacks, in addition to the normal damage dealt by the weapon. A creature continues to take bleed damage every round at the start of its turn. Bleed damage can be stopped by a DC 15 Heal check or through any magical healing. Bleed damage from this feat does not stack with itself. You must choose to use this feat before making the attack roll, and its effects last until your next turn (although the bleeding lasts until healed, as normal).",
      "_icon" : "",
      "_requires" : ["Strength 13","Power Attack","base attack bonus +6"]
    }
  },
  "bloody_vengeance" : {
    "_name" : "Bloody Vengeance",
    "_description" : "If an opponent within line of sight has damaged you within the last minute, you may study that opponent as a standard action. Thereafter, if you hit that opponent with a melee attack, you deal 1 point of bleed damage to that creature in addition to the normal damage dealt by your attack.",
    "_icon" : "",
    "+feats.bloody_vengeance" : {
      "_name" : "Bloody Vengeance",
      "_description" : "If an opponent within line of sight has damaged you within the last minute, you may study that opponent as a standard action. Thereafter, if you hit that opponent with a melee attack, you deal 1 point of bleed damage to that creature in addition to the normal damage dealt by your attack.",
      "_icon" : "",
      "_requires" : ["base attack bonus +1","worshiper of a chaotic neutral deity"]
    }
  },
  "bludgeoner" : {
    "_name" : "Bludgeoner",
    "_description" : "You take a –4 penalty on attack rolls when using a lethal weapon to deal nonlethal damage. You cannot use a lethal weapon to deal nonlethal damage in a sneak attack.",
    "_icon" : "",
    "+feats.bludgeoner" : {
      "_name" : "Bludgeoner",
      "_description" : "You take a –4 penalty on attack rolls when using a lethal weapon to deal nonlethal damage. You cannot use a lethal weapon to deal nonlethal damage in a sneak attack. A rogue with this feat can use a lethal bludgeoning weapon to deal nonlethal damage with a sneak attack.",
      "_icon" : "",
      "_requires" : [""]
    }
  },
  "blundering_defense" : {
    "_name" : "Blundering Defense",
    "_description" : "Whenever you fight defensively or use the total defense action, allies gain a luck bonus to AC and CMD equal to 1/2 the dodge bonus you gain from the action you are taking. Allies only gain this bonus while they are adjacent to you.",
    "_icon" : "",
    "+feats.blundering_defense" : {
      "_name" : "Blundering Defense",
      "_description" : "Whenever you fight defensively or use the total defense action, allies gain a luck bonus to AC and CMD equal to 1/2 the dodge bonus you gain from the action you are taking. Allies only gain this bonus while they are adjacent to you.",
      "_icon" : "",
      "_requires" : ["Cautious Fighter","Halfling"]
    }
  },
  "bodyguard" : {
    "_name" : "Bodyguard",
    "_description" : "When an adjacent ally is attacked, you may use an attack of opportunity to attempt the aid another action to improve your ally’s AC. You may not use the aid another action to improve your ally’s attack roll with this attack.",
    "_icon" : "",
    "+feats.bodyguard" : {
      "_name" : "Bodyguard",
      "_description" : "When an adjacent ally is attacked, you may use an attack of opportunity to attempt the aid another action to improve your ally’s AC. You may not use the aid another action to improve your ally’s attack roll with this attack.",
      "_icon" : "",
      "_requires" : ["Combat Reflexes"]
    }
  },
  "body_shield" : {
    "_name" : "Body Shield",
    "_description" : "As an immediate action while you are grappling an adjacent creature, you can make a grapple combat maneuver check against that creature to gain cover against a single attack. If you are successful and the attack misses you, that attack targets the creature you used as cover, using the same attack roll. You cannot use this feat against a creature grappling you, and the cover you gain ends after the attack you gained cover against is resolved.",
    "_icon" : "",
    "+feats.body_shield" : {
      "_name" : "Body Shield",
      "_description" : "As an immediate action while you are grappling an adjacent creature, you can make a grapple combat maneuver check against that creature to gain cover against a single attack. If you are successful and the attack misses you, that attack targets the creature you used as cover, using the same attack roll. You cannot use this feat against a creature grappling you, and the cover you gain ends after the attack you gained cover against is resolved.",
      "_icon" : "",
      "_requires" : ["Dexterity 13","Improved Grapple","Improved Unarmed Strike","base attack bonus +6"]
    }
  },
  "branch_pounce" : {
    "_name" : "Branch Pounce",
    "_description" : "When charging a target by jumping down from above (such as when jumping out of a tree), you can soften your fall with a melee attack. If the attack at the end of your charge hits, the attack deals damage as normal and you also deal the amount of falling damage appropriate to your fall to the target (1d6 points for a 10-foot fall, 2d6 points for a 20-foot fall, and so on). This falling damage is not multiplied on a critical hit. You land in an unoccupied square of your choosing adjacent to the target, and you take falling damage as if your fall had been 10 feet shorter. You can attempt an Acrobatics check as normal to treat the fall as an additional 10 feet shorter for the purpose of determining the damage you take from the fall. If your attack misses, you land prone in a random square adjacent to the target and automatically take the full amount of falling damage.",
    "_icon" : "",
    "+feats.branch_pounce" : {
      "_name" : "Branch Pounce",
      "_description" : "When charging a target by jumping down from above (such as when jumping out of a tree), you can soften your fall with a melee attack. If the attack at the end of your charge hits, the attack deals damage as normal and you also deal the amount of falling damage appropriate to your fall to the target (1d6 points for a 10-foot fall, 2d6 points for a 20-foot fall, and so on). This falling damage is not multiplied on a critical hit. You land in an unoccupied square of your choosing adjacent to the target, and you take falling damage as if your fall had been 10 feet shorter. You can attempt an Acrobatics check as normal to treat the fall as an additional 10 feet shorter for the purpose of determining the damage you take from the fall. If your attack misses, you land prone in a random square adjacent to the target and automatically take the full amount of falling damage.",
      "_icon" : "",
      "_requires" : ["Climb rank 3","Stealth rank 3"]
    }
  },
  "bounding_hammer" : {
    "_name" : "Bounding Hammer",
    "_description" : "As a standard action, you may throw a hammer at an opponent within 20 feet. If you hit (whether or not the attack damages the target), the hammer rebounds off of the creature and lands in your square. If you have the Snatch Arrows feat, you may choose to catch the hammer when it enters your square (though this does not give you the ability to immediately throw the hammer). This ability may not work against some creatures or in certain circumstances as determined by the GM; for example, your weapon does not bounce off Incorporeal creatures (unless it has the ghost touch ability), it may stick to creatures with the adhesive ability, the slowing effect of fighting underwater prevents you from using this feat, and so on.",
    "_icon" : "",
    "+feats.bounding_hammer" : {
      "_name" : "Bounding Hammer",
      "_description" : "As a standard action, you may throw a hammer at an opponent within 20 feet. If you hit (whether or not the attack damages the target), the hammer rebounds off of the creature and lands in your square. If you have the Snatch Arrows feat, you may choose to catch the hammer when it enters your square (though this does not give you the ability to immediately throw the hammer). This ability may not work against some creatures or in certain circumstances as determined by the GM; for example, your weapon does not bounce off Incorporeal creatures (unless it has the ghost touch ability), it may stick to creatures with the adhesive ability, the slowing effect of fighting underwater prevents you from using this feat, and so on.",
      "_icon" : "",
      "_requires" : ["Proficiency with hammer","base attack bonus +6"]
    }
  },
  "break_guard" : {
    "_name" : "Break Guard",
    "_description" : "While wielding two weapons, whenever you successfully use one weapon to disarm an opponent, you can spend a swift action to attack the opponent you attempted to disarm using your other weapon.",
    "_icon" : "",
    "+feats.break_guard" : {
      "_name" : "Break Guard",
      "_description" : "While wielding two weapons, whenever you successfully use one weapon to disarm an opponent, you can spend a swift action to attack the opponent you attempted to disarm using your other weapon.",
      "_icon" : "",
      "_requires" : ["Dexterity 15","Intelligence 13","Combat Expertise","Improved Disarm","Two-Weapon Fighting"]
    }
  },
  "brutal_coup_de_grace" : {
    "_name" : "Brutal Coup de Grace",
    "_description" : "When you deliver a coup de grace with the selected weapon and kill the target, enemies within 30 feet of you who can see or hear you must succeed at a Will saving throw (DC = 10 + 1/2 your character level + your Charisma bonus) or become shaken. This is a mind-affecting fear effect.",
    "_icon" : "",
    "+feats.brutal_coup_de_grace" : {
      "_name" : "Brutal Coup de Grace",
      "_description" : "When you deliver a coup de grace with the selected weapon and kill the target, enemies within 30 feet of you who can see or hear you must succeed at a Will saving throw (DC = 10 + 1/2 your character level + your Charisma bonus) or become shaken. This is a mind-affecting fear effect.",
      "_icon" : "",
      "_requires" : ["Dazzling Display","Weapon Focus","base attack bonus +5","proficiency with the selected weapon"]
    }
  },
  "brutal_grappler" : {
    "_name" : "Brutal Grappler",
    "_description" : "When you and an ally with this feat have grappled the same creature, you may attempt to damage the opponent on your turn (whether you were the one who first initiated the grapple or were assisting your ally in doing so). You and the ally are treated as aiding each other in the grapple (+2 bonus on your grapple combat maneuver) as long as you both decide to maintain the grapple.",
    "_icon" : "",
    "+feats.brutal_grappler" : {
      "_name" : "Brutal Grappler",
      "_description" : "When you and an ally with this feat have grappled the same creature, you may attempt to damage the opponent on your turn (whether you were the one who first initiated the grapple or were assisting your ally in doing so). You and the ally are treated as aiding each other in the grapple (+2 bonus on your grapple combat maneuver) as long as you both decide to maintain the grapple.",
      "_icon" : "",
      "_requires" : ["Half-orc or Orc"]
    }
  },
  "brute_style" : {
    "_name" : "Brute Style",
    "_description" : "While using this style, you can use your Vicious Stomp feat against any opponent within 10 feet of you, as long as it is within your natural reach. If you don’t have the Vicious Stomp feat, you gain no benefit from this feat.",
    "_icon" : "",
    "+feats.brute_style" : {
      "_name" : "Brute Style",
      "_description" : "While using this style, you can use your Vicious Stomp feat against any opponent within 10 feet of you, as long as it is within your natural reach. If you don’t have the Vicious Stomp feat, you gain no benefit from this feat.",
      "_icon" : "",
      "_requires" : ["Strength 15","Intelligence 13","Combat Reflexes","Improved Overrun","Improved Trip","Improved Unarmed Strike","Vicious Stomp","base attack bonus +6"]
    }
  },
  "brute_stomp" : {
    "_name" : "Brute Stomp",
    "_description" : "While using Brute Style, when you make a full attack with a prone opponent adjacent to you that includes at least one unarmed strike, you can make an additional unarmed strike at your highest base attack bonus against that prone creature. These additional attacks don’t stack with those granted by Medusa’s Wrath, and this does not allow you to make an additional attack against a creature you tripped during your full attack. Additionally, you can use your Vicious Stomp feat against any opponent within your natural reach regardless of whether it falls prone adjacent to you.",
    "_icon" : "",
    "+feats.brute_stomp" : {
      "_name" : "Brute Stomp",
      "_description" : "While using Brute Style, when you make a full attack with a prone opponent adjacent to you that includes at least one unarmed strike, you can make an additional unarmed strike at your highest base attack bonus against that prone creature. These additional attacks don’t stack with those granted by Medusa’s Wrath, and this does not allow you to make an additional attack against a creature you tripped during your full attack. Additionally, you can use your Vicious Stomp feat against any opponent within your natural reach regardless of whether it falls prone adjacent to you.",
      "_icon" : "",
      "_requires" : ["Strength 19","Intelligence 13","Combat Reflexes","Improved Overrun","Improved Trip","Improved Unarmed Strike","Vicious Stomp","base attack bonus +8"]
    }
  },
  "brute_assault" : {
    "_name" : "Brute Assault",
    "_description" : "While using Brute Style, when you successfully perform an overrun or trip combat maneuver against an opponent that causes that opponent to fall prone, your opponent takes 1d6 points of Strength damage, and its base speed is halved until the Strength damage is healed. A successful Fortitude save (DC = 10 + your base attack bonus) reduces the Strength damage to 1 point and negates the movement speed reduction.",
    "_icon" : "",
    "+feats.brute_assault" : {
      "_name" : "Brute Assault",
      "_description" : "While using Brute Style, when you successfully perform an overrun or trip combat maneuver against an opponent that causes that opponent to fall prone, your opponent takes 1d6 points of Strength damage, and its base speed is halved until the Strength damage is healed. A successful Fortitude save (DC = 10 + your base attack bonus) reduces the Strength damage to 1 point and negates the movement speed reduction.",
      "_icon" : "",
      "_requires" : ["Strength 23","Intelligence 13","Brute Stomp","Brute Style","Combat Reflexes","Improved Overrun","Improved Trip","Improved Unarmed Strike","Vicious Stomp","base attack bonus +10"]
    }
  },
  "bulette_charge_style" : {
    "_name" : "Bulette Charge Style",
    "_description" : "While using this style, you gain a +4 bonus feats on combat maneuver checks to overrun an opponent. Any magic ability or material that reduces your armor check penalty also reduces the bonus you gain for this style.",
    "_icon" : "",
    "+feats.bulette_charge_style" : {
      "_name" : "Bulette Charge Style",
      "_description" : "While using this style, you gain a +4 bonus feats on combat maneuver checks to overrun an opponent. Any magic ability or material that reduces your armor check penalty also reduces the bonus you gain for this style. A character with the armor training class feature can use Bulette Charge Style while wearing any type of armor with which she is proficient. Medium armor grants a +3 bonus, and light armor grants a +2 bonus.",
      "_icon" : "",
      "_requires" : ["Strength 13","Improved Overrun","Power Attack","proficiency with heavy armor"]
    }
  },
  "bulette_rampage" : {
    "_name" : "Bulette Rampage",
    "_description" : "While using this style, you gain a +4 bonus feats on combat maneuver checks to overrun an opponent. Any magic ability or material that reduces your armor check penalty also reduces the bonus you gain for this style.",
    "_icon" : "",
    "+feats.bulette_rampage" : {
      "_name" : "Bulette Rampage",
      "_description" : "While using this style, you gain a +4 bonus feats on combat maneuver checks to overrun an opponent. Any magic ability or material that reduces your armor check penalty also reduces the bonus you gain for this style. A character with the armor training class feature can use Bulette Charge Style while wearing any type of armor with which she is proficient. Medium armor grants a +3 bonus, and light armor grants a +2 bonus.",
      "_icon" : "",
      "_requires" : ["Strength 15","Bulette Charge Style","Bulette Leap","Improved Overrun","Power Attack","proficiency with heavy armor"]
    }
  },
  "bulette_leap" : {
    "_name" : "Bulette Leap",
    "_description" : "While using Bulette Charge Style, you gain a bonus on Acrobatics checks to jump equal to your Strength bonus. Additionally, when you perform an overrun combat maneuver, you can attempt to overrun multiple foes, but you take a cumulative –2 penalty on each successive overrun attempt in the same round. If an overrun attempt fails, you cannot make any further attempts until your next round.",
    "_icon" : "",
    "+feats.bulette_leap" : {
      "_name" : "Bulette Leap",
      "_description" : "While using Bulette Charge Style, you gain a bonus on Acrobatics checks to jump equal to your Strength bonus. Additionally, when you perform an overrun combat maneuver, you can attempt to overrun multiple foes, but you take a cumulative –2 penalty on each successive overrun attempt in the same round. If an overrun attempt fails, you cannot make any further attempts until your next round.",
      "_icon" : "",
      "_requires" : ["Strength 15","Bulette Charge Style","Improved Overrun","Power Attack","proficiency with heavy armor"]
    }
  },
  "bull_rush_maneuver" : {
    "_name" : "Bull Rush Maneuver",
    "_description" : "You can make a bull rush as a standard action or as part of a charge, in place of the melee attack. You can only bull rush an opponent who is no more than one size category larger than you. A bull rush attempts to push an opponent straight back without doing any harm. If you do not have the Improved Bull Rush feat, or a similar ability, initiating a bull rush provokes an attack of opportunity from the target of your maneuver. If your attack is successful, your target is pushed back 5 feet. For every 5 by which your attack exceeds your opponent’s CMD you can push the target back an additional 5 feet. You can move with the target if you wish but you must have the available movement to do so. If your attack fails, your movement ends in front of the target. An enemy being moved by a bull rush does not provoke an attack of opportunity because of the movement unless you possess the Greater Bull Rush feat. You cannot bull rush a creature into a square that is occupied by a solid object or obstacle. If there is another creature in the way of your bull rush, you must immediately make a combat maneuver check to bull rush that creature. You take a –4 penalty on this check for each creature being pushed beyond the first. If you are successful, you can continue to push the creatures a distance equal to the lesser result. For example, if a fighter bull rushes a goblin for a total of 15 feet, but there is another goblin 5 feet behind the first, he must make another combat maneuver check against the second goblin after having pushed the first 5 feet. If his check reveals that he can push the second goblin a total of 20 feet, he can continue to push both goblins another 10 feet (since the first goblin will have moved a total of 15 feet).",
    "_icon" : "",
    "+feats.bull_rush_maneuver" : {
      "_name" : "Bull Rush Maneuver",
      "_description" : "You can make a bull rush as a standard action or as part of a charge, in place of the melee attack. You can only bull rush an opponent who is no more than one size category larger than you. A bull rush attempts to push an opponent straight back without doing any harm. If you do not have the Improved Bull Rush feat, or a similar ability, initiating a bull rush provokes an attack of opportunity from the target of your maneuver. If your attack is successful, your target is pushed back 5 feet. For every 5 by which your attack exceeds your opponent’s CMD you can push the target back an additional 5 feet. You can move with the target if you wish but you must have the available movement to do so. If your attack fails, your movement ends in front of the target. An enemy being moved by a bull rush does not provoke an attack of opportunity because of the movement unless you possess the Greater Bull Rush feat. You cannot bull rush a creature into a square that is occupied by a solid object or obstacle. If there is another creature in the way of your bull rush, you must immediately make a combat maneuver check to bull rush that creature. You take a –4 penalty on this check for each creature being pushed beyond the first. If you are successful, you can continue to push the creatures a distance equal to the lesser result. For example, if a fighter bull rushes a goblin for a total of 15 feet, but there is another goblin 5 feet behind the first, he must make another combat maneuver check against the second goblin after having pushed the first 5 feet. If his check reveals that he can push the second goblin a total of 20 feet, he can continue to push both goblins another 10 feet (since the first goblin will have moved a total of 15 feet).",
      "_icon" : "",
      "_requires" : [""]
    }
  },
  "improved_bull_rush" : {
    "_name" : "Improved Bull Rush",
    "_description" : "You do not provoke an attack of opportunity when performing a bull rush combat maneuver. In addition, you receive a +2 bonus on checks made to bull rush a foe. You also receive a +2 bonus to your Combat Maneuver Defense whenever an opponent tries to bull rush you.",
    "_icon" : "",
    "+feats.improved_bull_rush" : {
      "_name" : "Improved Bull Rush",
      "_description" : "You do not provoke an attack of opportunity when performing a bull rush combat maneuver. In addition, you receive a +2 bonus on checks made to bull rush a foe. You also receive a +2 bonus to your Combat Maneuver Defense whenever an opponent tries to bull rush you.",
      "_icon" : "",
      "_requires" : ["Strength 13","Power Attack","base attack bonus +1"]
    }
  },
  "greater_bull_rush" : {
    "_name" : "Greater Bull Rush",
    "_description" : "You receive a +2 bonus on checks made to bull rush a foe. This bonus stacks with the bonus granted by Improved Bull Rush. Whenever you bull rush an opponent, his movement provokes attacks of opportunity from all of your allies (but not you).",
    "_icon" : "",
    "+feats.greater_bull_rush" : {
      "_name" : "Greater Bull Rush",
      "_description" : "You receive a +2 bonus on checks made to bull rush a foe. This bonus stacks with the bonus granted by Improved Bull Rush. Whenever you bull rush an opponent, his movement provokes attacks of opportunity from all of your allies (but not you).",
      "_icon" : "",
      "_requires" : ["Improved Bull Rush","Strength 13","Power Attack","base attack bonus +6"]
    }
  },
  "bull_rush_strike" : {
    "_name" : "Bull Rush Strike",
    "_description" : "Whenever you score a critical hit with a melee attack, you can push your opponent back, in addition to the normal damage dealt by the attack. If your confirmation roll exceeds your opponent’s CMD, you may push your opponent back as if from the bull rush combat maneuver. You do not need to move with the target if successful. This does not provoke an attack of opportunity.",
    "_icon" : "",
    "+feats.bull_rush_strike" : {
      "_name" : "Bull Rush Strike",
      "_description" : "Whenever you score a critical hit with a melee attack, you can push your opponent back, in addition to the normal damage dealt by the attack. If your confirmation roll exceeds your opponent’s CMD, you may push your opponent back as if from the bull rush combat maneuver. You do not need to move with the target if successful. This does not provoke an attack of opportunity. You can only apply the effects of one of the following feats to a given critical hit: Bull Rush Strike, Disarming Strike, Repositioning Strike, Sundering Strike, or Tripping Strike. You may choose to use this feat after you make your confirmation roll.",
      "_icon" : "",
      "_requires" : ["Strength 13","Improved Bull Rush","Power Attack","base attack bonus +9"]
    }
  },
  "bullseye_shot" : {
    "_name" : "Bullseye Shot",
    "_description" : "You can spend a move action to steady your shot. When you do, you gain a +4 bonus on your next ranged attack roll before the end of your turn.",
    "_icon" : "",
    "+feats.bullseye_shot" : {
      "_name" : "Bullseye Shot",
      "_description" : "You can spend a move action to steady your shot. When you do, you gain a +4 bonus on your next ranged attack roll before the end of your turn.",
      "_icon" : "",
      "_requires" : ["Point-Blank Shot","Precise Shot","base attack bonus +5"]
    }
  },
  "bullying_blow" : {
    "_name" : "Bullying Blow",
    "_description" : "As a standard action, you may make a melee attack with a –2 penalty on the attack roll. If the attack damages your opponent, you may make an Intimidate check to demoralize that opponent as a free action.",
    "_icon" : "",
    "+feats.bullying_blow" : {
      "_name" : "Bullying Blow",
      "_description" : "As a standard action, you may make a melee attack with a –2 penalty on the attack roll. If the attack damages your opponent, you may make an Intimidate check to demoralize that opponent as a free action.",
      "_icon" : "",
      "_requires" : ["Intimidate rank 1","Orc"]
    }
  },
  "burn_it_down" : {
    "_name" : "Burn it Down!",
    "_description" : "Whenever you make an attack with a torch, a flask of lamp oil fitted with a fuse, alchemist’s fire, or a flaming weapon, you gain a morale bonus on your damage roll equal to the number of goblin allies within 30 feet who also have this feat (maximum +4). This bonus damage is fire damage.",
    "_icon" : "",
    "+feats.burn_it_down" : {
      "_name" : "Burn it Down!",
      "_description" : "Whenever you make an attack with a torch, a flask of lamp oil fitted with a fuse, alchemist’s fire, or a flaming weapon, you gain a morale bonus on your damage roll equal to the number of goblin allies within 30 feet who also have this feat (maximum +4). This bonus damage is fire damage.",
      "_icon" : "",
      "_requires" : ["Base attack bonus +1","Goblin"]
    }
  },
  "but_a_scratch" : {
    "_name" : "But a Scratch",
    "_description" : "When an opponent confirms a critical hit against you with a melee weapon, you can attempt a special Bluff check against that opponent as an immediate action. The DC of this check is the same as the DC to demoralize the opponent with the Intimidate skill. If you are successful, the attacking opponent is shaken for 1 round as if you had successfully demoralized it with Intimidate. Exceeding the DC by 5 or more does not add to the shaken condition’s duration. If you fail the special Bluff check granted by this feat, you can attempt it against opponents who saw you attempt the earlier check and fail, but you take a –2 cumulative penalty on that Bluff check and any subsequent Bluff checks attempted in conjunction with this feat against those opponents for 24 hours.",
    "_icon" : "",
    "+feats.but_a_scratch" : {
      "_name" : "But a Scratch",
      "_description" : "When an opponent confirms a critical hit against you with a melee weapon, you can attempt a special Bluff check against that opponent as an immediate action. The DC of this check is the same as the DC to demoralize the opponent with the Intimidate skill. If you are successful, the attacking opponent is shaken for 1 round as if you had successfully demoralized it with Intimidate. Exceeding the DC by 5 or more does not add to the shaken condition’s duration. If you fail the special Bluff check granted by this feat, you can attempt it against opponents who saw you attempt the earlier check and fail, but you take a –2 cumulative penalty on that Bluff check and any subsequent Bluff checks attempted in conjunction with this feat against those opponents for 24 hours.",
      "_icon" : "",
      "_requires" : ["Charisma 13","Bluff rank 4"]
    }
  },
  "call_out" : {
    "_name" : "Call Out",
    "_description" : "As a standard action, you can make an Intimidate check against a hostile target within 30 feet that can clearly see and hear you. The DC of this check is equal to 10 + your opponent’s Hit Dice + its Wisdom modifier. If the target is trained in Sense Motive, the DC is instead equal to 10 + your opponent’s Sense Motive bonus, if higher. If you succeed at this check, the target enters a duel with you. The target cannot withdraw from the duel for 1 round + 1 round for every 5 by which the check beat the DC.",
    "_icon" : "",
    "+feats.call_out" : {
      "_name" : "Call Out",
      "_description" : "As a standard action, you can make an Intimidate check against a hostile target within 30 feet that can clearly see and hear you. The DC of this check is equal to 10 + your opponent’s Hit Dice + its Wisdom modifier. If the target is trained in Sense Motive, the DC is instead equal to 10 + your opponent’s Sense Motive bonus, if higher. If you succeed at this check, the target enters a duel with you. The target cannot withdraw from the duel for 1 round + 1 round for every 5 by which the check beat the DC.",
      "_icon" : "",
      "_requires" : [""]
    }
  },
  "canny_tumble" : {
    "_name" : "Canny Tumble",
    "_description" : "When you use Acrobatics to move through an opponent’s threatened area or space without provoking an attack of opportunity from that opponent, you gain a +2 circumstance bonus on your next melee attack roll against that opponent and that opponent is denied its Dexterity bonus to AC, as long as you make that attack before the start of your next turn.",
    "_icon" : "",
    "+feats.canny_tumble" : {
      "_name" : "Canny Tumble",
      "_description" : "When you use Acrobatics to move through an opponent’s threatened area or space without provoking an attack of opportunity from that opponent, you gain a +2 circumstance bonus on your next melee attack roll against that opponent and that opponent is denied its Dexterity bonus to AC, as long as you make that attack before the start of your next turn.",
      "_icon" : "",
      "_requires" : ["Dodge","Mobility","Acrobatics rank 5"]
    }
  },
  "casters_champion" : {
    "_name" : "Caster's Champion",
    "_description" : "Three times per day as a swift action, when you are within 30 feet of an ally who is an arcane spellcaster, you can channel a portion of her arcane power into your weapons. For 1 round, you gain a +1 bonus on all weapon damage rolls, and your weapons are treated as magic for the purpose of overcoming damage reduction. When your base attack bonus reaches +4 and every 4 points thereafter, this bonus increases by 1, to a maximum of +5 at 16th level.",
    "_icon" : "",
    "+feats.casters_champion" : {
      "_name" : "Caster's Champion",
      "_description" : "Three times per day as a swift action, when you are within 30 feet of an ally who is an arcane spellcaster, you can channel a portion of her arcane power into your weapons. For 1 round, you gain a +1 bonus on all weapon damage rolls, and your weapons are treated as magic for the purpose of overcoming damage reduction. When your base attack bonus reaches +4 and every 4 points thereafter, this bonus increases by 1, to a maximum of +5 at 16th level. This feat counts as Arcane Strike for the purposes of prerequisites.",
      "_icon" : "",
      "_requires" : [""]
    }
  },
  "cat_and_mouse" : {
    "_name" : "Cat and Mouse",
    "_description" : "When you use the opportune parry and riposte deed to successfully parry an opponent’s attack, if you have your immediate action available and choose not to attempt a riposte, you gain a +1 dodge bonus to your AC and a +2 bonus on all combat maneuver checks against the opponent you successfully parried for 1 round.",
    "_icon" : "",
    "+feats.cat_and_mouse" : {
      "_name" : "Cat and Mouse",
      "_description" : "When you use the opportune parry and riposte deed to successfully parry an opponent’s attack, if you have your immediate action available and choose not to attempt a riposte, you gain a +1 dodge bonus to your AC and a +2 bonus on all combat maneuver checks against the opponent you successfully parried for 1 round.",
      "_icon" : "",
      "_requires" : ["Bluff rank 5","Sense Motive rank 5","opportune parry and riposte deed"]
    }
  },
  "catch_off_guard" : {
    "_name" : "Catch Off Guard",
    "_description" : "You do not suffer any penalties for using an improvised melee weapon. Unarmed opponents are flat-footed against any attacks you make with an improvised melee weapon.",
    "_icon" : "",
    "+feats.catch_off_guard" : {
      "_name" : "Catch Off Guard",
      "_description" : "You do not suffer any penalties for using an improvised melee weapon. Unarmed opponents are flat-footed against any attacks you make with an improvised melee weapon.",
      "_icon" : "",
      "_requires" : [""]
    }
  },
  "cautious_fighter" : {
    "_name" : "Cautious Fighter",
    "_description" : "When fighting defensively or using total defense, your dodge bonus to AC increases by 2.",
    "_icon" : "",
    "+feats.cautious_fighter" : {
      "_name" : "Cautious Fighter",
      "_description" : "When fighting defensively or using total defense, your dodge bonus to AC increases by 2.",
      "_icon" : "",
      "_requires" : ["Halfling"]
    }
  },
  "chairbreaker" : {
    "_name" : "Chairbreaker",
    "_description" : "When you attack a target with an improvised weapon, you can give that weapon the broken condition to deal 1d4 points of additional damage on that attack. Additionally, you gain a +4 bonus on the roll to confirm a critical hit with this attack. If you confirm the crit, the extra damage granted by this feat is also multiplied and the improvised weapon is destroyed.",
    "_icon" : "",
    "+feats.chairbreaker" : {
      "_name" : "Chairbreaker",
      "_description" : "When you attack a target with an improvised weapon, you can give that weapon the broken condition to deal 1d4 points of additional damage on that attack. Additionally, you gain a +4 bonus on the roll to confirm a critical hit with this attack. If you confirm the crit, the extra damage granted by this feat is also multiplied and the improvised weapon is destroyed.",
      "_icon" : "",
      "_requires" : ["Catch Off-Guard","base attack bonus +1"]
    }
  },
  "channel_smite" : {
    "_name" : "Channel Smite",
    "_description" : "When you attack a target with an improvised weapon, you can give that weapon the broken condition to deal 1d4 points of additional damage on that attack. Additionally, you gain a +4 bonus on the roll to confirm a critical hit with this attack. If you confirm the crit, the extra damage granted by this feat is also multiplied and the improvised weapon is destroyed.",
    "_icon" : "",
    "+feats.channel_smite" : {
      "_name" : "Channel Smite",
      "_description" : "When you attack a target with an improvised weapon, you can give that weapon the broken condition to deal 1d4 points of additional damage on that attack. Additionally, you gain a +4 bonus on the roll to confirm a critical hit with this attack. If you confirm the crit, the extra damage granted by this feat is also multiplied and the improvised weapon is destroyed.",
      "_icon" : "",
      "_requires" : ["Channel energy class feature"]
    }
  },
  "channeling_force" : {
    "_name" : "Channeling Force",
    "_description" : "A swift action, you can expend one use of channel energy to grant your weapon attacks a bonus on damage rolls equal to the number of dice of your channel energy. This extra damage is force damage. This lasts for your next three weapon attacks or until the end of combat, whichever comes first.",
    "_icon" : "",
    "+feats.channeling_force" : {
      "_name" : "Channeling Force",
      "_description" : "A swift action, you can expend one use of channel energy to grant your weapon attacks a bonus on damage rolls equal to the number of dice of your channel energy. This extra damage is force damage. This lasts for your next three weapon attacks or until the end of combat, whichever comes first.",
      "_icon" : "",
      "_requires" : ["Ability to cast at least one force spell","channel energy class feature"]
    }
  },
  "charge_of_the_righteous" : {
    "_name" : "Charge of the Righteous",
    "_description" : "You do not take a penalty to AC while charging undead creatures and evil outsiders.",
    "_icon" : "",
    "+feats.charge_of_the_righteous" : {
      "_name" : "Charge of the Righteous",
      "_description" : "You do not take a penalty to AC while charging undead creatures and evil outsiders.",
      "_icon" : "",
      "_requires" : ["Base attack bonus +1","any Good alignment"]
    }
  },
  "charge_through" : {
    "_name" : "Charge Through",
    "_description" : "When making a charge, you can attempt to overrun one creature in the path of the charge as a free action. If you successfully overrun that creature, you can complete the charge. If the overrun is unsuccessful, the charge ends in the space directly in front of that creature.",
    "_icon" : "",
    "+feats.charge_through" : {
      "_name" : "Charge Through",
      "_description" : "When making a charge, you can attempt to overrun one creature in the path of the charge as a free action. If you successfully overrun that creature, you can complete the charge. If the overrun is unsuccessful, the charge ends in the space directly in front of that creature.",
      "_icon" : "",
      "_requires" : ["Strength 13","Improved Overrun","Power Attack","base attack bonus +1"]
    }
  },
  "charging_hurler" : {
    "_name" : "Charging Hurler",
    "_description" : "You can use the charge rules to make a thrown weapon attack. All the parameters of a charge apply, except that you must only move closer to your opponent, and you must end your movement within 30 feet of that opponent. If you do, you can make a single thrown weapon attack against that opponent, gaining the +2 bonus on the attack roll and taking a –2 penalty to your AC until the start of your next turn.",
    "_icon" : "",
    "+feats.charging_hurler" : {
      "_name" : "Charging Hurler",
      "_description" : "You can use the charge rules to make a thrown weapon attack. All the parameters of a charge apply, except that you must only move closer to your opponent, and you must end your movement within 30 feet of that opponent. If you do, you can make a single thrown weapon attack against that opponent, gaining the +2 bonus on the attack roll and taking a –2 penalty to your AC until the start of your next turn.",
      "_icon" : "",
      "_requires" : ["Point-Blank Shot"]
    }
  },
  "improved_charging_hurler" : {
    "_name" : "Improved Charging Hurler",
    "_description" : "When you use Charging Hurler, your target can be at any range up to your weapon’s maximum range. If your target is within 30 feet, you gain a +2 bonus on damage rolls.",
    "_icon" : "",
    "+feats.improved_charging_hurler" : {
      "_name" : "Improved Charging Hurler",
      "_description" : "When you use Charging Hurler, your target can be at any range up to your weapon’s maximum range. If your target is within 30 feet, you gain a +2 bonus on damage rolls.",
      "_icon" : "",
      "_requires" : ["Charging Hurler","Point-Blank Shot"]
    }
  },
  "choir_of_blades" : {
    "_name" : "Choir of Blades",
    "_description" : "While you’re adjacent to an ally of a race different that your own who also has this feat, you gain the following benefits. If your ally has a racial bonus on attack rolls against a particular creature type or subtype, you also gain that bonus. If your ally has ancestral arms, weapon familiarity, or any other racial trait that grants weapon proficiencies, you also gain those proficiencies.",
    "_icon" : "",
    "+feats.choir_of_blades" : {
      "_name" : "Choir of Blades",
      "_description" : "While you’re adjacent to an ally of a race different that your own who also has this feat, you gain the following benefits. If your ally has a racial bonus on attack rolls against a particular creature type or subtype, you also gain that bonus. If your ally has ancestral arms, weapon familiarity, or any other racial trait that grants weapon proficiencies, you also gain those proficiencies.",
      "_icon" : "",
      "_requires" : [""]
    }
  },
  "chokehold" : {
    "_name" : "Chokehold",
    "_description" : "While you have an opponent up to one size category larger than you grappled, you can attempt a grapple combat maneuver with a –5 penalty on the check. If you succeed, you have pinned your opponent and hold the opponent in a chokehold. When you maintain the grapple, you also maintain the chokehold. A creature in a chokehold cannot breathe or speak, and thus cannot cast spells that have a verbal component. An opponent you have in a chokehold has to hold his breath or begin suffocating. Any creature that does not breathe, is immune to bleed damage, or is immune to critical hits is immune to the effects of your chokehold. When the grapple is ended, so is the chokehold.",
    "_icon" : "",
    "+feats.chokehold" : {
      "_name" : "Chokehold",
      "_description" : "While you have an opponent up to one size category larger than you grappled, you can attempt a grapple combat maneuver with a –5 penalty on the check. If you succeed, you have pinned your opponent and hold the opponent in a chokehold. When you maintain the grapple, you also maintain the chokehold. A creature in a chokehold cannot breathe or speak, and thus cannot cast spells that have a verbal component. An opponent you have in a chokehold has to hold his breath or begin suffocating. Any creature that does not breathe, is immune to bleed damage, or is immune to critical hits is immune to the effects of your chokehold. When the grapple is ended, so is the chokehold.",
      "_icon" : "",
      "_requires" : ["Improved Grapple","Improved Unarmed Strike","base attack bonus +6 or Monk level 5"]
    }
  },
  "circling_mongoose" : {
    "_name" : "Circling Mongoose",
    "_description" : "When you are adjacent to a foe, as a full-round action, you can take a full-attack action to make melee attacks against the foe, moving 5 feet before each attack. You must move 5 feet before each melee attack you make, and can’t exceed your maximum speed, exceed your maximum number of attacks in a round, or attack any other target until the beginning of your next turn. You must remain adjacent to the foe, and your movement provokes attacks of opportunity as normal unless you succeed at the appropriate Acrobatics checks. If your first attack against the foe hits, you are considered to be flanking the foe on your second attack. Subsequent attacks made as part of the full-attack action continue to be treated as if you were flanking the foe until one of your attacks misses, at which point your attacks are treated normally.",
    "_icon" : "",
    "+feats.circling_mongoose" : {
      "_name" : "Circling Mongoose",
      "_description" : "When you are adjacent to a foe, as a full-round action, you can take a full-attack action to make melee attacks against the foe, moving 5 feet before each attack. You must move 5 feet before each melee attack you make, and can’t exceed your maximum speed, exceed your maximum number of attacks in a round, or attack any other target until the beginning of your next turn. You must remain adjacent to the foe, and your movement provokes attacks of opportunity as normal unless you succeed at the appropriate Acrobatics checks. If your first attack against the foe hits, you are considered to be flanking the foe on your second attack. Subsequent attacks made as part of the full-attack action continue to be treated as if you were flanking the foe until one of your attacks misses, at which point your attacks are treated normally.",
      "_icon" : "",
      "_requires" : ["Dexterity 13","Dodge","Mobility","Spring Attack","base attack bonus +6"]
    }
  },
  "circuitous_shot" : {
    "_name" : "Circuitous Shot",
    "_description" : "You can choose to take a –2 penalty on a ranged weapon attack to ricochet it off a stone or metal surface and resolve the attack as if it originated from the chosen ricochet point for the purpose of determining cover (but not for determining concealment). Add the entire distance the weapon or ammunition traveled to determine range penalties for the attack. Bouncing a shot this way can potentially enable you to make ranged attacks against foes who have total cover against you by going around obstacles, but such a foe still has total concealment against your attack.",
    "_icon" : "",
    "+feats.circuitous_shot" : {
      "_name" : "Circuitous Shot",
      "_description" : "You can choose to take a –2 penalty on a ranged weapon attack to ricochet it off a stone or metal surface and resolve the attack as if it originated from the chosen ricochet point for the purpose of determining cover (but not for determining concealment). Add the entire distance the weapon or ammunition traveled to determine range penalties for the attack. Bouncing a shot this way can potentially enable you to make ranged attacks against foes who have total cover against you by going around obstacles, but such a foe still has total concealment against your attack.",
      "_icon" : "",
      "_requires" : ["Dexterity 19","Blind-Fight","Improved Precise Shot","Point-Blank Shot","Precise Shot","base attack bonus +11"]
    }
  },
  "clambering_escape" : {
    "_name" : "Clambering Escape",
    "_description" : "When you successfully use your evasion class feature to avoid taking damage from an effect that allows a Reflex saving throw, you can attempt a special reposition combat maneuver check against any one foe within reach as an immediate action. If successful, you switch positions with the target of your combat maneuver. If your foe was not initially within range of the effect that you evaded, it must save against the effect as if it had been within the area of effect.",
    "_icon" : "",
    "+feats.clambering_escape" : {
      "_name" : "Clambering Escape",
      "_description" : "When you successfully use your evasion class feature to avoid taking damage from an effect that allows a Reflex saving throw, you can attempt a special reposition combat maneuver check against any one foe within reach as an immediate action. If successful, you switch positions with the target of your combat maneuver. If your foe was not initially within range of the effect that you evaded, it must save against the effect as if it had been within the area of effect.",
      "_icon" : "",
      "_requires" : ["Intelligence 13","Combat Expertise","Improved Reposition","evasion class feature"]
    }
  },
  "claw_pounce" : {
    "_name" : "Claw Pounce",
    "_description" : "When you make a charge, you can make a full attack with your claws.",
    "_icon" : "",
    "+feats.claw_pounce" : {
      "_name" : "Claw Pounce",
      "_description" : "When you make a charge, you can make a full attack with your claws.",
      "_icon" : "",
      "_requires" : ["Strength 13","Dexterity 15","Nimble Striker","base attack bonus +10","Catfolk","cat's claws racial trait or Aspect of the Beast"]
    }
  },
  "cleave" : {
    "_name" : "Cleave",
    "_description" : "As a standard action, you can make a single attack at your full base attack bonus against a foe within reach. If you hit, you deal damage normally and can make an additional attack (using your full base attack bonus) against a foe that is adjacent to the first and also within reach. You can only make one additional attack per round with this feat. When you use this feat, you take a –2 penalty to your Armor Class until your next turn.",
    "_icon" : "",
    "+feats.cleave" : {
      "_name" : "Cleave",
      "_description" : "As a standard action, you can make a single attack at your full base attack bonus against a foe within reach. If you hit, you deal damage normally and can make an additional attack (using your full base attack bonus) against a foe that is adjacent to the first and also within reach. You can only make one additional attack per round with this feat. When you use this feat, you take a –2 penalty to your Armor Class until your next turn.",
      "_icon" : "",
      "_requires" : ["Strength 13","Power Attack","base attack bonus +1"]
    }
  },
  "great_cleave" : {
    "_name" : "Great Cleave",
    "_description" : "As a standard action, you can make a single attack at your full base attack bonus against a foe within reach. If you hit, you deal damage normally and can make an additional attack (using your full base attack bonus) against a foe that is adjacent to the previous foe and also within reach. If you hit, you can continue to make attacks against foes adjacent to the previous foe, so long as they are within your reach. You cannot attack an individual foe more than once during this attack action. When you use this feat, you take a –2 penalty to your Armor Class until your next turn.",
    "_icon" : "",
    "+feats.great_cleave" : {
      "_name" : "Great Cleave",
      "_description" : "As a standard action, you can make a single attack at your full base attack bonus against a foe within reach. If you hit, you deal damage normally and can make an additional attack (using your full base attack bonus) against a foe that is adjacent to the previous foe and also within reach. If you hit, you can continue to make attacks against foes adjacent to the previous foe, so long as they are within your reach. You cannot attack an individual foe more than once during this attack action. When you use this feat, you take a –2 penalty to your Armor Class until your next turn.",
      "_icon" : "",
      "_requires" : ["Strength 13","Cleave","Power Attack","base attack bonus +4"]
    }
  },
  "cleaving_finish" : {
    "_name" : "Cleaving Finish",
    "_description" : "If you make a melee attack, and your target drops to 0 or fewer hit points as a result of your attack, you can make another melee attack using your highest base attack bonus against another opponent within reach. You can make only one extra attack per round with this feat.",
    "_icon" : "",
    "+feats.cleaving_finish" : {
      "_name" : "Cleaving Finish",
      "_description" : "If you make a melee attack, and your target drops to 0 or fewer hit points as a result of your attack, you can make another melee attack using your highest base attack bonus against another opponent within reach. You can make only one extra attack per round with this feat.",
      "_icon" : "",
      "_requires" : ["Strength 13","Cleave","Power Attack"]
    }
  },
  "improved_cleaving_finish" : {
    "_name" : "Improved Cleaving Finish",
    "_description" : "You can use Cleaving Finish any number of times per round.",
    "_icon" : "",
    "+feats.improved_cleaving_finish" : {
      "_name" : "Improved Cleaving Finish",
      "_description" : "You can use Cleaving Finish any number of times per round.",
      "_icon" : "",
      "_requires" : ["Strength 13","Cleave","Cleaving Finish","Great Cleave","Power Attack","base attack bonus +6"]
    }
  },
  "cleave_through" : {
    "_name" : "Cleave Through",
    "_description" : "When using Cleave or Great Cleave, if your initial attack hits, you may take a single 5-foot step as a free action before making your additional attacks. If doing so places a creature within your threatened area, that creature becomes a legal target for your additional Cleave attack(s) as long as it meets all the other prerequisites.",
    "_icon" : "",
    "+feats.cleave_through" : {
      "_name" : "Cleave Through",
      "_description" : "When using Cleave or Great Cleave, if your initial attack hits, you may take a single 5-foot step as a free action before making your additional attacks. If doing so places a creature within your threatened area, that creature becomes a legal target for your additional Cleave attack(s) as long as it meets all the other prerequisites.",
      "_icon" : "",
      "_requires" : ["Strength 13","Cleave","Power Attack","base attack bonus +11","Dwarf"]
    }
  },
  "clinging_climber" : {
    "_name" : "Clinging Climber",
    "_description" : "As a move action while climbing, you can cling to your climbing surface with your legs by succeeding at a Climb check with the same DC as that of climbing the surface as a move action. If successful, you can make attacks with a two-handed ranged weapon and reload ranged weapons until you resume climbing. The GM can rule that this feat doesn’t work on certain climbing surfaces.",
    "_icon" : "",
    "+feats.clinging_climber" : {
      "_name" : "Clinging Climber",
      "_description" : "As a move action while climbing, you can cling to your climbing surface with your legs by succeeding at a Climb check with the same DC as that of climbing the surface as a move action. If successful, you can make attacks with a two-handed ranged weapon and reload ranged weapons until you resume climbing. The GM can rule that this feat doesn’t work on certain climbing surfaces.",
      "_icon" : "",
      "_requires" : ["Strength 13","Climb rank 3"]
    }
  },
  "cloak_and_dagger_style" : {
    "_name" : "Cloak and Dagger Style",
    "_description" : "Choose one light melee weapon. While using this style, whenever you use the attack action to attack an opponent during a surprise round with your chosen weapon, you can attempt a dirty trick combat maneuver check against that opponent as a free action. Additionally, if an adjacent target attempts to remove a condition that you inflicted upon it with the dirty trick combat maneuver, it provokes an attack of opportunity from you.",
    "_icon" : "",
    "+feats.cloak_and_dagger_style" : {
      "_name" : "Cloak and Dagger Style",
      "_description" : "Choose one light melee weapon. While using this style, whenever you use the attack action to attack an opponent during a surprise round with your chosen weapon, you can attempt a dirty trick combat maneuver check against that opponent as a free action. Additionally, if an adjacent target attempts to remove a condition that you inflicted upon it with the dirty trick combat maneuver, it provokes an attack of opportunity from you. In addition to the chosen weapon, a character with the weapon training class feature can use Cloak and Dagger Style with any light melee weapon belonging to any fighter weapon group he has selected with weapon training. A character with the swashbuckler weapon training class feature can use Cloak and Dagger Style with light and one-handed piercing weapons.",
      "_icon" : "",
      "_requires" : ["Intelligence 13","Combat Expertise","Improved Dirty Trick","Vital Strike","Weapon Focus with the chosen weapon","base attack bonus +6"]
    }
  },
  "cloak_and_dagger_subterfuge" : {
    "_name" : "Cloak and Dagger Subterfuge",
    "_description" : "While you are using Cloak and Dagger Style and wielding your chosen weapon, whenever you make an attack of opportunity against a target, you can attempt a free dirty trick combat maneuver check against the target as a free action as well. Additionally, whenever you successfully perform a dirty trick maneuver against a target, you can immediately attempt a steal combat maneuver check against the target as a free action. If you succeed, the target is unaware you have stolen an item.",
    "_icon" : "",
    "+feats.cloak_and_dagger_subterfuge" : {
      "_name" : "Cloak and Dagger Subterfuge",
      "_description" : "While you are using Cloak and Dagger Style and wielding your chosen weapon, whenever you make an attack of opportunity against a target, you can attempt a free dirty trick combat maneuver check against the target as a free action as well. Additionally, whenever you successfully perform a dirty trick maneuver against a target, you can immediately attempt a steal combat maneuver check against the target as a free action. If you succeed, the target is unaware you have stolen an item.",
      "_icon" : "",
      "_requires" : ["Intelligence 13","Cloak and Dagger Style","Combat Expertise","Improved Dirty Trick","Weapon Focus with the chosen weapon","base attack bonus +11"]
    }
  },
  "cloak_and_dagger_tactics" : {
    "_name" : "Cloak and Dagger Tactics",
    "_description" : "While you are using Cloak and Dagger Style and wielding your chosen weapon, whenever you hit an opponent that is denied its Dexterity bonus to AC or that you are flanking, or make an attack using Vital Strike (or its improved or greater versions), you can attempt a dirty trick combat maneuver check against that opponent as a free action. If you succeed, the target must succeed at a Fortitude save (DC = 10 + 1/2 your base attack bonus + your Intelligence modifier) or take an additional penalty from the dirty trick selected from the following list: anchored in place and unable to move from that square, confused, exhausted, or staggered. This additional penalty lasts only 1 round, regardless of how long the dirty trick’s normal penalty lasts, and can be removed by the target with a standard action. You can only attempt one free dirty trick combat maneuver check per round using this feat.",
    "_icon" : "",
    "+feats.cloak_and_dagger_tactics" : {
      "_name" : "Cloak and Dagger Tactics",
      "_description" : "While you are using Cloak and Dagger Style and wielding your chosen weapon, whenever you hit an opponent that is denied its Dexterity bonus to AC or that you are flanking, or make an attack using Vital Strike (or its improved or greater versions), you can attempt a dirty trick combat maneuver check against that opponent as a free action. If you succeed, the target must succeed at a Fortitude save (DC = 10 + 1/2 your base attack bonus + your Intelligence modifier) or take an additional penalty from the dirty trick selected from the following list: anchored in place and unable to move from that square, confused, exhausted, or staggered. This additional penalty lasts only 1 round, regardless of how long the dirty trick’s normal penalty lasts, and can be removed by the target with a standard action. You can only attempt one free dirty trick combat maneuver check per round using this feat.",
      "_icon" : "",
      "_requires" : ["Intelligence 13","Cloak and Dagger Style","Cloak and Dagger Subterfuge","Combat Expertise","Improved Dirty Trick","Vital Strike","Weapon Focus with the chosen weapon","base attack bonus +16"]
    }
  },
  "close_quarters_thrower" : {
    "_name" : "Close Quarters Thrower",
    "_description" : "Choose a type of thrown weapon. You do not provoke attacks of opportunity for making ranged attacks using the selected weapon. If you are an alchemist, and you select this feat and choose alchemist bombs, you do not provoke attacks of opportunity for the process of drawing components of, creating, and throwing a bomb.",
    "_icon" : "",
    "+feats.close_quarters_thrower" : {
      "_name" : "Close Quarters Thrower",
      "_description" : "Choose a type of thrown weapon. You do not provoke attacks of opportunity for making ranged attacks using the selected weapon. If you are an alchemist, and you select this feat and choose alchemist bombs, you do not provoke attacks of opportunity for the process of drawing components of, creating, and throwing a bomb.",
      "_icon" : "",
      "_requires" : ["Dexterity 13","Dodge","Weapon Focus with selected thrown weapon"]
    }
  },
  "cloven_helm" : {
    "_name" : "Cloven Helm",
    "_description" : "When wearing a helmet, you add +1 to your AC against critical hit confirmation rolls; this benefit stacks with Dented Helm. When you use Dented Helm to deflect a critical hit, you may apply all damage from the critical hit to your helmet before applying any damage to yourself. If you take no damage, any additional effects, such as critical feats or poison, are negated.",
    "_icon" : "",
    "+feats.cloven_helm" : {
      "_name" : "Cloven Helm",
      "_description" : "When wearing a helmet, you add +1 to your AC against critical hit confirmation rolls; this benefit stacks with Dented Helm. When you use Dented Helm to deflect a critical hit, you may apply all damage from the critical hit to your helmet before applying any damage to yourself. If you take no damage, any additional effects, such as critical feats or poison, are negated.",
      "_icon" : "",
      "_requires" : ["Dented Helm","Hard-Headed","base attack bonus +11","Dwarf"]
    }
  },
  "clustered_shots" : {
    "_name" : "Clustered Shots",
    "_description" : "When you use a full-attack action to make multiple ranged weapon attacks against the same opponent, total the damage from all hits before applying that opponent’s damage reduction.",
    "_icon" : "",
    "+feats.clustered_shots" : {
      "_name" : "Clustered Shots",
      "_description" : "When you use a full-attack action to make multiple ranged weapon attacks against the same opponent, total the damage from all hits before applying that opponent’s damage reduction. If the massive damage optional rule is being used, that rule applies if the total damage you deal with this feat is equal to or exceeds half the opponent’s full normal hit points (minimum 50 points of damage).",
      "_icon" : "",
      "_requires" : ["Point-Blank Shot","Precise Shot","base attack bonus +6"]
    }
  },
  "cockatrice_strike" : {
    "_name" : "Cockatrice Strike",
    "_description" : "As a full-round action, you can make a single unarmed strike against a dazed, flat-footed, paralyzed, staggered, stunned, or unconscious foe. If that attack is a critical hit, the target is petrified unless it succeeds on a Fortitude saving throw with a DC of 10 + 1/2 your character level + your Wisdom modifier. This is a supernatural polymorph effect.",
    "_icon" : "",
    "+feats.cockatrice_strike" : {
      "_name" : "Cockatrice Strike",
      "_description" : "As a full-round action, you can make a single unarmed strike against a dazed, flat-footed, paralyzed, staggered, stunned, or unconscious foe. If that attack is a critical hit, the target is petrified unless it succeeds on a Fortitude saving throw with a DC of 10 + 1/2 your character level + your Wisdom modifier. This is a supernatural polymorph effect.",
      "_icon" : "",
      "_requires" : ["Improved Unarmed Strike","Gorgon's Fist","Medusa's Wrath","base attack bonus +14"]
    }
  },
  "combat_expertise" : {
    "_name" : "Combat Expertise",
    "_description" : "You can choose to take a –1 penalty on melee attack rolls and combat maneuver checks to gain a +1 dodge bonus to your Armor Class. When your base attack bonus reaches +4, and every +4 thereafter, the penalty increases by –1 and the dodge bonus increases by +1. You can only choose to use this feat when you declare that you are making an attack or a full-attack action with a melee weapon. The effects of this feat last until your next turn.",
    "_icon" : "",
    "+feats.combat_expertise" : {
      "_name" : "Combat Expertise",
      "_description" : "You can choose to take a –1 penalty on melee attack rolls and combat maneuver checks to gain a +1 dodge bonus to your Armor Class. When your base attack bonus reaches +4, and every +4 thereafter, the penalty increases by –1 and the dodge bonus increases by +1. You can only choose to use this feat when you declare that you are making an attack or a full-attack action with a melee weapon. The effects of this feat last until your next turn.",
      "_icon" : "",
      "_requires" : ["Intelligence 13"]
    }
  },
  "combat_medic" : {
    "_name" : "Combat Medic",
    "_description" : "Whenever you use Heal to provide first aid, treat caltrop wounds, or treat poison on an ally who also has this feat, you provoke no attacks of opportunity, and can take 10 on the check. Unlike with other teamwork feats, allies that are paralyzed, stunned, unconscious, or cannot otherwise act still count for the purposes of this feat.",
    "_icon" : "",
    "+feats.combat_medic" : {
      "_name" : "Combat Medic",
      "_description" : "Whenever you use Heal to provide first aid, treat caltrop wounds, or treat poison on an ally who also has this feat, you provoke no attacks of opportunity, and can take 10 on the check. Unlike with other teamwork feats, allies that are paralyzed, stunned, unconscious, or cannot otherwise act still count for the purposes of this feat.",
      "_icon" : "",
      "_requires" : ["Heal rank 5"]
    }
  },
  "combat_patrol" : {
    "_name" : "Combat Patrol",
    "_description" : "As a full-round action, you may set up a combat patrol, increasing your threatened area by 5 feet for every 5 points of your base attack bonus. Until the beginning of your next turn, you may make attacks of opportunity against any opponent in this threatened area that provokes attacks of opportunity. You may move as part of these attacks, provided your total movement before your next turn does not exceed your speed. Any movement you make provokes attacks of opportunity as normal.",
    "_icon" : "",
    "+feats.combat_patrol" : {
      "_name" : "Combat Patrol",
      "_description" : "As a full-round action, you may set up a combat patrol, increasing your threatened area by 5 feet for every 5 points of your base attack bonus. Until the beginning of your next turn, you may make attacks of opportunity against any opponent in this threatened area that provokes attacks of opportunity. You may move as part of these attacks, provided your total movement before your next turn does not exceed your speed. Any movement you make provokes attacks of opportunity as normal.",
      "_icon" : "",
      "_requires" : ["Combat reflexes","Mobility","base attack bonus +5"]
    }
  },
  "combat_reflexes" : {
    "_name" : "Combat Reflexes",
    "_description" : "You may make a number of additional attacks of opportunity per round equal to your Dexterity bonus. With this feat, you may also make attacks of opportunity while flat-footed.",
    "_icon" : "",
    "+feats.combat_reflexes" : {
      "_name" : "Combat Reflexes",
      "_description" : "You may make a number of additional attacks of opportunity per round equal to your Dexterity bonus. With this feat, you may also make attacks of opportunity while flat-footed. The Combat Reflexes feat does not allow a rogue to use her opportunist ability more than once per round.",
      "_icon" : "",
      "_requires" : [""]
    },
    "+info.play_shortcuts.combat_defence[]" : "feats.combat_reflexes"
  },
  "combat_style_master" : {
    "_name" : "Combat Style Master",
    "_description" : "You can switch your style as a free action. At the start of combat, pick one of your styles. You start the combat in that style, even in the surprise round.",
    "_icon" : "",
    "+feats.combat_style_master" : {
      "_name" : "Combat Style Master",
      "_description" : "You can switch your style as a free action. At the start of combat, pick one of your styles. You start the combat in that style, even in the surprise round.",
      "_icon" : "",
      "_requires" : ["Improved Unarmed Strike","two or more style feats","base attack bonus +6 or Monk level 5"]
    }
  },
  "compounded_pain" : {
    "_name" : "Compounded Pain",
    "_description" : "You can apply the effects of two stare feats to your painful stares.",
    "_icon" : "",
    "+feats.compounded_pain" : {
      "_name" : "Compounded Pain",
      "_description" : "You can apply the effects of two stare feats to your painful stares.",
      "_icon" : "",
      "_requires" : ["Mesmerist level 13","Painful Stare class feature"]
    }
  },
  "concentrated_fire" : {
    "_name" : "Concentrated Fire",
    "_description" : "If you and a single ally who also has this feat both ready an action to each make a ranged attack against the same opponent and choose the same condition for the readied action, when you and the ally make those attacks, each of you can use the highest of the two attack rolls for your attack roll. Furthermore, if you and your ally both hit the target, you can total the damage for both attacks before applying the target’s damage reduction or energy resistance.",
    "_icon" : "",
    "+feats.concentrated_fire" : {
      "_name" : "Concentrated Fire",
      "_description" : "If you and a single ally who also has this feat both ready an action to each make a ranged attack against the same opponent and choose the same condition for the readied action, when you and the ally make those attacks, each of you can use the highest of the two attack rolls for your attack roll. Furthermore, if you and your ally both hit the target, you can total the damage for both attacks before applying the target’s damage reduction or energy resistance.",
      "_icon" : "",
      "_requires" : ["Point-Blank Shot","Elf","Weapon Familiarity racial trait"]
    }
  },
  "concentrated_splash" : {
    "_name" : "Concentrated Splash",
    "_description" : "When you deal a direct hit to a creature with a splash weapon that normally also deals splash damage, you can choose to forgo dealing splash damage. If you do, the damage dealt to the target of the direct hit increases by 50%. This damage is multiplied on a critical hit. This feat cannot be used with an alchemist’s bombs.",
    "_icon" : "",
    "+feats.concentrated_splash" : {
      "_name" : "Concentrated Splash",
      "_description" : "When you deal a direct hit to a creature with a splash weapon that normally also deals splash damage, you can choose to forgo dealing splash damage. If you do, the damage dealt to the target of the direct hit increases by 50%. This damage is multiplied on a critical hit. This feat cannot be used with an alchemist’s bombs.",
      "_icon" : "",
      "_requires" : ["Precise Shot or Throw Anything"]
    }
  },
  "consume_essence" : {
    "_name" : "Consume Essence",
    "_description" : "When you start your turn having swallowed at least one creature, each swallowed creature must succeed at a Fortitude save (DC = 10 + 1/2 your Hit Dice + your Charisma modifier) or gain a temporary negative level. Swallowed creatures that die from these negative levels are consumed as per disintegrate. This is a death effect.",
    "_icon" : "",
    "+feats.consume_essence" : {
      "_name" : "Consume Essence",
      "_description" : "When you start your turn having swallowed at least one creature, each swallowed creature must succeed at a Fortitude save (DC = 10 + 1/2 your Hit Dice + your Charisma modifier) or gain a temporary negative level. Swallowed creatures that die from these negative levels are consumed as per disintegrate. This is a death effect. If you are of the undead type, each time a swallowed creature gains a temporary negative level from this ability, you add 5 temporary hit points to the number of hit points that swallowed creatures must deal to escape, up to a maximum of 15 temporary hit points. These temporary hit points last for 10 minutes.",
      "_icon" : "",
      "_requires" : ["Base attack bonus +6","Evil alignment","Swallow Whole universal monster ability","must be of the Magical Beast, Outsider, or Undead type"]
    }
  },
  "coordinated_defense" : {
    "_name" : "Coordinated Defense",
    "_description" : "Whenever you are adjacent to an ally who also has this feat, you receive a +2 competence bonus to your Combat Maneuver Defense. This bonus increases to +4 if the creature attempting the maneuver is larger than both you and your ally.",
    "_icon" : "",
    "+feats.coordinated_defense" : {
      "_name" : "Coordinated Defense",
      "_description" : "Whenever you are adjacent to an ally who also has this feat, you receive a +2 competence bonus to your Combat Maneuver Defense. This bonus increases to +4 if the creature attempting the maneuver is larger than both you and your ally.",
      "_icon" : "",
      "_requires" : [""]
    }
  },
  "coordinated_distraction" : {
    "_name" : "Coordinated Distraction",
    "_description" : "When you and at least one ally with this feat threaten the same enemy, the enemy treats the DC to cast spells defensively as 2 higher for each threatening character with this feat. If you or your allies are incapable of taking an attack of opportunity against the target for any reason, the effects of this feat do not apply.",
    "_icon" : "",
    "+feats.coordinated_distraction" : {
      "_name" : "Coordinated Distraction",
      "_description" : "When you and at least one ally with this feat threaten the same enemy, the enemy treats the DC to cast spells defensively as 2 higher for each threatening character with this feat. If you or your allies are incapable of taking an attack of opportunity against the target for any reason, the effects of this feat do not apply.",
      "_icon" : "",
      "_requires" : [""]
    }
  },
  "coordinated_maneuvers" : {
    "_name" : "Coordinated Maneuvers",
    "_description" : "Whenever you are adjacent to an ally who also has this feat, you receive a +2 competence bonus on all combat maneuver checks. This bonus increases to +4 when attempting to break free from a grapple.",
    "_icon" : "",
    "+feats.coordinated_maneuvers" : {
      "_name" : "Coordinated Maneuvers",
      "_description" : "Whenever you are adjacent to an ally who also has this feat, you receive a +2 competence bonus on all combat maneuver checks. This bonus increases to +4 when attempting to break free from a grapple.",
      "_icon" : "",
      "_requires" : [""]
    }
  },
  "coordinated_shot" : {
    "_name" : "Coordinated Shot",
    "_description" : "If your ally with this feat is threatening an opponent and is not providing cover to that opponent against your ranged attacks, you gain a +1 bonus on ranged attacks against that opponent. If your ally with this feat is flanking that opponent with another ally (even if that other ally doesn’t have this feat), this bonus increases to +2.",
    "_icon" : "",
    "+feats.coordinated_shot" : {
      "_name" : "Coordinated Shot",
      "_description" : "If your ally with this feat is threatening an opponent and is not providing cover to that opponent against your ranged attacks, you gain a +1 bonus on ranged attacks against that opponent. If your ally with this feat is flanking that opponent with another ally (even if that other ally doesn’t have this feat), this bonus increases to +2.",
      "_icon" : "",
      "_requires" : ["Point-Blank Shot"]
    }
  },
  "cornugan_shield" : {
    "_name" : "Cornugan Shield",
    "_description" : "When wielding a spiked chain, you gain a +1 shield bonus to your AC. When you are fighting defensively or using the total defense action, this shield bonus increases to +2.",
    "_icon" : "",
    "+feats.cornugan_shield" : {
      "_name" : "Cornugan Shield",
      "_description" : "When wielding a spiked chain, you gain a +1 shield bonus to your AC. When you are fighting defensively or using the total defense action, this shield bonus increases to +2.",
      "_icon" : "",
      "_requires" : ["Dexterity 15","Weapon Focus: Spiked Chain"]
    }
  },
  "cornugan_smash" : {
    "_name" : "Cornugan Smash",
    "_description" : "When you damage an opponent with a Power Attack, you may make an immediate Intimidate check as a free action to attempt to demoralize your opponent.",
    "_icon" : "",
    "+feats.cornugan_smash" : {
      "_name" : "Cornugan Smash",
      "_description" : "When you damage an opponent with a Power Attack, you may make an immediate Intimidate check as a free action to attempt to demoralize your opponent.",
      "_icon" : "",
      "_requires" : ["Power Attack","Intimidate rank 6"]
    }
  },
  "cornugan_stun" : {
    "_name" : "Cornugan Stun",
    "_description" : "You may use Stunning Fist when making melee attacks with special monk weapons as well as when making unarmed attacks.",
    "_icon" : "",
    "+feats.cornugan_stun" : {
      "_name" : "Cornugan Stun",
      "_description" : "You may use Stunning Fist when making melee attacks with special monk weapons as well as when making unarmed attacks.",
      "_icon" : "",
      "_requires" : ["Stunning Fist"]
    }
  },
  "cornugan_trip" : {
    "_name" : "Cornugan Trip",
    "_description" : "You may throw your spiked chain (as if it were a thrown weapon with a range increment of 10 feet) and can make trip attacks when throwing it. Failing at this attack does not knock you prone.",
    "_icon" : "",
    "+feats.cornugan_trip" : {
      "_name" : "Cornugan Trip",
      "_description" : "You may throw your spiked chain (as if it were a thrown weapon with a range increment of 10 feet) and can make trip attacks when throwing it. Failing at this attack does not knock you prone.",
      "_icon" : "",
      "_requires" : ["Dexterity 15","Improved Trip","Weapon Focus: Spiked Chain"]
    }
  },
  "counterpunch" : {
    "_name" : "Counterpunch",
    "_description" : "Once per round, when you are fighting unarmed with both hands free and an opponent misses you with a melee attack, it provokes an attack of opportunity from you. You must use an unarmed strike for this attack of opportunity.",
    "_icon" : "",
    "+feats.counterpunch" : {
      "_name" : "Counterpunch",
      "_description" : "Once per round, when you are fighting unarmed with both hands free and an opponent misses you with a melee attack, it provokes an attack of opportunity from you. You must use an unarmed strike for this attack of opportunity.",
      "_icon" : "",
      "_requires" : ["Dexterity 18","Combat Reflexes","Improved Unarmed Strike","Weapon Focus: Unarmed Strike","base attack bonus +16 or Brawler level 12"]
    }
  },
  "counter_reflexes" : {
    "_name" : "Counter Reflexes",
    "_description" : "Opponents with the Mobility feat do not gain the dodge bonus granted by that feat when they provoke attacks of opportunity by moving out of or within your threatened area.",
    "_icon" : "",
    "+feats.counter_reflexes" : {
      "_name" : "Counter Reflexes",
      "_description" : "Opponents with the Mobility feat do not gain the dodge bonus granted by that feat when they provoke attacks of opportunity by moving out of or within your threatened area.",
      "_icon" : "",
      "_requires" : ["Anticipate Dodge","Dodge","Mobility","base attack bonus +9","Brawler level 6 or Monk level 6"]
    }
  },
  "covering_defense" : {
    "_name" : "Covering Defense",
    "_description" : "When you use the total defense action while using a light, heavy, or tower shield, you can provide a cover bonus to AC against all attacks to an adjacent ally your size or smaller. This cover bonus is equal to your shield’s shield bonus and lasts until the beginning of your next turn. your shield does not provide a cover bonus to reflex saves.",
    "_icon" : "",
    "+feats.covering_defense" : {
      "_name" : "Covering Defense",
      "_description" : "When you use the total defense action while using a light, heavy, or tower shield, you can provide a cover bonus to AC against all attacks to an adjacent ally your size or smaller. This cover bonus is equal to your shield’s shield bonus and lasts until the beginning of your next turn. your shield does not provide a cover bonus to reflex saves.",
      "_icon" : "",
      "_requires" : ["Shield Focus","base attack bonus +6"]
    }
  },
  "covering_fire" : {
    "_name" : "Covering Fire",
    "_description" : "When you hit a foe with a firearm for which you have Weapon Focus, that creature takes a –2 penalty on attack rolls for 1 round against any other ally that also has this feat; this changes to a –4 penalty on attacks of opportunity. The penalty applied by this feat does not stack with itself. However, if both you and an ally with this feat attack the same foe, you can cover each other (since a penalty you impose with this feat doesn’t apply to attacks against you).",
    "_icon" : "",
    "+feats.covering_fire" : {
      "_name" : "Covering Fire",
      "_description" : "When you hit a foe with a firearm for which you have Weapon Focus, that creature takes a –2 penalty on attack rolls for 1 round against any other ally that also has this feat; this changes to a –4 penalty on attacks of opportunity. The penalty applied by this feat does not stack with itself. However, if both you and an ally with this feat attack the same foe, you can cover each other (since a penalty you impose with this feat doesn’t apply to attacks against you).",
      "_icon" : "",
      "_requires" : ["Exotic Weapon Proficiency: Firearms","Weapon Focus: at least one Firearm"]
    }
  },
  "crane_style" : {
    "_name" : "Crane Style",
    "_description" : "You take only a –2 penalty on attack rolls for fighting defensively. While using this style and fighting defensively or using the total defense action, you gain an additional +1 dodge bonus to your Armor Class.",
    "_icon" : "",
    "+feats.crane_style" : {
      "_name" : "Crane Style",
      "_description" : "You take only a –2 penalty on attack rolls for fighting defensively. While using this style and fighting defensively or using the total defense action, you gain an additional +1 dodge bonus to your Armor Class.",
      "_icon" : "",
      "_requires" : ["Dodge","Improved Unarme Strike","base attack bonus +2 or Monk level 1"]
    }
  },
  "crane_wing" : {
    "_name" : "Crane Wing",
    "_description" : "When fighting defensively with at least one hand free, you gain a +4 dodge bonus to AC against melee attacks. If a melee attack misses you by 4 or less, you lose this dodge bonus until the beginning of your next turn. If you using the total defense action instead, you can deflect one melee attack that would normally hit you. An attack so deflected deals no damage and has no other effect (instead treat it as a miss). You do not expend an action when using this feat, but you must be aware of the attack and not flat-footed.",
    "_icon" : "",
    "+feats.crane_wing" : {
      "_name" : "Crane Wing",
      "_description" : "When fighting defensively with at least one hand free, you gain a +4 dodge bonus to AC against melee attacks. If a melee attack misses you by 4 or less, you lose this dodge bonus until the beginning of your next turn. If you using the total defense action instead, you can deflect one melee attack that would normally hit you. An attack so deflected deals no damage and has no other effect (instead treat it as a miss). You do not expend an action when using this feat, but you must be aware of the attack and not flat-footed.",
      "_icon" : "",
      "_requires" : ["Crane Style","Dodge","Improved Unarmed Strike","base attack bonus +5 or Monk level 5"]
    }
  },
  "crane_riposte" : {
    "_name" : "Crane Riposte",
    "_description" : "You take only a –1 penalty on attack rolls for fighting defensively. Whenever you deflect an opponent’s attack using Crane Wing or lose the dodge bonus from Crane Wing because an attack missed you by 4 or less, you can make an attack of opportunity against the attacker after the attack misses. In addition, when you deflect an attack using Crane Wing while taking the total defense action, you may make an attack of opportunity against that opponent (even though you could not normally do so while taking the total defense action).",
    "_icon" : "",
    "+feats.crane_riposte" : {
      "_name" : "Crane Riposte",
      "_description" : "You take only a –1 penalty on attack rolls for fighting defensively. Whenever you deflect an opponent’s attack using Crane Wing or lose the dodge bonus from Crane Wing because an attack missed you by 4 or less, you can make an attack of opportunity against the attacker after the attack misses. In addition, when you deflect an attack using Crane Wing while taking the total defense action, you may make an attack of opportunity against that opponent (even though you could not normally do so while taking the total defense action).",
      "_icon" : "",
      "_requires" : ["Crane Style","Crane Wing","Dodge","Improved Unarmed Strike","base attack bonus +8 or Monk level 7"]
    }
  },
  "critical_focus" : {
    "_name" : "Critical Focus",
    "_description" : "You receive a +4 circumstance bonus on attack rolls made to confirm critical hits.",
    "_icon" : "",
    "+feats.critical_focus" : {
      "_name" : "Critical Focus",
      "_description" : "You receive a +4 circumstance bonus on attack rolls made to confirm critical hits.",
      "_icon" : "",
      "_requires" : ["Base attack bonus +9"]
    }
  },
  "banishing_critical" : {
    "_name" : "Banishing Critical",
    "_description" : "When you confirm a critical hit against a target while using Arcane Strike or with a weapon enhanced by your arcane pool, if the target was summoned by a spell you identified using a Spellcraft check, it must succeed at a Will save (DC = 10 + 1/2 your character level + your Intelligence modifier) or be sent back to its home plane as per the dismissal spell.",
    "_icon" : "",
    "+feats.banishing_critical" : {
      "_name" : "Banishing Critical",
      "_description" : "When you confirm a critical hit against a target while using Arcane Strike or with a weapon enhanced by your arcane pool, if the target was summoned by a spell you identified using a Spellcraft check, it must succeed at a Will save (DC = 10 + 1/2 your character level + your Intelligence modifier) or be sent back to its home plane as per the dismissal spell.",
      "_icon" : "",
      "_requires" : ["Arcane Strike or Disruptive","Spellcraft rank 8","Arcane Pool class feature"]
    }
  },
  "bleeding_critical" : {
    "_name" : "Bleeding Critical",
    "_description" : "Whenever you score a critical hit with a slashing or piercing weapon, your opponent takes 2d6 points of bleed damage each round on his turn, in addition to the damage dealt by the critical hit. Bleed damage can be stopped by a DC 15 Heal skill check or through any magical healing. The effects of this feat stack.",
    "_icon" : "",
    "+feats.bleeding_critical" : {
      "_name" : "Bleeding Critical",
      "_description" : "Whenever you score a critical hit with a slashing or piercing weapon, your opponent takes 2d6 points of bleed damage each round on his turn, in addition to the damage dealt by the critical hit. Bleed damage can be stopped by a DC 15 Heal skill check or through any magical healing. The effects of this feat stack. You can only apply the effects of one critical feat to a given critical hit unless you possess Critical Mastery.",
      "_icon" : "",
      "_requires" : ["Critical Focus","base attack bonus +11"]
    }
  },
  "blinding_critical" : {
    "_name" : "Blinding Critical",
    "_description" : "Whenever you score a critical hit, your opponent is permanently blinded. A successful Fortitude save reduces this to dazzled for 1d4 rounds. The DC of this Fortitude save is equal to 10 + your base attack bonus. This feat has no effect on creatures that do not rely on eyes for sight or creatures with more than two eyes (although multiple critical hits might cause blindness, at the GM’s discretion). Blindness can be cured by heal, regenerate, remove blindness, or similar abilities.",
    "_icon" : "",
    "+feats.blinding_critical" : {
      "_name" : "Blinding Critical",
      "_description" : "Whenever you score a critical hit, your opponent is permanently blinded. A successful Fortitude save reduces this to dazzled for 1d4 rounds. The DC of this Fortitude save is equal to 10 + your base attack bonus. This feat has no effect on creatures that do not rely on eyes for sight or creatures with more than two eyes (although multiple critical hits might cause blindness, at the GM’s discretion). Blindness can be cured by heal, regenerate, remove blindness, or similar abilities. You can only apply the effects of one critical feat to a given critical hit unless you possess Critical Mastery.",
      "_icon" : "",
      "_requires" : ["Critical Focus","base attack bonus +15"]
    }
  },
  "censoring_critical" : {
    "_name" : "Censoring Critical",
    "_description" : "Whenever you score a critical hit against an opponent, the victim is unable to speak for 1d4+1 rounds. This prevents spellcasters from using spells with verbal components. A successful Fortitude saving throw reduces this muteness to 1 round. The DC of this Fortitude save is equal to 10 + your base attack bonus.",
    "_icon" : "",
    "+feats.censoring_critical" : {
      "_name" : "Censoring Critical",
      "_description" : "Whenever you score a critical hit against an opponent, the victim is unable to speak for 1d4+1 rounds. This prevents spellcasters from using spells with verbal components. A successful Fortitude saving throw reduces this muteness to 1 round. The DC of this Fortitude save is equal to 10 + your base attack bonus. You can apply the effects of only one critical feat to a given critical hit unless you have Critical Mastery.",
      "_icon" : "",
      "_requires" : ["Critical Focus","base attack bonus +15"]
    }
  },
  "crippling_critical" : {
    "_name" : "Crippling Critical",
    "_description" : "Whenever you score a critical hit against an opponent, its speed is halved for 1 minute. A successful Fortitude save reduces this duration to 1d4 rounds. The DC of this save is equal to 10 + your base attack bonus. Against creatures with multiple types of movement, you must choose which movement type to affect. A flying creature hit by this attack must make a DC 10 Fly check to remain airborne, and has its maneuverability reduced by one step.",
    "_icon" : "",
    "+feats.crippling_critical" : {
      "_name" : "Crippling Critical",
      "_description" : "Whenever you score a critical hit against an opponent, its speed is halved for 1 minute. A successful Fortitude save reduces this duration to 1d4 rounds. The DC of this save is equal to 10 + your base attack bonus. Against creatures with multiple types of movement, you must choose which movement type to affect. A flying creature hit by this attack must make a DC 10 Fly check to remain airborne, and has its maneuverability reduced by one step. You can only apply the effects of one critical feat to a given critical hit unless you possess Critical Mastery.",
      "_icon" : "",
      "_requires" : ["Critical Focus","base attack bonus +13"]
    }
  },
  "deafening_critical" : {
    "_name" : "Deafening Critical",
    "_description" : "Whenever you score a critical hit against an opponent, the victim is permanently deafened. A successful Fortitude save reduces the deafness to 1 round. The DC of this Fortitude save is equal to 10 + your base attack bonus. This feat has no effect on deaf creatures. This deafness can be cured by heal, regeneration, remove deafness, or a similar ability.",
    "_icon" : "",
    "+feats.deafening_critical" : {
      "_name" : "Deafening Critical",
      "_description" : "Whenever you score a critical hit against an opponent, the victim is permanently deafened. A successful Fortitude save reduces the deafness to 1 round. The DC of this Fortitude save is equal to 10 + your base attack bonus. This feat has no effect on deaf creatures. This deafness can be cured by heal, regeneration, remove deafness, or a similar ability. You can only apply the effects of one critical feat to a given critical hit unless you possess Critical Mastery.",
      "_icon" : "",
      "_requires" : ["Critical Focus","base attack bonus +13"]
    }
  },
  "exhausting_critical" : {
    "_name" : "Exhausting Critical",
    "_description" : "When you score a critical hit on a foe, your target immediately becomes exhausted. This feat has no effect on exhausted creatures.",
    "_icon" : "",
    "+feats.exhausting_critical" : {
      "_name" : "Exhausting Critical",
      "_description" : "When you score a critical hit on a foe, your target immediately becomes exhausted. This feat has no effect on exhausted creatures. You can only apply the effects of one critical feat to a given critical hit unless you possess the Critical Mastery feat.",
      "_icon" : "",
      "_requires" : ["Critical Focus","Tiring Critical","base attack bonus +15"]
    }
  },
  "sickening_critical" : {
    "_name" : "Sickening Critical",
    "_description" : "Whenever you score a critical hit, your opponent becomes sickened for 1 minute. The effects of this feat do not stack. Additional hits instead add to the effect’s duration.",
    "_icon" : "",
    "+feats.sickening_critical" : {
      "_name" : "Sickening Critical",
      "_description" : "Whenever you score a critical hit, your opponent becomes sickened for 1 minute. The effects of this feat do not stack. Additional hits instead add to the effect’s duration. You can only apply the effects of one critical feat to a given critical hit unless you possess Critical Mastery.",
      "_icon" : "",
      "_requires" : ["Critical Focus","base attack bonus +11"]
    }
  },
  "staggering_critical" : {
    "_name" : "Staggering Critical",
    "_description" : "Whenever you score a critical hit, your opponent becomes staggered for 1d4+1 rounds. A successful Fortitude save reduces the duration to 1 round. The DC of this Fortitude save is equal to 10 + your base attack bonus. The effects of this feat do not stack. Additional hits instead add to the duration.",
    "_icon" : "",
    "+feats.staggering_critical" : {
      "_name" : "Staggering Critical",
      "_description" : "Whenever you score a critical hit, your opponent becomes staggered for 1d4+1 rounds. A successful Fortitude save reduces the duration to 1 round. The DC of this Fortitude save is equal to 10 + your base attack bonus. The effects of this feat do not stack. Additional hits instead add to the duration. You can only apply the effects of one critical feat to a given critical hit unless you possess Critical Mastery.",
      "_icon" : "",
      "_requires" : ["Critical Focus","base attack bonus +13"]
    }
  },
  "stunning_critical" : {
    "_name" : "Stunning Critical",
    "_description" : "Whenever you score a critical hit, your opponent becomes stunned for 1d4 rounds. A successful Fortitude save reduces this to staggered for 1d4 rounds. The DC of this Fortitude save is equal to 10 + your base attack bonus. The effects of this feat do not stack. Additional hits instead add to the duration.",
    "_icon" : "",
    "+feats.stunning_critical" : {
      "_name" : "Stunning Critical",
      "_description" : "Whenever you score a critical hit, your opponent becomes stunned for 1d4 rounds. A successful Fortitude save reduces this to staggered for 1d4 rounds. The DC of this Fortitude save is equal to 10 + your base attack bonus. The effects of this feat do not stack. Additional hits instead add to the duration. You can only apply the effects of one critical feat to a given critical hit unless you possess Critical Mastery.",
      "_icon" : "",
      "_requires" : ["Critical Focus","Staggering Critical","base attack bonus +17"]
    }
  },
  "tiring_critical" : {
    "_name" : "Tiring Critical",
    "_description" : "Whenever you score a critical hit, your opponent becomes fatigued. This feat has no additional effect on a fatigued or exhausted creature.",
    "_icon" : "",
    "+feats.tiring_critical" : {
      "_name" : "Tiring Critical",
      "_description" : "Whenever you score a critical hit, your opponent becomes fatigued. This feat has no additional effect on a fatigued or exhausted creature. You can only apply the effects of one critical feat to a given critical hit unless you possess Critical Mastery.",
      "_icon" : "",
      "_requires" : ["Critical Focus","base attack bonus +13"]
    }
  },
  "improved_critical" : {
    "_name" : "Improved Critical",
    "_description" : "When using the weapon you selected, your threat range is doubled.",
    "_icon" : "",
    "+feats.improved_critical" : {
      "_name" : "Improved Critical",
      "_description" : "When using the weapon you selected, your threat range is doubled. You can gain Improved Critical multiple times. The effects do not stack. Each time you take the feat, it applies to a new type of weapon. This effect doesn’t stack with any other effect that expands the threat range of a weapon.",
      "_icon" : "",
      "_requires" : ["Proficient with chosen weapon","base attack bonus +8"]
    }
  },
  "critical_mastery" : {
    "_name" : "Critical Mastery",
    "_description" : "When you score a critical hit, you can apply the effects of two critical feats in addition to the damage dealt.",
    "_icon" : "",
    "+feats.critical_mastery" : {
      "_name" : "Critical Mastery",
      "_description" : "When you score a critical hit, you can apply the effects of two critical feats in addition to the damage dealt.",
      "_icon" : "",
      "_requires" : ["Critical Focus","Any two Critical feats","Fighter level 14"]
    }
  },
  "critical_versatility" : {
    "_name" : "Critical Versatility",
    "_description" : "Once per day, you can spend 1 hour practicing maneuvers to gain one single critical feat that you meet the prerequisites for. You gain the benefits of the chosen critical feat until you choose to practice a different critical feat.",
    "_icon" : "",
    "+feats.critical_versatility" : {
      "_name" : "Critical Versatility",
      "_description" : "Once per day, you can spend 1 hour practicing maneuvers to gain one single critical feat that you meet the prerequisites for. You gain the benefits of the chosen critical feat until you choose to practice a different critical feat.",
      "_icon" : "",
      "_requires" : ["Fighter level 11","Human"]
    }
  },
  "crossbow_mastery" : {
    "_name" : "Crossbow Mastery",
    "_description" : "The time required for you to reload any type of crossbow is reduced to a free action, regardless of the type of crossbow used. You can fire a crossbow as many times in a full attack action as you could attack if you were using a bow. Reloading a crossbow for the type of crossbow you chose when you took Rapid Reload no longer provokes attacks of opportunity.",
    "_icon" : "",
    "+feats.crossbow_mastery" : {
      "_name" : "Crossbow Mastery",
      "_description" : "The time required for you to reload any type of crossbow is reduced to a free action, regardless of the type of crossbow used. You can fire a crossbow as many times in a full attack action as you could attack if you were using a bow. Reloading a crossbow for the type of crossbow you chose when you took Rapid Reload no longer provokes attacks of opportunity. Starting at 6th level, a ranger with the archery combat style may select Crossbow Mastery as a combat style feat.",
      "_icon" : "",
      "_requires" : ["Dexterity 15","Point-Blank Shot","Rapid Reload","Rapid Shot"]
    }
  },
  "crowd_of_bullies" : {
    "_name" : "Crowd of Bullies",
    "_description" : "Whenever you fail a combat maneuver check, your allies within 30 feet who also have this feat gain a +2 circumstance bonus on combat maneuver checks of the same type against the same foe for 1 round.",
    "_icon" : "",
    "+feats.crowd_of_bullies" : {
      "_name" : "Crowd of Bullies",
      "_description" : "Whenever you fail a combat maneuver check, your allies within 30 feet who also have this feat gain a +2 circumstance bonus on combat maneuver checks of the same type against the same foe for 1 round.",
      "_icon" : "",
      "_requires" : ["Half-orc"]
    }
  },
  "crowd_control" : {
    "_name" : "Crowd Control",
    "_description" : "You gain a +2 competence bonus to your CMD when an enemy uses Acrobatics to move through a square you threaten. For each ally within your reach that also has this feat, the bonus increases by an additional 2.",
    "_icon" : "",
    "+feats.crowd_control" : {
      "_name" : "Crowd Control",
      "_description" : "You gain a +2 competence bonus to your CMD when an enemy uses Acrobatics to move through a square you threaten. For each ally within your reach that also has this feat, the bonus increases by an additional 2.",
      "_icon" : "",
      "_requires" : ["Base attack bonus +3"]
    }
  },
  "crusaders_fist" : {
    "_name" : "Crusaders Fist",
    "_description" : "When you attack with an unarmed strike and hit a creature that you can harm with your lay on hands or touch of corruption feature, you can use a swift action to expend a daily use of that feature to deal its normal damage as if you had hit with the feature’s normal touch attack. This extra damage is not multiplied if you scored a critical hit.",
    "_icon" : "",
    "+feats.crusaders_fist" : {
      "_name" : "Crusaders Fist",
      "_description" : "When you attack with an unarmed strike and hit a creature that you can harm with your lay on hands or touch of corruption feature, you can use a swift action to expend a daily use of that feature to deal its normal damage as if you had hit with the feature’s normal touch attack. This extra damage is not multiplied if you scored a critical hit.",
      "_icon" : "",
      "_requires" : ["Lay on Hands class feature or Touch of Corruption class feature","Improved Unarmed Strike","Base attack bonus +6"]
    }
  },
  "crushing_blow" : {
    "_name" : "Crushing Blow",
    "_description" : "You can make a Stunning Fist attempt as a full-round action. If successful, instead of stunning your target, you reduce the target’s AC by an amount equal to your Wisdom modifier for 1 minute. This penalty does not stack with other penalties applied due to Crushing Blow.",
    "_icon" : "",
    "+feats.crushing_blow" : {
      "_name" : "Crushing Blow",
      "_description" : "You can make a Stunning Fist attempt as a full-round action. If successful, instead of stunning your target, you reduce the target’s AC by an amount equal to your Wisdom modifier for 1 minute. This penalty does not stack with other penalties applied due to Crushing Blow.",
      "_icon" : "",
      "_requires" : ["Improved Unarmed Strike","Stunning Fist"]
    }
  },
  "cudgeler_style" : {
    "_name" : "Cudgeler Style",
    "_description" : "When you hit with a charge attack to deal nonlethal damage while using this style, your weapon deals damage as if it were one size category larger than it actually is. If you have the ability to make more than one attack on a charge, this increase applies only to your first attack.",
    "_icon" : "",
    "+feats.cudgeler_style" : {
      "_name" : "Cudgeler Style",
      "_description" : "When you hit with a charge attack to deal nonlethal damage while using this style, your weapon deals damage as if it were one size category larger than it actually is. If you have the ability to make more than one attack on a charge, this increase applies only to your first attack.",
      "_icon" : "",
      "_requires" : ["Bludgeoner"]
    }
  },
  "cudgeler_sweep" : {
    "_name" : "Cudgeler Sweep",
    "_description" : "When you hit with a charge attack using the Cudgeler Style feat, you can immediately attempt a single trip combat maneuver check against the target with a +2 competence bonus as a free action. This provokes an attack of opportunity as normal for a trip combat maneuver.",
    "_icon" : "",
    "+feats.cudgeler_sweep" : {
      "_name" : "Cudgeler Sweep",
      "_description" : "When you hit with a charge attack using the Cudgeler Style feat, you can immediately attempt a single trip combat maneuver check against the target with a +2 competence bonus as a free action. This provokes an attack of opportunity as normal for a trip combat maneuver.",
      "_icon" : "",
      "_requires" : ["Bludgeoner","Cudgeler Style","base attack bonus +5 or Monk level 5"]
    }
  },
  "cudgeler_takedown" : {
    "_name" : "Cudgeler Takedown",
    "_description" : "When you hit with a charge attack using the Cudgeler Style feat, your weapon deals damage as though it were one size category larger for 1 round or until it leaves your hand. When you successfully trip an opponent with the Cudgeler Sweep feat, your opponent must succeed at a Fortitude save (DC = 10 + your character level + your Strength modifier) or be stunned for 1 round.",
    "_icon" : "",
    "+feats.cudgeler_takedown" : {
      "_name" : "Cudgeler Takedown",
      "_description" : "When you hit with a charge attack using the Cudgeler Style feat, your weapon deals damage as though it were one size category larger for 1 round or until it leaves your hand. When you successfully trip an opponent with the Cudgeler Sweep feat, your opponent must succeed at a Fortitude save (DC = 10 + your character level + your Strength modifier) or be stunned for 1 round.",
      "_icon" : "",
      "_requires" : ["Bludgeoner","Cudgeler Style","Cudgeler Sweep","base attack bonus +9 or Monk level 9"]
    }
  },
  "cunning_intuition" : {
    "_name" : "Cunning Intuition",
    "_description" : "When you ready an action, you do not need to declare what action you will take, only the trigger for that action and an action type (either standard, move, swift, or free). If you choose the standard action type, you can take a move action instead when your readied action triggers. When the condition triggers, you can choose a specific action of the appropriate type to take.",
    "_icon" : "",
    "+feats.cunning_intuition" : {
      "_name" : "Cunning Intuition",
      "_description" : "When you ready an action, you do not need to declare what action you will take, only the trigger for that action and an action type (either standard, move, swift, or free). If you choose the standard action type, you can take a move action instead when your readied action triggers. When the condition triggers, you can choose a specific action of the appropriate type to take.",
      "_icon" : "",
      "_requires" : ["Alertness","Improved Initiative","Lightning Reflexes","Quick Draw","Ready for Anything","base attack bonus +13 or Rogue level 13","Sense Motive rank 13"]
    }
  },
  "combat_weapon_focus" : {
    "_name" : "Weapon Focus",
    "_description" : "Choose one type of weapon. You can also choose unarmed strike or grapple (or ray, if you are a spellcaster) as your weapon for the purposes of this feat. You gain a +1 bonus on all attack rolls you make using the selected weapon. You can gain this feat multiple times. Its effects do not stack. Each time you take the feat, it applies to a new type of weapon.",
    "_icon" : "sword",
    "+feats.combat_weapon_focus" : {
      "_name" : "Weapon Focus",
      "_description" : "Choose one type of weapon. You can also choose unarmed strike or grapple (or ray, if you are a spellcaster) as your weapon for the purposes of this feat. You gain a +1 bonus on all attack rolls you make using the selected weapon. You can gain this feat multiple times. Its effects do not stack. Each time you take the feat, it applies to a new type of weapon.",
      "_icon" : "",
      "_requires" : ["Proficiency with selected weapon","BAB >= 1"]
    }
  },
  "dance_of_chains" : {
    "_name" : "Dance of Chains",
    "_description" : "When wielding a spiked chain one-handed, you can add your Dexterity modifier instead of your Strength modifier to that weapon’s damage. The spiked chain must be one appropriate for your size. During your turn, you treat your reach with the spiked chain as 5 feet greater. You lose these benefits while fighting with multiple weapons or when using a shield (but not when using a buckler).",
    "_icon" : "",
    "+feats.dance_of_chains" : {
      "_name" : "Dance of Chains",
      "_description" : "When wielding a spiked chain one-handed, you can add your Dexterity modifier instead of your Strength modifier to that weapon’s damage. The spiked chain must be one appropriate for your size. During your turn, you treat your reach with the spiked chain as 5 feet greater. You lose these benefits while fighting with multiple weapons or when using a shield (but not when using a buckler).",
      "_icon" : "",
      "_requires" : ["Dexterity 15","Chain Mastery","Exotic Weapon Proficiency: Spiked Chain","Weapon Finesse","Perform (Dance) rank 1"]
    }
  },
  "darting_viper" : {
    "_name" : "Darting Viper",
    "_description" : "You can change whether you’re using the dorn-dergar as a normal or reach weapon as a swift action.",
    "_icon" : "",
    "+feats.darting_viper" : {
      "_name" : "Darting Viper",
      "_description" : "You can change whether you’re using the dorn-dergar as a normal or reach weapon as a swift action.",
      "_icon" : "",
      "_requires" : ["Base attack bonus +4","proficiency with the Dwarven dorn-dergar"]
    }
  },
  "dastardly_finish" : {
    "_name" : "Dastardly Finish",
    "_description" : "You can deliver a coup de grace to cowering or stunned targets.",
    "_icon" : "",
    "+feats.dastardly_finish" : {
      "_name" : "Dastardly Finish",
      "_description" : "You can deliver a coup de grace to cowering or stunned targets.",
      "_icon" : "",
      "_requires" : ["Sneak attack +5d6"]
    }
  },
  "dazing_assault" : {
    "_name" : "Dazing Assault",
    "_description" : "You can choose to take a –5 penalty on all melee attack rolls and combat maneuver checks to daze opponents you hit with your melee attacks for 1 round, in addition to the normal damage dealt by the attack. A successful Fortitude save negates the effect. The DC of this save is 10 + your base attack bonus. You must choose to use this feat before making the attack roll, and its effects last until your next turn.",
    "_icon" : "",
    "+feats.dazing_assault" : {
      "_name" : "Dazing Assault",
      "_description" : "You can choose to take a –5 penalty on all melee attack rolls and combat maneuver checks to daze opponents you hit with your melee attacks for 1 round, in addition to the normal damage dealt by the attack. A successful Fortitude save negates the effect. The DC of this save is 10 + your base attack bonus. You must choose to use this feat before making the attack roll, and its effects last until your next turn.",
      "_icon" : "",
      "_requires" : ["Strength 13","Power Attack","base attack bonus +11"]
    }
  },
  "dazing_fist" : {
    "_name" : "Dazing Fist",
    "_description" : "You must declare that you are using this feat before you make your attack roll (thus, a failed attack roll ruins the attempt). Dazing Fist forces a foe damaged by your unarmed attack to attempt a Fortitude saving throw (DC = 10 + 1/2 your character level + your Wisdom modifier), in addition to dealing damage normally. A foe who fails this saving throw is dazed for 1 round, until just before your next turn. You can attempt to use Dazing Fist once per day for every 4 character levels you have, but no more than once per round. Constructs, incorporeal creatures, plants, undead, and creatures that are immune to critical hits cannot be affected by this ability.",
    "_icon" : "",
    "+feats.dazing_fist" : {
      "_name" : "Dazing Fist",
      "_description" : "You must declare that you are using this feat before you make your attack roll (thus, a failed attack roll ruins the attempt). Dazing Fist forces a foe damaged by your unarmed attack to attempt a Fortitude saving throw (DC = 10 + 1/2 your character level + your Wisdom modifier), in addition to dealing damage normally. A foe who fails this saving throw is dazed for 1 round, until just before your next turn. You can attempt to use Dazing Fist once per day for every 4 character levels you have, but no more than once per round. Constructs, incorporeal creatures, plants, undead, and creatures that are immune to critical hits cannot be affected by this ability.",
      "_icon" : "",
      "_requires" : ["Dexterity 13","Wisdom 13","Improved Unarmed Strike","base attack bonus +4"]
    }
  },
  "dazzling_display" : {
    "_name" : "Dazzling Display",
    "_description" : "While wielding the weapon in which you have Weapon Focus, you can perform a bewildering show of prowess as a full-round action. Make an Intimidate check to demoralize all foes within 30 feet who can see your display.",
    "_icon" : "",
    "+feats.dazzling_display" : {
      "_name" : "Dazzling Display",
      "_description" : "While wielding the weapon in which you have Weapon Focus, you can perform a bewildering show of prowess as a full-round action. Make an Intimidate check to demoralize all foes within 30 feet who can see your display.",
      "_icon" : "",
      "_requires" : ["Weapon Focus","proficiency with the selected weapon"]
    }
  },
  "deadly_aim" : {
    "_name" : "Deadly Aim",
    "_description" : "You can choose to take a –1 penalty on all ranged attack rolls to gain a +2 bonus on all ranged damage rolls. When your base attack bonus reaches +4, and every +4 thereafter, the penalty increases by –1 and the bonus to damage increases by +2. You must choose to use this feat before making an attack roll and its effects last until your next turn. The bonus damage does not apply to touch attacks or effects that do not deal hit point damage.",
    "_icon" : "",
    "+feats.deadly_aim" : {
      "_name" : "Deadly Aim",
      "_description" : "You can choose to take a –1 penalty on all ranged attack rolls to gain a +2 bonus on all ranged damage rolls. When your base attack bonus reaches +4, and every +4 thereafter, the penalty increases by –1 and the bonus to damage increases by +2. You must choose to use this feat before making an attack roll and its effects last until your next turn. The bonus damage does not apply to touch attacks or effects that do not deal hit point damage.",
      "_icon" : "",
      "_requires" : ["Dexterity 13","base attack bonus +1"]
    }
  },
  "deadhand_style" : {
    "_name" : "Deadhand Style",
    "_description" : "While using this style, if you have at least 1 point in your ki pool, you gain a +2 bonus on saves against fear effects, and the DC of Intimidate checks against you increases by 4. As a swift action, you can spend 1 point from your ki pool to empower your unarmed strikes. Creatures hit with your unarmed strikes must succeed at a Will save (DC = 10 + 1/2 your character level + your Wisdom modifier) or become shaken for a number of rounds equal to your Wisdom modifier. This is a mind-affecting fear effect.",
    "_icon" : "",
    "+feats.deadhand_style" : {
      "_name" : "Deadhand Style",
      "_description" : "While using this style, if you have at least 1 point in your ki pool, you gain a +2 bonus on saves against fear effects, and the DC of Intimidate checks against you increases by 4. As a swift action, you can spend 1 point from your ki pool to empower your unarmed strikes. Creatures hit with your unarmed strikes must succeed at a Will save (DC = 10 + 1/2 your character level + your Wisdom modifier) or become shaken for a number of rounds equal to your Wisdom modifier. This is a mind-affecting fear effect.",
      "_icon" : "",
      "_requires" : ["Wisdom 15","Improved Unarmed Strike","Knowledge: Religion rank 4","Ki Pool class feature","Non-Good Alignment"]
    }
  },
  "deadhand_initiate" : {
    "_name" : "Deadhand Initiate",
    "_description" : "While using Deadhand Style, as long as you have at least 1 point in your ki pool, your bonus on saving throws against fear effects increases to +4, and the DC of Intimidate checks attempted against you increases by 8. Additionally, if an enemy targets you with a fear effect, you can spend 1 point from your ki pool as an immediate action to gain a number of temporary hit points equal to twice your Hit Dice.",
    "_icon" : "",
    "+feats.deadhand_initiate" : {
      "_name" : "Deadhand Initiate",
      "_description" : "While using Deadhand Style, as long as you have at least 1 point in your ki pool, your bonus on saving throws against fear effects increases to +4, and the DC of Intimidate checks attempted against you increases by 8. Additionally, if an enemy targets you with a fear effect, you can spend 1 point from your ki pool as an immediate action to gain a number of temporary hit points equal to twice your Hit Dice.",
      "_icon" : "",
      "_requires" : ["Wisdom 19","Deadhand Style","Improved Unarmed Strike","Knowledge: Religion rank 6","Ki Pool class feature","Non-Good Alignment"]
    }
  },
  "deadhand_master" : {
    "_name" : "Deadhand Master",
    "_description" : "While using Deadhand Style, when you damage a living creature with an unarmed strike, you can spend 2 points from your ki pool as a swift action to inflict 2 temporary negative levels on your enemy with no saving throw. Effects that reduce the ki cost also reduce the number of negative levels you inflict on your foe, but effects that increase the ki cost do not increase the number of negative levels you inflict. As long as the foe is affected by the temporary negative levels, you can’t recover the ki points you spent, effectively reducing the size of your ki pool. The Fortitude save DC to remove the negative levels and prevent them from becoming permanent is equal to 10 + 1/2 your Hit Dice + your Wisdom modifier. Once the negative levels become permanent or the foe removes them, you can recover your spent ki points. If the foe dies before either happens, you can recover the spent ki after 24 hours.",
    "_icon" : "",
    "+feats.deadhand_master" : {
      "_name" : "Deadhand Master",
      "_description" : "While using Deadhand Style, when you damage a living creature with an unarmed strike, you can spend 2 points from your ki pool as a swift action to inflict 2 temporary negative levels on your enemy with no saving throw. Effects that reduce the ki cost also reduce the number of negative levels you inflict on your foe, but effects that increase the ki cost do not increase the number of negative levels you inflict. As long as the foe is affected by the temporary negative levels, you can’t recover the ki points you spent, effectively reducing the size of your ki pool. The Fortitude save DC to remove the negative levels and prevent them from becoming permanent is equal to 10 + 1/2 your Hit Dice + your Wisdom modifier. Once the negative levels become permanent or the foe removes them, you can recover your spent ki points. If the foe dies before either happens, you can recover the spent ki after 24 hours.",
      "_icon" : "",
      "_requires" : ["Wisdom 23","Deadhand Initiate","Deadhand Style","Improved Unarmed Strike","Knowledge: Religion rank 14","Ki Pool class feature","Non-Good Alignment"]
    }
  },
  "deadly_finish" : {
    "_name" : "Deadly Finish",
    "_description" : "When you hit with a melee attack and reduce your opponent to –1 or fewer hit points, you can force that opponent to succeed at a Fortitude save (DC 15 + the damage your attack dealt) or die.",
    "_icon" : "",
    "+feats.deadly_finish" : {
      "_name" : "Deadly Finish",
      "_description" : "When you hit with a melee attack and reduce your opponent to –1 or fewer hit points, you can force that opponent to succeed at a Fortitude save (DC 15 + the damage your attack dealt) or die.",
      "_icon" : "",
      "_requires" : ["Base attack bonus +11"]
    }
  },
  "deadly_grappler" : {
    "_name" : "Deadly Grappler",
    "_description" : "You have learned to leverage a grappling creature’s weight against it. While you’re grappled, attacks you make against the grappler using armor spikes, a light or one-handed weapon, a natural weapon, or an unarmed strike deal damage as if the strike or weapon were one size category larger than it actually is.",
    "_icon" : "",
    "+feats.deadly_grappler" : {
      "_name" : "Deadly Grappler",
      "_description" : "You have learned to leverage a grappling creature’s weight against it. While you’re grappled, attacks you make against the grappler using armor spikes, a light or one-handed weapon, a natural weapon, or an unarmed strike deal damage as if the strike or weapon were one size category larger than it actually is.",
      "_icon" : "",
      "_requires" : ["Dexterity 13", "Improved Grapple","Improved Unarmed Strike"]
    }
  },
  "deadly_stroke" : {
    "_name" : "Deadly Stroke",
    "_description" : "As a standard action, make a single attack with the weapon for which you have Greater Weapon Focus against a stunned or flat-footed opponent. If you hit, you deal double the normal damage and the target takes 1 point of Constitution bleed (see Conditions). The additional damage and bleed is not multiplied on a critical hit.",
    "_icon" : "",
    "+feats.deadly_stroke" : {
      "_name" : "Deadly Stroke",
      "_description" : "As a standard action, make a single attack with the weapon for which you have Greater Weapon Focus against a stunned or flat-footed opponent. If you hit, you deal double the normal damage and the target takes 1 point of Constitution bleed (see Conditions). The additional damage and bleed is not multiplied on a critical hit.",
      "_icon" : "",
      "_requires" : ["Dazzling Display","Greater Weapon Focus","Shatter Defenses","Weapon Focus","proficiency with the selected weapon","base attack bonus +11"]
    }
  },
  "death_from_above" : {
    "_name" : "Death from Above",
    "_description" : "Whenever you charge an opponent from higher ground, or from above while flying, you gain a +5 bonus on attack rolls in place of the bonuses from charging and being on higher ground.",
    "_icon" : "",
    "+feats.death_from_above" : {
      "_name" : "Death from Above",
      "_description" : "Whenever you charge an opponent from higher ground, or from above while flying, you gain a +5 bonus on attack rolls in place of the bonuses from charging and being on higher ground.",
      "_icon" : "",
      "_requires" : [""]
    }
  },
  "death_or_glory" : {
    "_name" : "Death or Glory",
    "_description" : "Against a creature of size Large or larger, you can make a single melee attack as a full-round action, gaining a +4 bonus on the attack roll, damage roll, and critical confirmation roll. You gain an additional +1 on this bonus at base attack bonus +11, +16, and +20 (for a maximum of +7 at base attack +20). After you resolve your attack, the opponent you attack can spend an immediate action to make a single melee attack against you with the same bonuses.",
    "_icon" : "",
    "+feats.death_or_glory" : {
      "_name" : "Death or Glory",
      "_description" : "Against a creature of size Large or larger, you can make a single melee attack as a full-round action, gaining a +4 bonus on the attack roll, damage roll, and critical confirmation roll. You gain an additional +1 on this bonus at base attack bonus +11, +16, and +20 (for a maximum of +7 at base attack +20). After you resolve your attack, the opponent you attack can spend an immediate action to make a single melee attack against you with the same bonuses. You can combine the full-round action attack this feat allows with the benefit of Vital Strike, Improved Vital Strike, or Greater Vital Strike.",
      "_icon" : "",
      "_requires" : ["Strength 13","Power Attack","base attack bonus +6"]
    }
  },
  "death_roll" : {
    "_name" : "Death Roll",
    "_description" : "When grappling a foe of your size or smaller, you can attempt to perform a death roll. Upon a successful grapple combat maneuver check to deal damage with your bite attack, you can immediately attempt a second grapple combat maneuver check as a free action. If successful, you knock the target prone. Upon knocking the target prone, you must either release the grapple or fall prone and maintain the grapple. This doesn’t count as a combat maneuver check to maintain the grapple, and doesn’t add any other effects (such as constrict) beyond knocking the target prone.",
    "_icon" : "",
    "+feats.death_roll" : {
      "_name" : "Death Roll",
      "_description" : "When grappling a foe of your size or smaller, you can attempt to perform a death roll. Upon a successful grapple combat maneuver check to deal damage with your bite attack, you can immediately attempt a second grapple combat maneuver check as a free action. If successful, you knock the target prone. Upon knocking the target prone, you must either release the grapple or fall prone and maintain the grapple. This doesn’t count as a combat maneuver check to maintain the grapple, and doesn’t add any other effects (such as constrict) beyond knocking the target prone.",
      "_icon" : "",
      "_requires" : ["Bite attack","Reptilian subtype"]
    }
  },
  "deathless_initiate" : {
    "_name" : "Deathless Initiate",
    "_description" : "You are not staggered while using the Diehard feat, but if you take a move and a standard action or a full-round action while you are at 0 or fewer hit points you take 1 point of damage. Further, while using the Diehard feat, you gain a +2 bonus on melee attacks and damage rolls.",
    "_icon" : "",
    "+feats.deathless_initiate" : {
      "_name" : "Deathless Initiate",
      "_description" : "You are not staggered while using the Diehard feat, but if you take a move and a standard action or a full-round action while you are at 0 or fewer hit points you take 1 point of damage. Further, while using the Diehard feat, you gain a +2 bonus on melee attacks and damage rolls.",
      "_icon" : "",
      "_requires" : ["Strength 13","Constitution 13","Orc or Half-Orc","Diehard","Endurance","base attack bonus +6"]
    }
  },
  "deathless_master" : {
    "_name" : "Deathless Master",
    "_description" : "When you are at 0 or fewer hit points, you do not lose 1 hit point when you take an action.",
    "_icon" : "",
    "+feats.deathless_master" : {
      "_name" : "Deathless Master",
      "_description" : "When you are at 0 or fewer hit points, you do not lose 1 hit point when you take an action.",
      "_icon" : "",
      "_requires" : ["Strength 13","Constitution 15","Orc or Half-Orc", "Deathless Initiate","Diehard","Endurance","Ironhide","base attack bonus +9"]
    }
  },
  "deathless_zealot" : {
    "_name" : "Deathless Zealot",
    "_description" : "Whenever a creature rolls to confirm a critical hit against you, it must roll twice and take the lowest result.",
    "_icon" : "",
    "+feats.deathless_zealot" : {
      "_name" : "Deathless Zealot",
      "_description" : "Whenever a creature rolls to confirm a critical hit against you, it must roll twice and take the lowest result.",
      "_icon" : "",
      "_requires" : ["Strength 13","Constitution 17","Orc or Half-Orc", "Deathless Initiate","Deathless Master","Diehard","Endurance","Ironhide","base attack bonus +12"]
    }
  },
  "defensive_combat_training" : {
    "_name" : "Defensive Combat Training",
    "_description" : "You treat your total Hit Dice as your base attack bonus when calculating your Combat Maneuver Defense (see Combat).",
    "_icon" : "",
    "+feats.defensive_combat_training" : {
      "_name" : "Defensive Combat Training",
      "_description" : "You treat your total Hit Dice as your base attack bonus when calculating your Combat Maneuver Defense (see Combat).",
      "_icon" : "",
      "_requires" : [""]
    }
  },
  "defensive_weapon_training" : {
    "_name" : "Defensive Weapon Training",
    "_description" : "Choose a weapon group from the fighter’s weapon training class ability list (except natural weapons). You gain a +2 dodge bonus on AC when an opponent attacks you using a weapon from that group. If you also have the weapon training class feature in the selected group, your dodge bonus from this feat increases to +3.",
    "_icon" : "",
    "+feats.defensive_weapon_training" : {
      "_name" : "Defensive Weapon Training",
      "_description" : "Choose a weapon group from the fighter’s weapon training class ability list (except natural weapons). You gain a +2 dodge bonus on AC when an opponent attacks you using a weapon from that group. If you also have the weapon training class feature in the selected group, your dodge bonus from this feat increases to +3. You can select this feat more than once. Its effects do not stack. Each time you select this feat, it applies to a different weapon group.",
      "_icon" : "",
      "_requires" : ["Intelligence 13","base attaack bonus +5"]
    }
  },
  "deflect_arrows" : {
    "_name" : "Deflect Arrows",
    "_description" : "You must have at least one hand free (holding nothing) to use this feat. Once per round when you would normally be hit with an attack from a ranged weapon, you may deflect it so that you take no damage from it. You must be aware of the attack and not flat-footed. Attempting to deflect a ranged attack doesn’t count as an action. Unusually massive ranged weapons (such as boulders or ballista bolts) and ranged attacks generated by natural attacks or spell effects can’t be deflected.",
    "_icon" : "",
    "+feats.deflect_arrows" : {
      "_name" : "Deflect Arrows",
      "_description" : "You must have at least one hand free (holding nothing) to use this feat. Once per round when you would normally be hit with an attack from a ranged weapon, you may deflect it so that you take no damage from it. You must be aware of the attack and not flat-footed. Attempting to deflect a ranged attack doesn’t count as an action. Unusually massive ranged weapons (such as boulders or ballista bolts) and ranged attacks generated by natural attacks or spell effects can’t be deflected.",
      "_icon" : "",
      "_requires" : ["Dexterity 13","Improved Unarmed Strike"]
    }
  },
  "demon_hunter" : {
    "_name" : "Demon Hunter",
    "_description" : "You gain a +2 bonus on Knowledge (planes) checks to know the powers and abilities of demons. You gain a +2 morale bonus on all attack rolls and a +2 morale bonus on caster level checks to penetrate spell resistance made against creatures with the demon subtype you recognize as demons.",
    "_icon" : "",
    "+feats.demon_hunter" : {
      "_name" : "Demon Hunter",
      "_description" : "You gain a +2 bonus on Knowledge (planes) checks to know the powers and abilities of demons. You gain a +2 morale bonus on all attack rolls and a +2 morale bonus on caster level checks to penetrate spell resistance made against creatures with the demon subtype you recognize as demons.",
      "_icon" : "",
      "_requires" : ["Knowledge (Planes) rank 6"]
    }
  },
  "demonic_nemesis" : {
    "_name" : "Demonic Nemesis",
    "_description" : "When you take this feat, choose a demon lord. When fighting followers of that demon lord, including cultists or demons, you gain a +2 bonus on damage rolls and rolls to confirm critical hits against these creatures.",
    "_icon" : "",
    "+feats.demonic_nemesis" : {
      "_name" : "Demonic Nemesis",
      "_description" : "When you take this feat, choose a demon lord. When fighting followers of that demon lord, including cultists or demons, you gain a +2 bonus on damage rolls and rolls to confirm critical hits against these creatures. You can take this feat more than once. Each time you do, you must choose a new demon lord.",
      "_icon" : "",
      "_requires" : ["Demon Hunter","Knowledge (Planes) rank 6"]
    }
  },
  "demoralizing_lash" : {
    "_name" : "Demoralizing Lash",
    "_description" : "To use this feat, you must use a whip (or another weapon in the flails fighter weapon group) to attack a foe demoralized by an Intimidate check. If the attack hits, you extend the duration the creature is shaken by 1 round. This feat has no effect on creatures whose shaken conditions are from sources other than Intimidate checks.",
    "_icon" : "",
    "+feats.demoralizing_lash" : {
      "_name" : "Demoralizing Lash",
      "_description" : "To use this feat, you must use a whip (or another weapon in the flails fighter weapon group) to attack a foe demoralized by an Intimidate check. If the attack hits, you extend the duration the creature is shaken by 1 round. This feat has no effect on creatures whose shaken conditions are from sources other than Intimidate checks.",
      "_icon" : "",
      "_requires" : ["Base attack bonus +1","Intimidate rank 1","Hobgoblin"]
    }
  },
  "dented_helm" : {
    "_name" : "Dented Helm",
    "_description" : "When wearing a helmet, you add +1 to your AC against critical hit confirmation rolls. When a critical hit is confirmed against you, as an immediate action, you can apply half of the damage from the attack to your helmet rather than yourself, applying hardness as normal. If the damage destroys your helmet, any leftover damage is applied to you. After using this feat, you are staggered until the end of your next turn. You may not use this feat if your helmet has the broken condition or the attack ignores armor bonuses to AC.",
    "_icon" : "",
    "+feats.dented_helm" : {
      "_name" : "Dented Helm",
      "_description" : "When wearing a helmet, you add +1 to your AC against critical hit confirmation rolls. When a critical hit is confirmed against you, as an immediate action, you can apply half of the damage from the attack to your helmet rather than yourself, applying hardness as normal. If the damage destroys your helmet, any leftover damage is applied to you. After using this feat, you are staggered until the end of your next turn. You may not use this feat if your helmet has the broken condition or the attack ignores armor bonuses to AC.",
      "_icon" : "",
      "_requires" : ["Hard-Headed","base attack bonus +6","Dwarf"]
    }
  },
  "dervish_dance" : {
    "_name" : "Dervish Dance",
    "_description" : "When wielding a scimitar with one hand, you can use your Dexterity modifier instead of your Strength modifier on melee attack and damage rolls. You treat the scimitar as a one-handed piercing weapon for all feats and class abilities that require such a weapon (such as a duelist’s precise strike ability). The scimitar must be for a creature of your size. You cannot use this feat if you are carrying a weapon or shield in your off hand.",
    "_icon" : "",
    "+feats.dervish_dance" : {
      "_name" : "Dervish Dance",
      "_description" : "When wielding a scimitar with one hand, you can use your Dexterity modifier instead of your Strength modifier on melee attack and damage rolls. You treat the scimitar as a one-handed piercing weapon for all feats and class abilities that require such a weapon (such as a duelist’s precise strike ability). The scimitar must be for a creature of your size. You cannot use this feat if you are carrying a weapon or shield in your off hand.",
      "_icon" : "",
      "_requires" : ["Dexterity 13","Weapon Finess","Perform (Dance) rank 2","proficient with Scimitar"]
    }
  },
  "desperate_swing" : {
    "_name" : "Desperate Swing",
    "_description" : "Once per day, you can make a single melee attack while taking the total defense action. You take a –4 penalty on attack rolls when making this attack. You also gain a +4 bonus on critical confirmation rolls made while fighting defensively or making an attack of opportunity using this feat.",
    "_icon" : "",
    "+feats.desperate_swing" : {
      "_name" : "Desperate Swing",
      "_description" : "Once per day, you can make a single melee attack while taking the total defense action. You take a –4 penalty on attack rolls when making this attack. You also gain a +4 bonus on critical confirmation rolls made while fighting defensively or making an attack of opportunity using this feat.",
      "_icon" : "",
      "_requires" : ["Cautious Fighter","base attack bonus +1","Halfling"]
    }
  },
  "desperate_battler" : {
    "_name" : "Desperate Battler",
    "_description" : "When no ally is within 10 feet of you and you are not receiving benefits from the aid another action, you gain a +1 morale bonus on melee attack and damage rolls.",
    "_icon" : "",
    "+feats.desperate_battler" : {
      "_name" : "Desperate Battler",
      "_description" : "When no ally is within 10 feet of you and you are not receiving benefits from the aid another action, you gain a +1 morale bonus on melee attack and damage rolls.",
      "_icon" : "",
      "_requires" : [""]
    }
  },
  "destroyers_blessing" : {
    "_name" : "Destroyer's Blessing",
    "_description" : "When you are raging and you succeed at a sunder combat maneuver, you regain 1 round of rage. If the sunder attempt causes the object to gain the broken condition, you heal 1 hit point. You can only gain these benefits once per round.",
    "_icon" : "",
    "+feats.destroyers_blessing" : {
      "_name" : "Destroyer's Blessing",
      "_description" : "When you are raging and you succeed at a sunder combat maneuver, you regain 1 round of rage. If the sunder attempt causes the object to gain the broken condition, you heal 1 hit point. You can only gain these benefits once per round.",
      "_icon" : "",
      "_requires" : ["Half-Orc or Orc","Rage class feature"]
    }
  },
  "destructive_persuasion" : {
    "_name" : "Destructive Persuasion",
    "_description" : "As a standard action, you can attempt to smash an unattended inanimate object while attempting an Intimidate check (see Smashing an Object). If you break the object, you gain a bonus to the Intimidate check equal to half its hardness (minimum +1). If you destroy the object, the bonus is equal to its hardness (minimum +1). Creatures intimidated by this feat cannot be affected by it again for 24 hours.",
    "_icon" : "",
    "+feats.destructive_persuasion" : {
      "_name" : "Destructive Persuasion",
      "_description" : "As a standard action, you can attempt to smash an unattended inanimate object while attempting an Intimidate check (see Smashing an Object). If you break the object, you gain a bonus to the Intimidate check equal to half its hardness (minimum +1). If you destroy the object, the bonus is equal to its hardness (minimum +1). Creatures intimidated by this feat cannot be affected by it again for 24 hours.",
      "_icon" : "",
      "_requires" : ["Strength 13","Power Attack","Intimidate rank 1"]
    }
  },
  "devastating_strike" : {
    "_name" : "Devastating Strike",
    "_description" : "Whenever you use Vital Strike, Improved Vital Strike, or Greater Vital Strike, you gain a +2 bonus on each extra weapon damage dice roll those feats grant (+6 maximum). This bonus damage is multiplied on a critical hit.",
    "_icon" : "",
    "+feats.devastating_strike" : {
      "_name" : "Devastating Strike",
      "_description" : "Whenever you use Vital Strike, Improved Vital Strike, or Greater Vital Strike, you gain a +2 bonus on each extra weapon damage dice roll those feats grant (+6 maximum). This bonus damage is multiplied on a critical hit.",
      "_icon" : "",
      "_requires" : ["Vital Strike","base attack bonus +9"]
    }
  },
  "improved_devastating_strike" : {
    "_name" : "Improved Devastating Strike",
    "_description" : "Whenever you use Vital Strike, Improved Vital Strike, or Greater Vital Strike, you gain a bonus on attack rolls to confirm a critical hit equal to the bonus on damage rolls you gain from Devastating Strike.",
    "_icon" : "",
    "+feats.improved_devastating_strike" : {
      "_name" : "Improved Devastating Strike",
      "_description" : "Whenever you use Vital Strike, Improved Vital Strike, or Greater Vital Strike, you gain a bonus on attack rolls to confirm a critical hit equal to the bonus on damage rolls you gain from Devastating Strike.",
      "_icon" : "",
      "_requires" : ["Devastating Strike","Vital Strike","base attack bonus +13"]
    }
  },
  "disconcerting_stare" : {
    "_name" : "Disconcerting Stare",
    "_description" : "When you trigger your painful stare, the target must succeed at a Will save (DC = 10 + 1/2 your mesmerist level + your Charisma modifier) or take a –6 penalty on Disable Device and Perception checks and a –2 penalty on Reflex saves for the next minute. If the target has the trap finding or trap sense class ability and fails this save, the target also loses the benefit of that ability (or abilities) for 1 minute.",
    "_icon" : "",
    "+feats.disconcerting_stare" : {
      "_name" : "Disconcerting Stare",
      "_description" : "When you trigger your painful stare, the target must succeed at a Will save (DC = 10 + 1/2 your mesmerist level + your Charisma modifier) or take a –6 penalty on Disable Device and Perception checks and a –2 penalty on Reflex saves for the next minute. If the target has the trap finding or trap sense class ability and fails this save, the target also loses the benefit of that ability (or abilities) for 1 minute.",
      "_icon" : "",
      "_requires" : ["Mesmerist level 5","Painful Stare class feature"]
    }
  },
  "dimensional_awareness" : {
    "_name" : "Dimensional Awareness",
    "_description" : "If a summoned or called creature materializes in a space you threaten, you can make an attack of opportunity against that creature before it acts, gaining a +2 circumstance bonus on the attack roll if you successfully identified the spell used to summon or call that creature.",
    "_icon" : "",
    "+feats.dimensional_awareness" : {
      "_name" : "Dimensional Awareness",
      "_description" : "If a summoned or called creature materializes in a space you threaten, you can make an attack of opportunity against that creature before it acts, gaining a +2 circumstance bonus on the attack roll if you successfully identified the spell used to summon or call that creature.",
      "_icon" : "",
      "_requires" : ["Arcane Strike or Disruptive","Banishing Critical","Combat Reflexes","Spellcraft rank 8","Arcane Pool class feature"]
    }
  },
  "dimensional_disruption" : {
    "_name" : "Dimensional Disruption",
    "_description" : "When you use Dimensional Awareness to make an attack of opportunity against a creature being summoned or called into a square you threaten, you can additionally use an immediate action to attempt to send the creature back to its home plane. Attempt a Spellcraft check (DC = 15 + the creature’s CR [minimum 1] + the spell level of the spell that summoned the creature). If you succeed, the creature does not get to act and is immediately sent back to its home plane.",
    "_icon" : "",
    "+feats.dimensional_disruption" : {
      "_name" : "Dimensional Disruption",
      "_description" : "When you use Dimensional Awareness to make an attack of opportunity against a creature being summoned or called into a square you threaten, you can additionally use an immediate action to attempt to send the creature back to its home plane. Attempt a Spellcraft check (DC = 15 + the creature’s CR [minimum 1] + the spell level of the spell that summoned the creature). If you succeed, the creature does not get to act and is immediately sent back to its home plane.",
      "_icon" : "",
      "_requires" : ["Arcane Strike or Disruptive","Banishing Critical","Combat Reflexes","Dimensional Awareness","Spellcraft rank 8","Arcane Pool class feature"]
    }
  },
  "dirty_trick_maneuvers" : {
    "_name" : "Dirty Trick",
    "_description" : "You can attempt to hinder a foe in melee as a standard action. This maneuver covers any sort of situational attack that imposes a penalty on a foe for a short period of time. Examples include kicking sand into an opponent’s face to blind him for 1 round, pulling down an enemy’s pants to halve his speed, or hitting a foe in a sensitive spot to make him sickened for a round. The GM is the arbiter of what can be accomplished with this maneuver, but it cannot be used to impose a permanent penalty, and the results can be undone if the target spends a move action. If you do not have the Improved Dirty Trick feat or a similar ability, attempting a dirty trick provokes an attack of opportunity from the target of your maneuver. If your attack is successful, the target takes a penalty. The penalty is limited to one of the following conditions: blinded, dazzled, deafened, entangled, shaken, or sickened. This condition lasts for 1 round. For every 5 by which your attack exceeds your opponent’s CMD, the penalty lasts 1 additional round. This penalty can usually be removed if the target spends a move action. If you possess the Greater Dirty Trick feat, the penalty lasts for 1d4 rounds, plus 1 round for every 5 by which your attack exceeds your opponent’s CMD. In addition, removing the condition requires the target to spend a standard action.",
    "_icon" : "",
    "+feats.dirty_trick" : {
      "_name" : "Dirty Trick",
      "_description" : "You can attempt to hinder a foe in melee as a standard action. This maneuver covers any sort of situational attack that imposes a penalty on a foe for a short period of time. Examples include kicking sand into an opponent’s face to blind him for 1 round, pulling down an enemy’s pants to halve his speed, or hitting a foe in a sensitive spot to make him sickened for a round. The GM is the arbiter of what can be accomplished with this maneuver, but it cannot be used to impose a permanent penalty, and the results can be undone if the target spends a move action. If you do not have the Improved Dirty Trick feat or a similar ability, attempting a dirty trick provokes an attack of opportunity from the target of your maneuver. If your attack is successful, the target takes a penalty. The penalty is limited to one of the following conditions: blinded, dazzled, deafened, entangled, shaken, or sickened. This condition lasts for 1 round. For every 5 by which your attack exceeds your opponent’s CMD, the penalty lasts 1 additional round. This penalty can usually be removed if the target spends a move action. If you possess the Greater Dirty Trick feat, the penalty lasts for 1d4 rounds, plus 1 round for every 5 by which your attack exceeds your opponent’s CMD. In addition, removing the condition requires the target to spend a standard action.",
      "_icon" : "",
      "_requires" : [""]
    }
  },
  "improved_dirty_trick" : {
    "_name" : "Improved Dirty Trick",
    "_description" : "You do not provoke an attack of opportunity when performing a dirty trick combat maneuver. In addition, you receive a +2 bonus on checks made to attempt a dirty trick. You also receive a +2 bonus to your Combat Maneuver Defense when an opponent tries a dirty trick on you.",
    "_icon" : "",
    "+feats.improved_dirty_trick" : {
      "_name" : "Improved Dirty Trick",
      "_description" : "You do not provoke an attack of opportunity when performing a dirty trick combat maneuver. In addition, you receive a +2 bonus on checks made to attempt a dirty trick. You also receive a +2 bonus to your Combat Maneuver Defense when an opponent tries a dirty trick on you.",
      "_icon" : "",
      "_requires" : ["Intelligence 13","Combat Expertise"]
    }
  },
  "greater_dirty_trick" : {
    "_name" : "Greater Dirty Trick",
    "_description" : "You receive a +2 bonus on checks made to attempt a dirty trick. This bonus stacks with the bonus granted by Improved Dirty Trick. Whenever you successfully perform a dirty trick, the penalty lasts for 1d4 rounds, plus 1 round for every 5 by which your attack exceeds the target’s CMD. In addition, removing the condition requires the target to spend a standard action.",
    "_icon" : "",
    "+feats.greater_dirty_trick" : {
      "_name" : "Greater Dirty Trick",
      "_description" : "You receive a +2 bonus on checks made to attempt a dirty trick. This bonus stacks with the bonus granted by Improved Dirty Trick. Whenever you successfully perform a dirty trick, the penalty lasts for 1d4 rounds, plus 1 round for every 5 by which your attack exceeds the target’s CMD. In addition, removing the condition requires the target to spend a standard action.",
      "_icon" : "",
      "_requires" : ["Intelligence 13","Combat Expertise","Improved Dirty Trick","base attack bonus +6"]
    }
  },
  "dirty_trick_master" : {
    "_name" : "Dirty Trick Master",
    "_description" : "Whenever you successfully perform a dirty trick combat maneuver against an opponent who is still affected by a condition inflicted by a previous dirty trick (whether your own or another creature’s), you can cause the condition to worsen. In addition to increasing the duration of the condition as normal, you cause an opponent who is dazzled to become dazed, entangled to become pinned, shaken to become frightened, and sickened to become nauseated. This worsened condition replaces the previous dirty trick condition, and lasts for the duration of the dirty trick (including any rounds remaining from the previous dirty trick condition) or until the opponent uses a standard action to remove the condition (whichever comes first).",
    "_icon" : "",
    "+feats.dirty_trick_master" : {
      "_name" : "Dirty Trick Master",
      "_description" : "Whenever you successfully perform a dirty trick combat maneuver against an opponent who is still affected by a condition inflicted by a previous dirty trick (whether your own or another creature’s), you can cause the condition to worsen. In addition to increasing the duration of the condition as normal, you cause an opponent who is dazzled to become dazed, entangled to become pinned, shaken to become frightened, and sickened to become nauseated. This worsened condition replaces the previous dirty trick condition, and lasts for the duration of the dirty trick (including any rounds remaining from the previous dirty trick condition) or until the opponent uses a standard action to remove the condition (whichever comes first).",
      "_icon" : "",
      "_requires" : ["Greater Dirty Trick","Improved Dirty Trick","base attack bonus +11"]
    }
  },
  "disarm_maneuvers" : {
    "_name" : "Disarm",
    "_description" : "You can attempt to disarm your opponent in place of a melee attack. If you do not have the Improved Disarm feat, or a similar ability, attempting to disarm a foe provokes an attack of opportunity from the target of your maneuver. Attempting to disarm a foe while unarmed imposes a –4 penalty on the attack. If your attack is successful, your target drops one item it is carrying of your choice (even if the item is wielded with two hands). If your attack exceeds the CMD of the target by 10 or more, the target drops the items it is carrying in both hands (maximum two items if the target has more than two hands). If your attack fails by 10 or more, you drop the weapon that you were using to attempt the disarm. If you successfully disarm your opponent without using a weapon, you may automatically pick up the item dropped.",
    "_icon" : "",
    "+feats.disarm_maneuvers" : {
      "_name" : "Disarm",
      "_description" : "You can attempt to disarm your opponent in place of a melee attack. If you do not have the Improved Disarm feat, or a similar ability, attempting to disarm a foe provokes an attack of opportunity from the target of your maneuver. Attempting to disarm a foe while unarmed imposes a –4 penalty on the attack. If your attack is successful, your target drops one item it is carrying of your choice (even if the item is wielded with two hands). If your attack exceeds the CMD of the target by 10 or more, the target drops the items it is carrying in both hands (maximum two items if the target has more than two hands). If your attack fails by 10 or more, you drop the weapon that you were using to attempt the disarm. If you successfully disarm your opponent without using a weapon, you may automatically pick up the item dropped.",
      "_icon" : "",
      "_requires" : [""]
    }
  },
  "improved_disarm" : {
    "_name" : "Improved Disarm",
    "_description" : "You do not provoke an attack of opportunity when performing a disarm combat maneuver. In addition, you receive a +2 bonus on checks made to disarm a foe. You also receive a +2 bonus to your Combat Maneuver Defense whenever an opponent tries to disarm you.",
    "_icon" : "",
    "+feats.improved_disarm" : {
      "_name" : "Improved Disarm",
      "_description" : "You do not provoke an attack of opportunity when performing a disarm combat maneuver. In addition, you receive a +2 bonus on checks made to disarm a foe. You also receive a +2 bonus to your Combat Maneuver Defense whenever an opponent tries to disarm you.",
      "_icon" : "",
      "_requires" : ["Intelligence 13","Combat Expertise"]
    }
  },
  "greater_disarm" : {
    "_name" : "Greater Disarm",
    "_description" : "You receive a +2 bonus on combat maneuver checks made to disarm a foe. This bonus stacks with the bonus granted by Improved Disarm. Whenever you successfully disarm an opponent, the weapon lands 15 feet away from its previous wielder, in a random direction.",
    "_icon" : "",
    "+feats.greater_disarm" : {
      "_name" : "Greater Disarm",
      "_description" : "You receive a +2 bonus on combat maneuver checks made to disarm a foe. This bonus stacks with the bonus granted by Improved Disarm. Whenever you successfully disarm an opponent, the weapon lands 15 feet away from its previous wielder, in a random direction.",
      "_icon" : "",
      "_requires" : ["Intelligence 13","Combat Expertise","Improved Disarm","base attack bonus +6"]
    }
  },
  "directed_disarm" : {
    "_name" : "Directed Disarm",
    "_description" : "Whenever you successfully use a combat maneuver to disarm an opponent, the disarmed weapon lands up to 15 feet away from its wielder, in the direction you choose. Alternatively, you can make a ranged attack as an immediate action with the disarmed weapon against another opponent, as long as the disarmed weapon is a light or one-handed weapon. If the weapon is not a thrown weapon, you take a –4 penalty on the attack roll. You take a –4 penalty on your attack roll if you do not have a free hand.",
    "_icon" : "",
    "+feats.directed_disarm" : {
      "_name" : "Directed Disarm",
      "_description" : "Whenever you successfully use a combat maneuver to disarm an opponent, the disarmed weapon lands up to 15 feet away from its wielder, in the direction you choose. Alternatively, you can make a ranged attack as an immediate action with the disarmed weapon against another opponent, as long as the disarmed weapon is a light or one-handed weapon. If the weapon is not a thrown weapon, you take a –4 penalty on the attack roll. You take a –4 penalty on your attack roll if you do not have a free hand.",
      "_icon" : "",
      "_requires" : ["Intelligence 13","Combat Expertise","Greater Disarm","Improved Disarm","base attack bonus +11"]
    }
  },
  "disarming_strike" : {
    "_name" : "Disarming Strike",
    "_description" : "Whenever you score a critical hit with a melee attack, you can disarm your opponent, in addition to the normal damage dealt by the attack. If your confirmation roll exceeds your opponent’s CMD, you may disarm your opponent as if from the disarm combat maneuver. This does not provoke an attack of opportunity.",
    "_icon" : "",
    "+feats.disarming_strike" : {
      "_name" : "Disarming Strike",
      "_description" : "Whenever you score a critical hit with a melee attack, you can disarm your opponent, in addition to the normal damage dealt by the attack. If your confirmation roll exceeds your opponent’s CMD, you may disarm your opponent as if from the disarm combat maneuver. This does not provoke an attack of opportunity. You can only apply the effects of one of the following feats to a given critical hit: Bull Rush Strike, Disarming Strike, Repositioning Strike, Sundering Strike, or Tripping Strike. You may choose to use this feat after you make your confirmation roll.",
      "_icon" : "",
      "_requires" : ["Intelligence 13","Combat Expertise","Improved Disarm","base attack bonus +9"]
    }
  },
  "disengaging_feint" : {
    "_name" : "Disengaging Feint",
    "_description" : "As a standard action, use Bluff to feint against an opponent. Instead of denying that opponent his Dexterity bonus to AC, a successful feint allows you to move up to your speed without provoking an attack of opportunity from the opponent you feinted for leaving the square you start in.",
    "_icon" : "",
    "+feats.disengaging_feint" : {
      "_name" : "Disengaging Feint",
      "_description" : "As a standard action, use Bluff to feint against an opponent. Instead of denying that opponent his Dexterity bonus to AC, a successful feint allows you to move up to your speed without provoking an attack of opportunity from the opponent you feinted for leaving the square you start in.",
      "_icon" : "",
      "_requires" : ["Intelligence 13","Combat Expertise","Improved Feint"]
    }
  },
  "disengaging_shot" : {
    "_name" : "Disengaging Shot",
    "_description" : "Whenever you use Disengaging Feint or Disengaging Flourish, you can make a single melee attack against one opponent you succeeded at feinting against. That opponent is denied his Dexterity bonus to AC against this attack.",
    "_icon" : "",
    "+feats.disengaging_shot" : {
      "_name" : "Disengaging Shot",
      "_description" : "Whenever you use Disengaging Feint or Disengaging Flourish, you can make a single melee attack against one opponent you succeeded at feinting against. That opponent is denied his Dexterity bonus to AC against this attack.",
      "_icon" : "",
      "_requires" : ["Intelligence 13","Combat Expertise","Disengaging Feint","Dodge","Improved Feint","Mobility"]
    }
  },
  "disheartening_display" : {
    "_name" : "Disheartening Display",
    "_description" : "When you successfully use Dazzling Display against any shaken, frightened, or panicked opponents, their fear increases by one step. An already panicked creature demoralized by this feat cowers. Once affected by this feat, a creature cannot be affected by it again (by you or anyone else) for 24 hours.",
    "_icon" : "",
    "+feats.disheartening_display" : {
      "_name" : "Disheartening Display",
      "_description" : "When you successfully use Dazzling Display against any shaken, frightened, or panicked opponents, their fear increases by one step. An already panicked creature demoralized by this feat cowers. Once affected by this feat, a creature cannot be affected by it again (by you or anyone else) for 24 hours.",
      "_icon" : "",
      "_requires" : ["Dazzling Display","Weapon Focus","Base Attack Bonus +6","Proficiency with chosen weapon"]
    }
  },
  "disorienting_blow" : {
    "_name" : "Disorienting Blow",
    "_description" : "You must choose to use this ability before making an attack roll with your Stunning Fist, and this effect replaces other effects or conditions that would be caused by Stunning Fist. If you successfully hit your opponent and it fails its Fortitude save, it becomes confused for 1 round. Additional disorienting blows to the confused target add to the duration of its confusion. This feat is otherwise subject to all of the limits and conditions of Stunning Fist.",
    "_icon" : "",
    "+feats.disorienting_blow" : {
      "_name" : "Disorienting Blow",
      "_description" : "You must choose to use this ability before making an attack roll with your Stunning Fist, and this effect replaces other effects or conditions that would be caused by Stunning Fist. If you successfully hit your opponent and it fails its Fortitude save, it becomes confused for 1 round. Additional disorienting blows to the confused target add to the duration of its confusion. This feat is otherwise subject to all of the limits and conditions of Stunning Fist.",
      "_icon" : "",
      "_requires" : ["Stunning Fist","Base Attack Bonus +11"]
    }
  },
  "dispelling_critical" : {
    "_name" : "Dispelling Critical",
    "_description" : "If you have dispel magic prepared or can cast it spontaneously, when you score a critical hit against an opponent, you may use a swift action to cast dispel magic to make a targeted dispel against that opponent.",
    "_icon" : "",
    "+feats.dispelling_critical" : {
      "_name" : "Dispelling Critical",
      "_description" : "If you have dispel magic prepared or can cast it spontaneously, when you score a critical hit against an opponent, you may use a swift action to cast dispel magic to make a targeted dispel against that opponent.",
      "_icon" : "",
      "_requires" : ["Arcane Strike","Base Attack Bonus +11","ability to cast dispel magic"]
    }
  },
  "disrupting_shot" : {
    "_name" : "Disrupting Shot",
    "_description" : "If you ready an action to shoot an opponent casting a spell within 30 feet and successfully hit that opponent with a ranged attack, the concentration DC to successfully cast the spell is increased by +4.",
    "_icon" : "",
    "+feats.disrupting_shot" : {
      "_name" : "Disrupting Shot",
      "_description" : "If you ready an action to shoot an opponent casting a spell within 30 feet and successfully hit that opponent with a ranged attack, the concentration DC to successfully cast the spell is increased by +4.",
      "_icon" : "",
      "_requires" : ["Dexterity 13","Point-Blank Shot","Fighter level 6"]
    }
  },
  "disruptive" : {
    "_name" : "Disruptive",
    "_description" : "The DC to cast spells defensively increases by +4 for all enemies that are within your threatened area. This increase to casting spells defensively only applies if you are aware of the enemy’s location and are capable of taking an attack of opportunity. If you can only take one attack of opportunity per round and have already used that attack, this increase does not apply.",
    "_icon" : "",
    "+feats.disruptive" : {
      "_name" : "Disruptive",
      "_description" : "The DC to cast spells defensively increases by +4 for all enemies that are within your threatened area. This increase to casting spells defensively only applies if you are aware of the enemy’s location and are capable of taking an attack of opportunity. If you can only take one attack of opportunity per round and have already used that attack, this increase does not apply.",
      "_icon" : "",
      "_requires" : ["Fighter level 6"]
    }
  },
  "disrupting_fist" : {
    "_name" : "Disrupting Fist",
    "_description" : "On a confirmed critical hit using an unarmed strike against an undead creature, you can expend two uses of your channel energy ability as a swift action to destroy that undead creature. The undead creature can negate this effect with a successful Will saving throw (DC = 10 + your base attack bonus).",
    "_icon" : "",
    "+feats.disrupting_fist" : {
      "_name" : "Disrupting Fist",
      "_description" : "On a confirmed critical hit using an unarmed strike against an undead creature, you can expend two uses of your channel energy ability as a swift action to destroy that undead creature. The undead creature can negate this effect with a successful Will saving throw (DC = 10 + your base attack bonus).",
      "_icon" : "",
      "_requires" : ["Channel Smite","Improved Unarmed Strike","Base Attack Bonus +9","Channel Positive Energy 4d6"]
    }
  },
  "distance_thrower" : {
    "_name" : "Distance Thrower",
    "_description" : "With a thrown weapon, you reduce your penalty on ranged attack rolls due to range by 2.",
    "_icon" : "",
    "+feats.distance_thrower" : {
      "_name" : "Distance Thrower",
      "_description" : "With a thrown weapon, you reduce your penalty on ranged attack rolls due to range by 2.",
      "_icon" : "",
      "_requires" : ["Strength 13"]
    }
  },
  "distracting_charge" : {
    "_name" : "Distracting Charge",
    "_description" : "When your ally with this feat uses the charge action and hits, you gain a +2 bonus on your next attack roll against the target of that charge. This bonus must be used before your ally’s next turn, or it is lost.",
    "_icon" : "",
    "+feats.distracting_charge" : {
      "_name" : "Distracting Charge",
      "_description" : "When your ally with this feat uses the charge action and hits, you gain a +2 bonus on your next attack roll against the target of that charge. This bonus must be used before your ally’s next turn, or it is lost.",
      "_icon" : "",
      "_requires" : [""]
    }
  },
  "divert_harm" : {
    "_name" : "Divert Harm",
    "_description" : "Whenever you are the target of an area-of-effect attack that normally deals half damage on a successful Reflex save (such as a fireball spell or dragon’s breath weapon), you may, as an immediate action, wrestle an adjacent foe into harm’s way. This does not alter the position of you or your opponent, but your opponent must attempt a Reflex save against the attack in your place. If your opponent fails, it takes half damage from the attack and you take none; if it succeeds, it takes no damage and you take damage as normal as though you’d failed your saving throw (though this damage is still reduced by abilities such as improved evasion). This feat works even if the opponent was already in the affected area of the attack (so it is possible that an unlucky opponent could take as much as 1-1/2 times the damage normally possible from the attack). You can use this ability only on a foe within one size category of yourself.",
    "_icon" : "",
    "+feats.divert_harm" : {
      "_name" : "Divert Harm",
      "_description" : "Whenever you are the target of an area-of-effect attack that normally deals half damage on a successful Reflex save (such as a fireball spell or dragon’s breath weapon), you may, as an immediate action, wrestle an adjacent foe into harm’s way. This does not alter the position of you or your opponent, but your opponent must attempt a Reflex save against the attack in your place. If your opponent fails, it takes half damage from the attack and you take none; if it succeeds, it takes no damage and you take damage as normal as though you’d failed your saving throw (though this damage is still reduced by abilities such as improved evasion). This feat works even if the opponent was already in the affected area of the attack (so it is possible that an unlucky opponent could take as much as 1-1/2 times the damage normally possible from the attack). You can use this ability only on a foe within one size category of yourself.",
      "_icon" : "",
      "_requires" : ["Intelligence 13","Combat Expertise","Base Attack Bonus +6","Evasion class feature"]
    }
  },
  "divine_fighting_technique" : {
    "_name" : "Divine Fighting Technique",
    "_description" : "Divine fighting techniques emulate the martial supremacy and approach to combat of certain gods, but do not generally require users’ interests and goals to be aligned with the techniques’ associated deities. Although each deity’s divine fighting technique is primarily preserved and passed on by her faithful, worship is not required to learn one. Instead, these fighting styles simply require a certain manner of looking at the world and specific combat training. A god’s divine fighting technique has an initial benefit as well as an advanced benefit available only if you meet certain prerequisites. Any adventurer can learn a divine fighting technique by taking the Divine Fighting Technique feat. A cleric, inquisitor, or warpriest who worships a deity can always choose to give up either the first power of one of her domains or a minor blessing benefit to gain access to that god’s divine fighting technique without having to meet the Divine Fighting Techniques technique’s prerequisites (including the Divine Fighting Technique feat). In addition, a warpriest can always give up a major blessing to gain the advanced benefit without meeting its prerequisite. In a few cases, other classes can gain the benefits by sacrificing class features, as noted in the appropriate divine fighting techniques.",
    "_icon" : "",
    "+feats.divine_fighting_technique" : {
      "_name" : "Divine Fighting Technique",
      "_description" : "Divine fighting techniques emulate the martial supremacy and approach to combat of certain gods, but do not generally require users’ interests and goals to be aligned with the techniques’ associated deities. Although each deity’s divine fighting technique is primarily preserved and passed on by her faithful, worship is not required to learn one. Instead, these fighting styles simply require a certain manner of looking at the world and specific combat training. A god’s divine fighting technique has an initial benefit as well as an advanced benefit available only if you meet certain prerequisites. Any adventurer can learn a divine fighting technique by taking the Divine Fighting Technique feat. A cleric, inquisitor, or warpriest who worships a deity can always choose to give up either the first power of one of her domains or a minor blessing benefit to gain access to that god’s divine fighting technique without having to meet the Divine Fighting Techniques technique’s prerequisites (including the Divine Fighting Technique feat). In addition, a warpriest can always give up a major blessing to gain the advanced benefit without meeting its prerequisite. In a few cases, other classes can gain the benefits by sacrificing class features, as noted in the appropriate divine fighting techniques.",
      "_icon" : "",
      "_requires" : [""]
    }
  },
  "divine_assault" : {
    "_name" : "Divine Assault",
    "_description" : "You gain a +2 bonus on saving throws against divine spells and effects and abilities from outsiders. If you must attempt a saving throw against a divine spell, you gain a +1 bonus on attack rolls against the creature that cast the spell.",
    "_icon" : "",
    "+feats.divine_assault" : {
      "_name" : "Divine Assault",
      "_description" : "You gain a +2 bonus on saving throws against divine spells and effects and abilities from outsiders. If you must attempt a saving throw against a divine spell, you gain a +1 bonus on attack rolls against the creature that cast the spell.",
      "_icon" : "",
      "_requires" : ["Bluff rank 1","Knowledge: Religion rank 1","Pure Legion Recruit trait"]
    }
  },
  "dodge" : {
    "_name" : "Dodge",
    "_description" : "You gain a +1 dodge bonus to your AC. A condition that makes you lose your Dex bonus to AC also makes you lose the benefits of this feat.",
    "_icon" : "",
    "+feats.dodge" : {
      "_name" : "Dodge",
      "_description" : "You gain a +1 dodge bonus to your AC. A condition that makes you lose your Dex bonus to AC also makes you lose the benefits of this feat.",
      "_icon" : "",
      "_requires" : ["Dexterity 13"]
    }
  },
  "domain_strike" : {
    "_name" : "Domain Strike",
    "_description" : "When you gain this feat, choose one domain-granted power that you can use to affect no more than one opponent. If you make a successful unarmed strike against an opponent, in addition to dealing your unarmed strike damage, you can use a swift action to deliver the effects of the chosen granted power to that opponent. Doing so provokes no attacks of opportunity.",
    "_icon" : "",
    "+feats.domain_strike" : {
      "_name" : "Domain Strike",
      "_description" : "When you gain this feat, choose one domain-granted power that you can use to affect no more than one opponent. If you make a successful unarmed strike against an opponent, in addition to dealing your unarmed strike damage, you can use a swift action to deliver the effects of the chosen granted power to that opponent. Doing so provokes no attacks of opportunity. You can take this feat multiple times. Each time you take it, you apply it to a different qualifying domain power.",
      "_icon" : "",
      "_requires" : ["Domain class feature","Improved Unarmed Strike"]
    }
  },
  "chain_fail_master" : {
    "_name" : "Chain Flail Master",
    "_description" : "You can use a chain-flail as a one-handed weapon. When using it one-handed, changing whether it’s a normal or reach weapon is a full-round action. If you have the Darting Viper feat, changing its reach is a move action.",
    "_icon" : "",
    "+feats.chain_flail_master" : {
      "_name" : "Chain-Flail Master",
      "_description" : "You can use a chain-flail as a one-handed weapon. When using it one-handed, changing whether it’s a normal or reach weapon is a full-round action. If you have the Darting Viper feat, changing its reach is a move action.",
      "_icon" : "",
      "_requires" : ["Two-Weapon Fighting","Base Attack Bonus +4","Proficiency with the Dwarven Chain-Flail"]
    }
  },
  "double_slice" : {
    "_name" : "Double Slice",
    "_description" : "Add your Strength bonus to damage rolls made with your off-hand weapon.",
    "_icon" : "",
    "+feats.double_slice" : {
      "_name" : "Double Slice",
      "_description" : "Add your Strength bonus to damage rolls made with your off-hand weapon.",
      "_icon" : "",
      "_requires" : ["Two-Weapon Fighting","Dexterity 15"]
    }
  },
  "drag_down" : {
    "_name" : "Drag Down",
    "_description" : "Whenever an opponent successfully trips you, you can attempt to trip that opponent as an immediate action.",
    "_icon" : "",
    "+feats.drag_down" : {
      "_name" : "Drag Down",
      "_description" : "Whenever an opponent successfully trips you, you can attempt to trip that opponent as an immediate action.",
      "_icon" : "",
      "_requires" : ["Intelligence 13","Combat Expertise","Improved Trip"]
    }
  },
  "drag_maneuvers" : {
    "_name" : "Drag Maneuvers",
    "_description" : "You can attempt to drag a foe as a standard action. You can only drag an opponent who is no more than one size category larger than you. The aim of this maneuver is to drag a foe in a straight line behind you without doing any harm. If you do not have the Improved Drag feat or a similar ability, initiating a drag provokes an attack of opportunity from the target of your maneuver. If your attack is successful, both you and your target are moved 5 feet back, with your opponent occupying your original space and you in the space behind that in a straight line. For every 5 by which your attack exceeds your opponent’s CMD, you can drag the target back an additional 5 feet. You must be able to move with the target to perform this maneuver. If you do not have enough movement, the drag goes to the maximum amount of movement available to you and ends. An enemy being moved by a drag does not provoke an attack of opportunity because of the movement unless you possess the Greater Drag feat. You cannot move a creature into a square that is occupied by a solid object or obstacle. If there is another creature in the way of your movement, the drag ends adjacent to that creature.",
    "_icon" : "",
    "+feats.drag_maneuvers" : {
      "_name" : "Drag Maneuvers",
      "_description" : "You can attempt to drag a foe as a standard action. You can only drag an opponent who is no more than one size category larger than you. The aim of this maneuver is to drag a foe in a straight line behind you without doing any harm. If you do not have the Improved Drag feat or a similar ability, initiating a drag provokes an attack of opportunity from the target of your maneuver. If your attack is successful, both you and your target are moved 5 feet back, with your opponent occupying your original space and you in the space behind that in a straight line. For every 5 by which your attack exceeds your opponent’s CMD, you can drag the target back an additional 5 feet. You must be able to move with the target to perform this maneuver. If you do not have enough movement, the drag goes to the maximum amount of movement available to you and ends. An enemy being moved by a drag does not provoke an attack of opportunity because of the movement unless you possess the Greater Drag feat. You cannot move a creature into a square that is occupied by a solid object or obstacle. If there is another creature in the way of your movement, the drag ends adjacent to that creature.",
      "_icon" : "",
      "_requires" : [""]
    }
  },
  "improved_drag" : {
    "_name" : "Improved Drag",
    "_description" : "You do not provoke an attack of opportunity when performing a drag combat maneuver. In addition, you receive a +2 bonus on checks made to drag a foe. You also receive a +2 bonus to your Combat Maneuver Defense when an opponent tries to drag you.",
    "_icon" : "",
    "+feats.improved_drag" : {
      "_name" : "Improved Drag",
      "_description" : "You do not provoke an attack of opportunity when performing a drag combat maneuver. In addition, you receive a +2 bonus on checks made to drag a foe. You also receive a +2 bonus to your Combat Maneuver Defense when an opponent tries to drag you.",
      "_icon" : "",
      "_requires" : ["Strength 13","Power Attack","Base Attack Bonus +1"]
    }
  },
  "greater_drag" : {
    "_name" : "Greater Drag",
    "_description" : "You receive a +2 bonus on checks made to drag a foe. This bonus stacks with the bonus granted by Improved Drag. Whenever you drag a foe, his movement provokes attacks of opportunity from all of your allies (but not you).",
    "_icon" : "",
    "+feats.greater_drag" : {
      "_name" : "Greater Drag",
      "_description" : "You receive a +2 bonus on checks made to drag a foe. This bonus stacks with the bonus granted by Improved Drag. Whenever you drag a foe, his movement provokes attacks of opportunity from all of your allies (but not you).",
      "_icon" : "",
      "_requires" : ["Strength 13","Improved Drag","Power Attack","Base Attack Bonus +6"]
    }
  },
  "dragon_style" : {
    "_name" : "Dragon Style",
    "_description" : "While using this style, you gain a +2 bonus on saving throws against sleep effects, paralysis effects, and stunning effects. You ignore difficult terrain when you charge, run, or withdraw. You can also charge through squares that contain allies. Further, you can add 1-1/2 times your Strength bonus on the damage roll for your first unarmed strike on a given round.",
    "_icon" : "",
    "+feats.dragon_style" : {
      "_name" : "Dragon Style",
      "_description" : "While using this style, you gain a +2 bonus on saving throws against sleep effects, paralysis effects, and stunning effects. You ignore difficult terrain when you charge, run, or withdraw. You can also charge through squares that contain allies. Further, you can add 1-1/2 times your Strength bonus on the damage roll for your first unarmed strike on a given round.",
      "_icon" : "",
      "_requires" : ["Strength 15","Improved Unarmed Strike","Acrobatics rank 3"]
    }
  },
  "draining_strike" : {
    "_name" : "Draining Strike",
    "_description" : "You must declare that you are using this feat before you make your attack roll (thus, a failed attack roll ruins the attempt). Draining Strike forces a foe that was damaged by your unarmed attack to attempt a Fortitude saving throw (DC = 10 + 1/2 your character level + your Wisdom modifier), in addition to dealing damage normally. A defender who fails this saving throw is fatigued for 1 minute or until the foe is subject to any spell or effect that heals hit point damage any spell that deals hit point damage . If you have a base attack bonus of +14 or higher, the target is exhausted for the same duration instead. You can attempt to use Draining Strike once per day for every 4 character levels you have, but you can use it no more than once per round. Constructs, incorporeal creatures, plants, undead, and creatures that are immune to critical hits cannot be affected by this ability.",
    "_icon" : "",
    "+feats.draining_strike" : {
      "_name" : "Draining Strike",
      "_description" : "You must declare that you are using this feat before you make your attack roll (thus, a failed attack roll ruins the attempt). Draining Strike forces a foe that was damaged by your unarmed attack to attempt a Fortitude saving throw (DC = 10 + 1/2 your character level + your Wisdom modifier), in addition to dealing damage normally. A defender who fails this saving throw is fatigued for 1 minute or until the foe is subject to any spell or effect that heals hit point damage any spell that deals hit point damage . If you have a base attack bonus of +14 or higher, the target is exhausted for the same duration instead. You can attempt to use Draining Strike once per day for every 4 character levels you have, but you can use it no more than once per round. Constructs, incorporeal creatures, plants, undead, and creatures that are immune to critical hits cannot be affected by this ability.",
      "_icon" : "",
      "_requires" : ["Dexterity 13","Wisdom 13","Improved Unarmed Strike","Base Attack Bonus +8"]
    }
  },
  "dreadful_carnage" : {
    "_name" : "Dreadful Carnage",
    "_description" : "Whenever you reduce an enemy to 0 or fewer hit points, you can make an Intimidate check to demoralize all enemies within 30 feet as a free action. Enemies that cannot see both you and the enemy you reduced to 0 or fewer hit points are unaffected.",
    "_icon" : "",
    "+feats.dreadful_carnage" : {
      "_name" : "Dreadful Carnage",
      "_description" : "Whenever you reduce an enemy to 0 or fewer hit points, you can make an Intimidate check to demoralize all enemies within 30 feet as a free action. Enemies that cannot see both you and the enemy you reduced to 0 or fewer hit points are unaffected.",
      "_icon" : "",
      "_requires" : ["Strength 15","Power Attack","Furious Focus","Base Attack Bonus +11"]
    }
  },
  "drunken_brawler" : {
    "_name" : "Drunken Brawler",
    "_description" : "When you drink a tankard of ale or strong alcohol, you take a –2 penalty on Reflex saving throws, but gain a number of temporary hit points equal to your character level, and gain a +2 alchemical bonus on Fortitude and Will saving throws. These bonuses last 1 hour or until the temporary hit points gained by this effect are lost, whichever occurs first. Regardless, the penalty lasts for a full hour.",
    "_icon" : "",
    "+feats.drunken_brawler" : {
      "_name" : "Drunken Brawler",
      "_description" : "When you drink a tankard of ale or strong alcohol, you take a –2 penalty on Reflex saving throws, but gain a number of temporary hit points equal to your character level, and gain a +2 alchemical bonus on Fortitude and Will saving throws. These bonuses last 1 hour or until the temporary hit points gained by this effect are lost, whichever occurs first. Regardless, the penalty lasts for a full hour.",
      "_icon" : "",
      "_requires" : ["Endurance","Worshipper of a Good Diety"]
    }
  },
  "dueling_cape_deed" : {
    "_name" : "Dueling Cape Deed",
    "_description" : "As a move action, you can wrap a cape that you’re wearing around your arm (removing it if necessary), and treat it as a buckler. If you are using the cape in this way, and an opponent misses you with a melee attack, as an immediate action you can spend 1 panache point to release your cape from your arm and entangle your foe in it. The foe can free it by using a full-round action to escape or by destroying the cape; a typical cape has hardness 1 and 3 hit points. You can use this feat with items similar in shape and weight to a cape, such as a cloak or a curtain.",
    "_icon" : "",
    "+feats.dueling_cape_deed" : {
      "_name" : "Dueling Cape Deed",
      "_description" : "As a move action, you can wrap a cape that you’re wearing around your arm (removing it if necessary), and treat it as a buckler. If you are using the cape in this way, and an opponent misses you with a melee attack, as an immediate action you can spend 1 panache point to release your cape from your arm and entangle your foe in it. The foe can free it by using a full-round action to escape or by destroying the cape; a typical cape has hardness 1 and 3 hit points. You can use this feat with items similar in shape and weight to a cape, such as a cloak or a curtain.",
      "_icon" : "",
      "_requires" : ["Dodge","Sleight of Hand rank 1"]
    }
  },
  "dueling_mastery" : {
    "_name" : "Dueling Mastery",
    "_description" : "You gain a +2 bonus on initiative checks as long as you start combat with a dueling sword in your hand. As long as you wield only a single dueling sword in one hand (not using a shield, an off-hand weapon, armor spikes, unarmed strikes, or natural weapons), you gain a +2 shield bonus to your AC. If you wield the sword in two hands, this bonus drops to a +1 shield bonus to AC. Although the dueling sword deals slashing damage, you treat it as if it were also a piercing weapon when determining the effects of weapons used by a duelist or swashbuckler.",
    "_icon" : "",
    "+feats.dueling_mastery" : {
      "_name" : "Dueling Mastery",
      "_description" : "You gain a +2 bonus on initiative checks as long as you start combat with a dueling sword in your hand. As long as you wield only a single dueling sword in one hand (not using a shield, an off-hand weapon, armor spikes, unarmed strikes, or natural weapons), you gain a +2 shield bonus to your AC. If you wield the sword in two hands, this bonus drops to a +1 shield bonus to AC. Although the dueling sword deals slashing damage, you treat it as if it were also a piercing weapon when determining the effects of weapons used by a duelist or swashbuckler.",
      "_icon" : "",
      "_requires" : ["Exotic Weapon Proficiency: Dueling Sword","Quick Draw","Weapon Finesse","Weapon Focus: Dueling Sword"]
    }
  },
  "efreeti_style" : {
    "_name" : "Efreeti Style",
    "_description" : "You gain one additional Elemental Fist attempt per day. While using this style and Elemental Fist to deal fire damage, you gain a bonus on fire damage rolls equal to your Wisdom bonus. Further, if your Elemental Fist melee attack misses while you are using it to deal fire damage, you still deal 1d6 points of fire damage to your target.",
    "_icon" : "",
    "+feats.efreeti_style" : {
      "_name" : "Efreeti Style",
      "_description" : "You gain one additional Elemental Fist attempt per day. While using this style and Elemental Fist to deal fire damage, you gain a bonus on fire damage rolls equal to your Wisdom bonus. Further, if your Elemental Fist melee attack misses while you are using it to deal fire damage, you still deal 1d6 points of fire damage to your target.",
      "_icon" : "",
      "_requires" : ["Constitution 13","Wisdom 15","Elemental Fist","Improved Unarmed Strike","Base Attack Bonus +9","Monk level 5"]
    }
  },
  "efreeti_stance" : {
    "_name" : "Efreeti Stance",
    "_description" : "You gain one additional Elemental Fist attempt per day. While using Efreeti Style, you gain fire resistance equal to your base attack bonus or your monk level plus any base attack bonus gained from levels in classes other than monk, whichever is higher. While denied your Dexterity bonus to AC you are also denied this resistance. Creatures that take fire damage from your Elemental Fist attack must succeed at a Reflex save (DC 10 + 1/2 your character level + your Wis modifier) or catch on fire.",
    "_icon" : "",
    "+feats.efreeti_stance" : {
      "_name" : "Efreeti Stance",
      "_description" : "You gain one additional Elemental Fist attempt per day. While using Efreeti Style, you gain fire resistance equal to your base attack bonus or your monk level plus any base attack bonus gained from levels in classes other than monk, whichever is higher. While denied your Dexterity bonus to AC you are also denied this resistance. Creatures that take fire damage from your Elemental Fist attack must succeed at a Reflex save (DC 10 + 1/2 your character level + your Wis modifier) or catch on fire.",
      "_icon" : "",
      "_requires" : ["Constitution 15","Wisdom 15","Efreeti Style","Elemental Fist","Improved Unarmed Strike","Base Attack Bonus +11","Monk level 9"]
    }
  },
  "efreeti_touch" : {
    "_name" : "Efreeti Touch",
    "_description" : "While using Efreeti Style, as a standard action, you can spend two Elemental Fist attempts to unleash a 15-foot cone-shaped burst of flame. Creatures caught in the cone take your unarmed strike damage plus the fire damage from your Elemental Fist and catch on fire. A successful Reflex save (DC 10 + 1/2 your character level + your Wis modifier) reduces the damage by half and prevents a target from catching on fire.",
    "_icon" : "",
    "+feats.efreeti_touch" : {
      "_name" : "Efreeti Touch",
      "_description" : "While using Efreeti Style, as a standard action, you can spend two Elemental Fist attempts to unleash a 15-foot cone-shaped burst of flame. Creatures caught in the cone take your unarmed strike damage plus the fire damage from your Elemental Fist and catch on fire. A successful Reflex save (DC 10 + 1/2 your character level + your Wis modifier) reduces the damage by half and prevents a target from catching on fire.",
      "_icon" : "",
      "_requires" : ["Constitution 15","Wisdom 17","Efreeti Style","Efreeti Stance","Elemental Fist","Improved Unarmed Strike","Base Attack Bonus +13","Monk level 11"]
    }
  },
  "eldritch_claws" : {
    "_name" : "Eldritch Claws",
    "_description" : "Your natural weapons are considered both magic and silver for purpose of overcoming damage reduction.",
    "_icon" : "",
    "+feats.eldritch_claws" : {
      "_name" : "Eldritch Claws",
      "_description" : "Your natural weapons are considered both magic and silver for purpose of overcoming damage reduction.",
      "_icon" : "",
      "_requires" : ["Strength 15","Natural Weapons","Base Attack Bonus +6"]
    }
  },
  "elemental_fist" : {
    "_name" : "Elemental Fist",
    "_description" : "When you use Elemental Strike pick one of the following energy types: acid, cold, electricity, or fire. On a successful hit, the attack deals damage normally plus 1d6 points of damage of the chosen type. You must declare that you are using this feat before you make your attack roll (thus a failed attack roll ruins the attempt). You may attempt an Elemental Fist attack once per day for every four levels you have attained (see Special), and no more than once per round.",
    "_icon" : "",
    "+feats.elemental_fist" : {
      "_name" : "Elemental Fist",
      "_description" : "When you use Elemental Strike pick one of the following energy types: acid, cold, electricity, or fire. On a successful hit, the attack deals damage normally plus 1d6 points of damage of the chosen type. You must declare that you are using this feat before you make your attack roll (thus a failed attack roll ruins the attempt). You may attempt an Elemental Fist attack once per day for every four levels you have attained (see Special), and no more than once per round. A monk of the four winds receives Elemental Fist as a bonus feat at 1st level, even if he does not meet the prerequisites. A monk may attempt an Elemental Fist attack a number of times per day equal to his monk level, plus one more time per day for every four levels he has in classes other than monk.",
      "_icon" : "",
      "_requires" : ["Constitution 13","Wisdom 13","Improved Unarmed Strike","Base Attack Bonus +8"]
    }
  },
  "elemental_strike" : {
    "_name" : "Elemental Strike",
    "_description" : "As a swift action, you can imbue your weapons with elemental energy. For 1 round, your weapons deal an additional 1 point of energy damage. The type of energy damage depends on your race: acid for oread, electricity for sylph, fire for ifrit, or cold for undine. For every 5 levels you possess, this bonus increases by 1, to a maximum of +5 at 20th level.",
    "_icon" : "",
    "+feats.elemental_strike" : {
      "_name" : "Elemental Strike",
      "_description" : "As a swift action, you can imbue your weapons with elemental energy. For 1 round, your weapons deal an additional 1 point of energy damage. The type of energy damage depends on your race: acid for oread, electricity for sylph, fire for ifrit, or cold for undine. For every 5 levels you possess, this bonus increases by 1, to a maximum of +5 at 20th level. You can use this feat instead of Arcane Strike to qualify for or attack with the Deadly Dealer feat.",
      "_icon" : "",
      "_requires" : ["Ifrit, Oread, Sylph, or Undine"]
    }
  },
  "elephant_stomp" : {
    "_name" : "Elephant Stomp",
    "_description" : "When you overrun an opponent and your maneuver check exceeds your opponent’s CMD by 5 or more, instead of moving through your opponent’s space and knocking her prone, you may stop in the space directly in front of the opponent (or the nearest adjacent space) and make one attack with an unarmed strike or a natural weapon against that opponent as an immediate action.",
    "_icon" : "",
    "+feats.elephant_stomp" : {
      "_name" : "Elephant Stomp",
      "_description" : "When you overrun an opponent and your maneuver check exceeds your opponent’s CMD by 5 or more, instead of moving through your opponent’s space and knocking her prone, you may stop in the space directly in front of the opponent (or the nearest adjacent space) and make one attack with an unarmed strike or a natural weapon against that opponent as an immediate action.",
      "_icon" : "",
      "_requires" : ["Strength 13","Power Attack","Improved Overrun","Base Attack Bonus +1"]
    }
  },
  "elven_accuracy" : {
    "_name" : "Elven Accuracy",
    "_description" : "If you miss due to concealment when making a ranged attack with a longbow or shortbow (including composite bows), you can reroll your miss chance roll one time to see if you actually hit.",
    "_icon" : "",
    "+feats.elven_accuracy" : {
      "_name" : "Elven Accuracy",
      "_description" : "If you miss due to concealment when making a ranged attack with a longbow or shortbow (including composite bows), you can reroll your miss chance roll one time to see if you actually hit.",
      "_icon" : "",
      "_requires" : ["Elf"]
    }
  },
  "elusive_redirection" : {
    "_name" : "Elusive Redirection",
    "_description" : "When you successfully use your elusive target class feature to avoid taking damage, you can spend an immediate action and an additional point from your ki pool to redirect that attack back at your attacker or toward any other opponent adjacent to you and your attacker. This attack uses the same attack roll as the original attack, but it targets the opponent you choose.",
    "_icon" : "",
    "+feats.elusive_redirection" : {
      "_name" : "Elusive Redirection",
      "_description" : "When you successfully use your elusive target class feature to avoid taking damage, you can spend an immediate action and an additional point from your ki pool to redirect that attack back at your attacker or toward any other opponent adjacent to you and your attacker. This attack uses the same attack roll as the original attack, but it targets the opponent you choose.",
      "_icon" : "",
      "_requires" : ["Elusive Target class feature","Combat Expertise","Improved Unarmed Strike","Flowing Monk level 12"]
    }
  },
  "elven_battle_training" : {
    "_name" : "Elven Battle Training",
    "_description" : "You have received special training with traditional elven weapons (longbows, composite longbows, longswords, rapiers, shortbows, composite shortbows, and any weapon with the word “elven” in its name). You receive a +2 bonus to your CMD against disarm and sunder maneuvers directed at one of these weapons you are wielding. In addition, if you are wielding one of these melee weapons, you may make an additional attack of opportunity each round (this bonus stacks with Combat Reflexes).",
    "_icon" : "",
    "+feats.elven_battle_training" : {
      "_name" : "Elven Battle Training",
      "_description" : "You have received special training with traditional elven weapons (longbows, composite longbows, longswords, rapiers, shortbows, composite shortbows, and any weapon with the word “elven” in its name). You receive a +2 bonus to your CMD against disarm and sunder maneuvers directed at one of these weapons you are wielding. In addition, if you are wielding one of these melee weapons, you may make an additional attack of opportunity each round (this bonus stacks with Combat Reflexes).",
      "_icon" : "",
      "_requires" : ["Base Attack Bonus +1","Elf"]
    }
  },
  "enforcer" : {
    "_name" : "Enforcer",
    "_description" : "Whenever you deal nonlethal damage with a melee weapon, you can make an Intimidate check to demoralize your target as a free action. If you are successful, the target is shaken for a number of rounds equal to the damage dealt. If your attack was a critical hit, your target is frightened for 1 round with a successful Intimidate check, as well as being shaken for a number of rounds equal to the damage dealt.",
    "_icon" : "",
    "+feats.enforcer" : {
      "_name" : "Enforcer",
      "_description" : "Whenever you deal nonlethal damage with a melee weapon, you can make an Intimidate check to demoralize your target as a free action. If you are successful, the target is shaken for a number of rounds equal to the damage dealt. If your attack was a critical hit, your target is frightened for 1 round with a successful Intimidate check, as well as being shaken for a number of rounds equal to the damage dealt.",
      "_icon" : "",
      "_requires" : ["Intimidate rank 1"]
    }
  },
  "engulf_revulsion" : {
    "_name" : "Engulf Revulsion",
    "_description" : "When you successfully engulf or smother an opponent, or successfully maintain a grapple combat maneuver on an engulfed or smothered opponent, that opponent must succeed at a Will save (DC = 10 + 1/2 your Hit Dice + your Strength modifier) or become shaken for 1 round. This is a mind-affecting fear effect.",
    "_icon" : "",
    "+feats.engulf_revulsion" : {
      "_name" : "Engulf Revulsion",
      "_description" : "When you successfully engulf or smother an opponent, or successfully maintain a grapple combat maneuver on an engulfed or smothered opponent, that opponent must succeed at a Will save (DC = 10 + 1/2 your Hit Dice + your Strength modifier) or become shaken for 1 round. This is a mind-affecting fear effect.",
      "_icon" : "",
      "_requires" : ["Engulf or Smother universal monster ability"]
    }
  },
  "engulf_horror" : {
    "_name" : "Engulf Horror",
    "_description" : "When you successfully engulf or smother an opponent, successfully maintain a grapple combat maneuver on a smothered opponent, the opponent must succeed at a Will save (DC = 10 + 1/2 your Hit Dice + your Strength modifier) or become staggered for 1 round. This is a mind-affecting fear effect.",
    "_icon" : "",
    "+feats.engulf_horror" : {
      "_name" : "Engulf Horror",
      "_description" : "When you successfully engulf or smother an opponent, successfully maintain a grapple combat maneuver on a smothered opponent, the opponent must succeed at a Will save (DC = 10 + 1/2 your Hit Dice + your Strength modifier) or become staggered for 1 round. This is a mind-affecting fear effect.",
      "_icon" : "",
      "_requires" : ["Engulf Revulsion","Engulf or Smother universal monster ability"]
    }
  },
  "enrage_opponent" : {
    "_name" : "Enrage Opponent",
    "_description" : "As a swift action, you can spend 1 panache point to enrage a creature with an Intelligence of 4 or more within 60 feet that can see or hear you. Attempt an Intimidate check as if to demoralize the creature. If you succeed, the creature takes a –2 penalty to its AC until it has made at least one attack against you (including area effects that include you) or until it can no longer see or hear you. You can have only one opponent enraged at you with this feat at a time, and once you’ve enraged a creature, you can’t enrage it again for 24 hours.",
    "_icon" : "",
    "+feats.enrage_opponent" : {
      "_name" : "Enrage Opponent",
      "_description" : "As a swift action, you can spend 1 panache point to enrage a creature with an Intelligence of 4 or more within 60 feet that can see or hear you. Attempt an Intimidate check as if to demoralize the creature. If you succeed, the creature takes a –2 penalty to its AC until it has made at least one attack against you (including area effects that include you) or until it can no longer see or hear you. You can have only one opponent enraged at you with this feat at a time, and once you’ve enraged a creature, you can’t enrage it again for 24 hours.",
      "_icon" : "",
      "_requires" : ["Charisma 13","Amateur Swashbuckler or Panache class feature"]
    }
  },
  "equipment_trick" : {
    "_name" : "Equipment Trick",
    "_description" : "You can use any equipment trick relating to the chosen item as long as you meet the trick’s prerequisites. If the item would normally be considered an improvised weapon, you can treat it as either a normal weapon or an improvised weapon, depending on which is more beneficial for you.",
    "_icon" : "",
    "+feats.equipment_trick" : {
      "_name" : "Equipment Trick",
      "_description" : "You can use any equipment trick relating to the chosen item as long as you meet the trick’s prerequisites. If the item would normally be considered an improvised weapon, you can treat it as either a normal weapon or an improvised weapon, depending on which is more beneficial for you. You can gain Equipment Trick multiple times. Each time you take the feat, it applies to a new type of equipment.",
      "_icon" : "",
      "_requires" : ["Base Attack Bonus +1","Choose a piece of equipment, such as anvil, boots, a cloak, rope, a shield, a heavy blade scabbard, a sunrod, or wondrous item."]
    }
  },
  "exceptional_pull" : {
    "_name" : "Exceptional Pull",
    "_description" : "When you wield a ranged weapon that you are proficient with and that has a strength rating, add 2 to the weapon’s strength rating. You don’t take a penalty on attack rolls for having a Strength modifier lower than the strength rating of a weapon, provided you’re proficient with that weapon.",
    "_icon" : "",
    "+feats.exceptional_pull" : {
      "_name" : "Exceptional Pull",
      "_description" : "When you wield a ranged weapon that you are proficient with and that has a strength rating, add 2 to the weapon’s strength rating. You don’t take a penalty on attack rolls for having a Strength modifier lower than the strength rating of a weapon, provided you’re proficient with that weapon.",
      "_icon" : "",
      "_requires" : ["Dexterity 13","Deadly Aim","Base Attack Bonus +3"]
    }
  },
  "exotic_weapon_proficiency" : {
    "_name" : "Exotic Weapon Proficiency",
    "_description" : "You make attack rolls with the weapon normally.",
    "_icon" : "",
    "+feats.exotic_weapon_proficiency" : {
      "_name" : "Exotic Weapon Proficiency",
      "_description" : "You make attack rolls with the weapon normally. You can gain Exotic Weapon Proficiency multiple times. Each time you take the feat, it applies to a new type of exotic weapon.",
      "_icon" : "",
      "_requires" : ["Base Attack Bonus +1"]
    }
  },
  "exsanguinate" : {
    "_name" : "Exsanguinate",
    "_description" : "Once per round, when you successfully pin an opponent, that opponent takes double the normal damage from your blood drain.",
    "_icon" : "",
    "+feats.exsanguinate" : {
      "_name" : "Exsanguinate",
      "_description" : "Once per round, when you successfully pin an opponent, that opponent takes double the normal damage from your blood drain.",
      "_icon" : "",
      "_requires" : ["Blood Drain universal monster ability","Grab universal monster ability"]
    }
  },
  "extreme_prejudice" : {
    "_name" : "Extreme Prejudice",
    "_description" : "When you succeed at a sneak attack against a creature you selected as the target of your Seething Hatred feat, you use d8s to roll sneak attack damage instead of d6s.",
    "_icon" : "",
    "+feats.extreme_prejudice" : {
      "_name" : "Extreme Prejudice",
      "_description" : "When you succeed at a sneak attack against a creature you selected as the target of your Seething Hatred feat, you use d8s to roll sneak attack damage instead of d6s.",
      "_icon" : "",
      "_requires" : ["Seething Hatred","Sneak Attack +3d6","Studied Target class feature"]
    }
  },
  "faeries_strike" : {
    "_name" : "Faerie's Strike",
    "_description" : "When you use Vital Strike (or Improved Vital Strike or Greater Vital Strike), the creature you hit with the attack must succeed at a Will save (DC = 10 + 1/2 your character level + your Wisdom modifier) or be illuminated as if by faerie fire for 1 minute. You can use this benefit a number of times per day equal to your Wisdom modifier (minimum 1).",
    "_icon" : "",
    "+feats.faeries_strike" : {
      "_name" : "Faerie's Strike",
      "_description" : "When you use Vital Strike (or Improved Vital Strike or Greater Vital Strike), the creature you hit with the attack must succeed at a Will save (DC = 10 + 1/2 your character level + your Wisdom modifier) or be illuminated as if by faerie fire for 1 minute. You can use this benefit a number of times per day equal to your Wisdom modifier (minimum 1).",
      "_icon" : "",
      "_requires" : ["Nature Magic or the ability to cast Druid or Ranger spells","Vital Strike","Knowledge: Nature rank 5"]
    }
  },
  "false_opening" : {
    "_name" : "False Opening",
    "_description" : "Choose a ranged weapon or a thrown weapon. When you make a ranged attack using that weapon, you can choose to provoke an attack of opportunity from one or more opponents who threaten you. You gain a +4 dodge bonus against such attacks. An opponent that makes such an attack and misses you loses his Dexterity bonus to AC against you until the end of your turn.",
    "_icon" : "",
    "+feats.false_opening" : {
      "_name" : "False Opening",
      "_description" : "Choose a ranged weapon or a thrown weapon. When you make a ranged attack using that weapon, you can choose to provoke an attack of opportunity from one or more opponents who threaten you. You gain a +4 dodge bonus against such attacks. An opponent that makes such an attack and misses you loses his Dexterity bonus to AC against you until the end of your turn.",
      "_icon" : "",
      "_requires" : ["Dexterity 13","Dodge","Close Quarter Thrower or Point-Blank Master","Weapon Focus with selected ranged weapon"]
    }
  },
  "far_shot" : {
    "_name" : "Far Shot",
    "_description" : "You only suffer a –1 penalty per full range increment between you and your target when using a ranged weapon.",
    "_icon" : "",
    "+feats.far_shot" : {
      "_name" : "Far Shot",
      "_description" : "You only suffer a –1 penalty per full range increment between you and your target when using a ranged weapon.",
      "_icon" : "",
      "_requires" : ["Point-Blank Shot"]
    }
  },
  "feinting_flurry" : {
    "_name" : "Feinting Flurry",
    "_description" : "While using flurry of blows to make melee attacks, you can forgo your first attack to make a Bluff check to feint.",
    "_icon" : "",
    "+feats.feinting_flurry" : {
      "_name" : "Feinting Flurry",
      "_description" : "While using flurry of blows to make melee attacks, you can forgo your first attack to make a Bluff check to feint.",
      "_icon" : "",
      "_requires" : ["Dexterity 14","Flurry of Blows class feature","Combat Expertise"]
    }
  },
  "feint_greater" : {
    "_name" : "Greater Feint",
    "_description" : "Whenever you use feint to cause an opponent to lose his Dexterity bonus, he loses that bonus until the beginning of your next turn, in addition to losing his Dexterity bonus against your next attack.",
    "_icon" : "",
    "+feats.feint_greater" : {
      "_name" : "Greater Feint",
      "_description" : "Whenever you use feint to cause an opponent to lose his Dexterity bonus, he loses that bonus until the beginning of your next turn, in addition to losing his Dexterity bonus against your next attack.",
      "_icon" : "",
      "_requires" : ["Combat Expertise","Improved Feint","Base Attack Bonu +6","Intelligence 13"]
    }
  },
  "feinting_flurry_improved" : {
    "_name" : "Improved Feinting Flurry",
    "_description" : "While using Feinting Flurry, if you successfully feint, your opponent is denied its Dexterity bonus to AC until the end of your turn.",
    "_icon" : "",
    "+feats.feinting_flurry_improved" : {
      "_name" : "Improved Feinting Flurry",
      "_description" : "While using Feinting Flurry, if you successfully feint, your opponent is denied its Dexterity bonus to AC until the end of your turn.",
      "_icon" : "",
      "_requires" : ["Dexterity 17","Flurry of Blows class feature","Combat Expertise","Feinting Flurry","Base Attack Bonus +6"]
    }
  },
  "feint_improved" : {
    "_name" : "Improved Feint",
    "_description" : "You can make a Bluff check to feint in combat as a move action.",
    "_icon" : "",
    "+feats.feint_improved" : {
      "_name" : "Improved Feint",
      "_description" : "You can make a Bluff check to feint in combat as a move action.",
      "_icon" : "",
      "_requires" : ["Intelligence 13","Combat Expertise"]
    }
  },
  "felling_escape" : {
    "_name" : "Felling Escape",
    "_description" : "When you break an opponent’s grapple with a combat maneuver check or Escape Artist check, you can spend a swift action to make a trip attempt against that opponent.",
    "_icon" : "",
    "+feats.felling_escape" : {
      "_name" : "Felling Escape",
      "_description" : "When you break an opponent’s grapple with a combat maneuver check or Escape Artist check, you can spend a swift action to make a trip attempt against that opponent.",
      "_icon" : "",
      "_requires" : ["Intelligence 13","Combat Expertise","Improved Trip"]
    }
  },
  "felling_smash" : {
    "_name" : "Felling Smash",
    "_description" : "If you use the attack action to make a single melee attack at your highest base attack bonus while using Power Attack and you hit an opponent, you can spend a swift action to attempt a trip combat maneuver against that opponent.",
    "_icon" : "",
    "+feats.felling_smash" : {
      "_name" : "Felling Smash",
      "_description" : "If you use the attack action to make a single melee attack at your highest base attack bonus while using Power Attack and you hit an opponent, you can spend a swift action to attempt a trip combat maneuver against that opponent.",
      "_icon" : "",
      "_requires" : ["Intelligence 13","Strength 13","Combat Expertise","Improved Trip","Power Attack","Base Attack Bonus +6"]
    }
  },
  "fencing_grace" : {
    "_name" : "Fencing Grace",
    "_description" : "Your dashing style and fluid rapier forms allow you to use agility rather than brute force to fell your foes. When wielding a rapier one-handed, you can add your Dexterity modifier instead of your Strength modifier to that weapon’s damage. The rapier must be one appropriate for your size. You do not gain this benefit while fighting with two weapons or using flurry of blows, or anytime another hand is otherwise occupied. In addition, if you have the panache class feature, you gain a +2 bonus to your CMD against attempts to disarm you of your rapier while you have at least 1 panache point.",
    "_icon" : "",
    "+feats.fencing_grace" : {
      "_name" : "Fencing Grace",
      "_description" : "Your dashing style and fluid rapier forms allow you to use agility rather than brute force to fell your foes. When wielding a rapier one-handed, you can add your Dexterity modifier instead of your Strength modifier to that weapon’s damage. The rapier must be one appropriate for your size. You do not gain this benefit while fighting with two weapons or using flurry of blows, or anytime another hand is otherwise occupied. In addition, if you have the panache class feature, you gain a +2 bonus to your CMD against attempts to disarm you of your rapier while you have at least 1 panache point.",
      "_icon" : "",
      "_requires" : ["DEX >= 13","Weapon Finess", "Weapon Focus (rapier)"]
    },
    "+info.play_shortcuts.combat_offence[]" : "feats.fencing_grace"
  },
  "feral_combat_training" : {
    "_name" : "Feral Combat Training",
    "_description" : "Choose one of your natural weapons. While using the selected natural weapon, you can apply the effects of feats that have Improved Unarmed Strike as a prerequisite.",
    "_icon" : "",
    "+feats.feral_combat_training" : {
      "_name" : "Feral Combat Training",
      "_description" : "Choose one of your natural weapons. While using the selected natural weapon, you can apply the effects of feats that have Improved Unarmed Strike as a prerequisite. If you are a monk, you can use the selected natural weapon with your flurry of blows class feature.",
      "_icon" : "",
      "_requires" : ["Improved Unarmed Strike","Weapon Focus with selected natural weapon"]
    }
  },
  "ferocious_tenacity" : {
    "_name" : "Ferocious Tenacity",
    "_description" : "When raging, if you are hit by an attack that would deal enough hit points of damage to kill you (negative hit points equal to your Constitution score), as an immediate action you may expend 1 or more rounds of rage to negate some of this damage and keep yourself alive. Each round of rage you spend reduces the attack’s damage by your raging Constitution bonus, but cannot reduce the damage taken below 1 hit point. For example, if you are raging, have a raging Constitution score of 18, are currently at 2 hit points, and are hit for 20 hit points of damage (which is enough to bring you to –18 hit points, killing you), you may spend 1 round of rage to reduce the damage by 4 (leaving you perilously close to death at –14 hit points); if you spend 5 rounds of rage, you reduce the damage to 1 (the minimum), leaving you with 1 hit point.",
    "_icon" : "",
    "+feats.ferocious_tenacity" : {
      "_name" : "Ferocious Tenacity",
      "_description" : "When raging, if you are hit by an attack that would deal enough hit points of damage to kill you (negative hit points equal to your Constitution score), as an immediate action you may expend 1 or more rounds of rage to negate some of this damage and keep yourself alive. Each round of rage you spend reduces the attack’s damage by your raging Constitution bonus, but cannot reduce the damage taken below 1 hit point. For example, if you are raging, have a raging Constitution score of 18, are currently at 2 hit points, and are hit for 20 hit points of damage (which is enough to bring you to –18 hit points, killing you), you may spend 1 round of rage to reduce the damage by 4 (leaving you perilously close to death at –14 hit points); if you spend 5 rounds of rage, you reduce the damage to 1 (the minimum), leaving you with 1 hit point.",
      "_icon" : "",
      "_requires" : ["Half-Orc or Orc","Ferocity racial trait","Rage class feature"]
    }
  },
  "weapon_finess" : {
    "_name" : "Weapon Finesse",
    "_description" : "With a light weapon, rapier, whip, or spiked chain made for a creature of your size category, you may use your Dexterity modifier instead of your Strength modifier on attack rolls. If you carry a shield, its armor check penalty applies to your attack rolls.",
    "_icon" : "",
    "+feats.weapon_finesse" : {
      "_name" : "Weapon Finess",
      "_description" : "With a light weapon, elven curve blade, rapier, whip, or spiked chain made for a creature of your size category, you may use your Dexterity modifier instead of your Strength modifier on attack rolls. If you carry a shield, its armor check penalty applies to your attack rolls. Natural weapons are considered light weapons for the purposes of this feat.",
      "_icon" : "",
      "_requires" : ""
    },
    "+info.play_shortcuts.combat_offence[]" : "feats.weapon_finesse"
  },
  "power_attack" : {
    "_name" : "Power Attack",
    "_description" : "You can choose to take a –1 penalty on all melee attack rolls and combat maneuver checks to gain a +2 bonus on all melee damage rolls. This bonus to damage is increased by half (+50%) if you are making an attack with a two-handed weapon, a one handed weapon using two hands, or a primary natural weapon that adds 1-1/2 times your Strength modifier on damage rolls. This bonus to damage is halved (–50%) if you are making an attack with an off-hand weapon or secondary natural weapon. When your base attack bonus reaches +4, and every 4 points thereafter, the penalty increases by –1 and the bonus to damage increases by +2. You must choose to use this feat before making an attack roll, and its effects last until your next turn. The bonus damage does not apply to touch attacks or effects that do not deal hit point damage.",
    "_icon" : "",
    "+feats.power_attack" : {
      "_name" : "Power Attack",
      "_description" : "You can choose to take a –1 penalty on all melee attack rolls and combat maneuver checks to gain a +2 bonus on all melee damage rolls. This bonus to damage is increased by half (+50%) if you are making an attack with a two-handed weapon, a one handed weapon using two hands, or a primary natural weapon that adds 1-1/2 times your Strength modifier on damage rolls. This bonus to damage is halved (–50%) if you are making an attack with an off-hand weapon or secondary natural weapon. When your base attack bonus reaches +4, and every 4 points thereafter, the penalty increases by –1 and the bonus to damage increases by +2. You must choose to use this feat before making an attack roll, and its effects last until your next turn. The bonus damage does not apply to touch attacks or effects that do not deal hit point damage.",
      "_icon" : "",
      "_requires" : ["STR >= 13","BAB >= 1"]
    },
    "+info.play_shortcuts.combat_offence[]" : "feats.power_attack"
  }


}
