{
        "+spells.acid_splash": {
            "_description": "You fire a small orb of acid at the target. You must succeed on a ranged touch attack to hit your target. The orb deals 1d3 points of acid damage. This acid disappears after 1 round.",
            "_name": "Acid Splash",
	    "_icon" : "goo-spurt",
            "cast_time": "1 Standard Action",
            "damage": {
                "_bonus": 0,
                "_suffix": "d3",
                "dice": 1
            },
            "dc": {
                "base": [
                    "class.magus.spell_dc",
                    "spells.acid_splash.level"
                ]
            },
            "duration": "Instant",
            "level": 0,
            "prepared": false,
            "range": {
                "_suffix": "ft",
                "base": 25,
                "multiply": [
                    5,
                    {
                        "divide": [
                            "stats.caster_level",
                            2
                        ]
                    }
                ]
            },
            "require": "V,S",
            "save": "None",
            "spell_failure": {
                "_suffix": "%",
                "base": "stats.spell_failure"
            },
            "target": "1",
            "uses": {
                "per_day": 1,
                "used_today": 0
            }
        },
        "+spells.arcane_mark": {
            "_description": "This spell allows you to inscribe your personal rune or mark, which can consist of no more than six characters. The writing can be visible or invisible. An arcane mark spell enables you to etch the rune upon any substance without harm to the material upon which it is placed. If an invisible mark is made, a detect magic spell causes it to glow and be visible, though not necessarily understandable.\n\nSee invisibility, true seeing, a gem of seeing, or a robe of eyes likewise allows the user to see an invisible arcane mark. A read magic spell reveals the words, if any. The mark cannot be dispelled, but it can be removed by the caster or by an erase spell.\n\nIf an arcane mark is placed on a living being, the effect gradually fades in about a month.\n\nArcane mark must be cast on an object prior to casting instant summons on the same object (see that spell description for details).",
            "_name": "Arcane Mark",
	    "_icon" : "shiny-iris",
            "cast_time": "1 Standard Action",
            "duration": "Permanent",
            "level": 0,
            "prepared": false,
            "range": "Touch",
            "require": "V,S",
            "save": "None",
            "spell_failure": {
                "_suffix": "%",
                "base": "stats.spell_failure"
            },
            "target": "1 sq. ft. section of material",
            "uses": {
                "per_day": 1,
                "used_today": 0
            }
        },
        "+spells.dancing_lights": {
            "_description": "Depending on the version selected, you create up to four lights that resemble lanterns or torches (and cast that amount of light), or up to four glowing spheres of light (which look like will-o’-wisps), or one faintly glowing, vaguely humanoid shape. The dancing lights must stay within a 10-foot-radius area in relation to each other but otherwise move as you desire (no concentration required): forward or back, up or down, straight or turning corners, or the like. The lights can move up to 100 feet per round. A light winks out if the distance between you and it exceeds the spell’s range.\n\nYou can only have one dancing lights spell active at any one time. If you cast this spell while another casting is still in effect, the previous casting is dispelled. If you make this spell permanent, it does not count against this limit.\n\nDancing lights can be made permanent with a permanency spell.",
            "_name": "Dancing Lights",
	    "_icon" : "sun",
            "cast_time": "1 Standard Action",
            "duration": {
                "_suffix": "minute",
                "base": 1
            },
            "level": 0,
            "prepared": false,
            "range": {
                "_suffix": "ft",
                "base": 100,
                "multiply": [
                    10,
                    "stats.caster_level"
                ]
            },
            "require": "V, S",
            "save": "None",
            "spell_failure": {
                "_suffix": "%",
                "base": "stats.spell_failure"
            },
            "target": "Area in range",
            "uses": {
                "per_day": 1
            }
        },
        "+spells.daze": {
            "_description": "This spell clouds the mind of a humanoid creature with 4 or fewer Hit Dice so that it takes no actions. Humanoids of 5 or more HD are not affected. A dazed subject is not stunned, so attackers get no special advantage against it. After a creature has been dazed by this spell, it is immune to the effects of this spell for 1 minute.\n\nDazed Condition: The creature is unable to act normally. A dazed creature can take no actions, but has no penalty to AC.",
            "_name": "Daze",
	    "_icon" : "star-struck",
            "cast_time": "1 Standard Action",
            "damage": {
                "_bonus": 0,
                "_suffix": "d6",
                "dice": 1
            },
            "dc": {
                "base": [
                    "class.magus.spell_dc",
                    "spells.daze.level"
                ]
            },
            "duration": {
                "_suffix": " round",
                "base": 1
            },
            "level": 0,
            "prepared": false,
            "range": {
                "_suffix": "ft",
                "base": 25,
                "multiply": [
                    5,
                    {
                        "divide": [
                            "stats.caster_level",
                            2
                        ]
                    }
                ]
            },
            "require": "V,S,M (pinch of wool or similar)",
            "save": "Will (Negates)",
            "spell_failure": {
                "_suffix": "%",
                "base": "stats.spell_failure"
            },
            "target": "1 humanoid with <=4HD",
            "uses": {
                "per_day": 1
            }
        },
        "+spells.detect_fiendish_presence": {
            "_description": "This spell functions like detect evil, except that it detects only outsiders with the evil subtype, as well as the lingering effects caused by their gifts, presence, and spells. It can also detect clerics and paladins of fiendish deities, including Asmodeus, archdevils, daemonic harbingers, and demon lords.",
            "_name": "Detect Fiendish Presence",
	    "_icon" : "diablo-skull",
            "cast_time": "1 Standard Action",
            "dc": {
                "base": [
                    "class.magus.spell_dc",
                    "spells.detect_fiendish_presence.level"
                ]
            },
            "duration": {
                "_prefix": "Concentration:",
                "_suffix": "minutes maximum",
                "base": 0,
                "multiply": [
                    10,
                    "stats.caster_level"
                ]
            },
            "level": 0,
            "prepared": false,
            "range": {
                "_suffix": "ft",
                "base": 60
            },
            "require": "V,S",
            "save": "None",
            "spell_failure": {
                "_suffix": "%",
                "base": "stats.spell_failure"
            },
            "target": "Cone",
            "uses": {
                "per_day": 1
            }
        },
        "+spells.detect_magic": {
            "_description": "You detect magical auras. The amount of information revealed depends on how long you study a particular area or subject.\n\n1st Round: Presence or absence of magical auras.\n\n2nd Round: Number of different magical auras and the power of the most potent aura.\n\n3rd Round: The strength and location of each aura. If the items or creatures bearing the auras are in line of sight, you can make Knowledge (arcana) skill checks to determine the school of magic involved in each. (Make one check per aura: DC 15 + spell level, or 15 + 1/2 caster level for a nonspell effect.) If the aura emanates from a magic item, you can attempt to identify its properties (see Spellcraft).\n\nMagical areas, multiple types of magic, or strong local magical emanations may distort or conceal weaker auras.\n\nAura Strength: An aura’s power depends on a spell’s functioning spell level or an item’s caster level; see the accompanying table. If an aura falls into more than one category, detect magic indicates the stronger of the two.\n\nLingering Aura: A magical aura lingers after its original source dissipates (in the case of a spell) or is destroyed (in the case of a magic item). If detect magic is cast and directed at such a location, the spell indicates an aura strength of dim (even weaker than a faint aura). How long the aura lingers at this dim level depends on its original power:\n\nOutsiders and elementals are not magical in themselves, but if they are summoned, the conjuration spell registers. Each round, you can turn to detect magic in a new area. The spell can penetrate barriers, but 1 foot of stone, 1 inch of common metal, a thin sheet of lead, or 3 feet of wood or dirt blocks it.\n\nDetect magic can be made permanent with a permanency spell.\n\n\n",
            "_name": "Detect Magic",
	    "_icon" : "magic-palm",
            "cast_time": "1 Standard Action",
            "dc": {
                "base": [
                    "class.magus.spell_dc",
                    "spells.detect_magic.level"
                ]
            },
            "duration": {
                "_prefix": "Concentration:",
                "_suffix": " minutes max",
                "base": "stats.caster_level"
            },
            "level": 0,
            "prepared": true,
            "range": {
                "_suffix": "ft",
                "base": 60
            },
            "require": "V, S",
            "save": "None",
            "spell_failure": {
                "_suffix": "%",
                "base": "stats.spell_failure"
            },
            "target": "Cone",
            "uses": {
                "per_day": 1,
                "used_today": 0
            }
        },
        "+spells.disrupt_undead": {
            "_description": "You direct a ray of positive energy.\n\nYou must make a ranged touch attack to hit, and if the ray hits an undead creature, it deals 1d6 points of damage to it.",
            "_name": "Disrupt Undead",
	    "_icon" : "skeleton-inside",
            "cast_time": "1 Standard Action",
            "damage": {
                "_bonus": 0,
                "_suffix": "d6",
                "dice": 1
            },
            "dc": {
                "base": [
                    "class.magus.spell_dc",
                    "spells.disrupt_undead.level"
                ]
            },
            "duration": "Instant",
            "level": 0,
            "prepared": false,
            "range": {
                "_suffix": "ft",
                "base": 25,
                "multiply": [
                    5,
                    {
                        "divide": [
                            "stats.caster_level",
                            2
                        ]
                    }
                ]
            },
            "require": "V, S",
            "save": "None",
            "spell_failure": {
                "_suffix": "%",
                "base": "stats.spell_failure"
            },
            "target": "Ray",
            "uses": {
                "per_day": 1
            }
        },
        "+spells.flare": {
            "_description": "This cantrip creates a burst of light. If you cause the light to burst in front of a single creature, that creature is dazzled for 1 minute unless it makes a successful Fortitude save. Sightless creatures, as well as creatures already dazzled, are not affected by flare.",
            "_name": "Flare",
	    "_icon" : "sparky-bomb",
            "cast_time": "1 Standard Action",
            "dc": {
                "base": [
                    "class.magus.spell_dc",
                    "spells.flare.level"
                ]
            },
            "duration": "Instant",
            "level": 0,
            "prepared": false,
            "range": {
                "_suffix": "ft",
                "base": 25,
                "multiply": [
                    5,
                    {
                        "divide": [
                            "stats.caster_level",
                            2
                        ]
                    }
                ]
            },
            "require": "V",
            "save": "Fortitude (no effect)",
            "spell_failure": {
                "_suffix": "%",
                "base": "stats.spell_failure"
            },
            "target": "Burst of light",
            "uses": {
                "per_day": 1
            }
        },
        "+spells.ghost_sounds": {
            "_description": "Ghost sound allows you to create a volume of sound that rises, recedes, approaches, or remains at a fixed place. You choose what type of sound ghost sound creates when casting it and cannot thereafter change the sound’s basic character.\n\nThe volume of sound created depends on your level. You can produce as much noise as four normal humans per caster level (maximum 40 humans). Thus, talking, singing, shouting, walking, marching, or running sounds can be created. The noise a ghost sound spell produces can be virtually any type of sound within the volume limit. A horde of rats running and squeaking is about the same volume as eight humans running and shouting. A roaring lion is equal to the noise from 16 humans, while a roaring dragon is equal to the noise from 32 humans. Anyone who hears a ghost sound receives a Will save to disbelieve.\n\nGhost sound can enhance the effectiveness of a silent image spell.\n\nGhost sound can be made permanent with a permanency spell.",
            "_name": "Ghost Sound",
	    "_icon" : "sound-waves",
            "cast_time": "1 Standard Action",
            "dc": {
                "base": [
                    "class.magus.spell_dc",
                    "spells.ghost_sounds.level"
                ]
            },
            "duration": {
                "_suffix": "rounds",
                "base": "stats.caster_level"
            },
            "level": 0,
            "prepared": false,
            "range": {
                "_suffix": "ft",
                "base": 25,
                "multiply": [
                    5,
                    {
                        "divide": [
                            "stats.caster_level",
                            2
                        ]
                    }
                ]
            },
            "require": "V,S,M (bit of wool or small lump of wax)",
            "save": "Will (disbelief)",
            "spell_failure": {
                "_suffix": "%",
                "base": "stats.spell_failure"
            },
            "target": "illusory sounds",
            "uses": {
                "per_day": 1
            }
        },
        "+spells.grasp": {
            "_description": "You can cast this spell as an immediate action when you fail a Climb check and would fall. You can immediately attempt another Climb check as a free action at a –2 penalty. Each successive use of this spell in a particular situation increases the penalty by 2. If successful, you don’t fall, but you don’t progress at climbing.",
            "_name": "Grasp",
	    "_icon" : "grab",
            "cast_time": "1 Immediate Action",
            "duration": "Instant",
            "level": 0,
            "prepared": false,
            "range": "Personal",
            "require": "V",
            "save": "None",
            "spell_failure": {
                "_suffix": "%",
                "base": "stats.spell_failure"
            },
            "target": "Personal",
            "uses": {
                "per_day": 1
            }
        },
        "+spells.light": {
            "_description": "This spell causes a touched object to glow like a torch, shedding normal light in a 20-foot radius from the point touched, and increasing the light level for an additional 20 feet by one step, up to normal light (darkness becomes dim light, and dim light becomes normal light). In an area of normal or bright light, this spell has no effect. The effect is immobile, but it can be cast on a movable object.\n\nYou can only have one light spell active at any one time. If you cast this spell while another casting is still in effect, the previous casting is dispelled. If you make this spell permanent (through permanency or a similar effect), it does not count against this limit. Light can be used to counter or dispel any darkness spell of equal or lower spell level.",
            "_name": "Light",
	    "_icon" : "candlebright",
            "cast_time": "1 Standard Action",
            "duration": {
                "_suffix": "minutes",
                "multiply": [
                    10,
                    "stats.caster_level"
                ]
            },
            "level": 0,
            "prepared": false,
            "range": "Touch",
            "require": "V, M/DF (a firefly)",
            "save": "None",
            "spell_failure": {
                "_suffix": "%",
                "base": "stats.spell_failure"
            },
            "target": "1 Object",
            "uses": {
                "per_day": 1
            }
        },
        "+spells.mage_hand": {
            "_description": "You point your finger at an object and can lift it and move it at will from a distance. As a move action, you can propel the object as far as 15 feet in any direction, though the spell ends if the distance between you and the object ever exceeds the spell’s range.",
            "_name": "Mage Hand",
	    "_icon" : "hand",
            "cast_time": "1 Standard Action",
            "duration": "Concentration",
            "level": 0,
            "prepared": false,
            "range": {
                "_suffix": "ft",
                "base": 25,
                "multiply": [
                    5,
                    {
                        "divide": [
                            "stats.caster_level",
                            2
                        ]
                    }
                ]
            },
            "require": "V, S",
            "save": "None",
            "spell_failure": {
                "_suffix": "%",
                "base": "stats.spell_failure"
            },
            "target": "1 non-magical, unattended object up to 5 lbs",
            "uses": {
                "per_day": 1,
                "used_today": 0
            }
        },
        "+spells.open_close": {
            "_description": "You can open or close (your choice) a door, chest, box, window, bag, pouch, bottle, barrel, or other container. If anything resists this activity (such as a bar on a door or a lock on a chest), the spell fails. In addition, the spell can only open and close things weighing 30 pounds or less. Thus, doors, chests, and similar objects sized for enormous creatures may be beyond this spell’s ability to affect.",
            "_name": "Open-Close",
	    "_icon" : "door-handle",
            "cast_time": "1 Standard Action",
            "dc": {
                "base": [
                    "class.magus.spell_dc",
                    "spells.open_close.level"
                ]
            },
            "duration": "Instant",
            "level": 0,
            "prepared": true,
            "range": {
                "_suffix": "ft",
                "base": 25,
                "multiply": [
                    5,
                    {
                        "divide": [
                            "stats.caster_level",
                            2
                        ]
                    }
                ]
            },
            "require": "V,S,F (a brass key)",
            "save": "Will (No Effect)",
            "spell_failure": {
                "_suffix": "%",
                "base": "stats.spell_failure"
            },
            "target": "1 object up to 30 lbs, or portal that can be opened/closed",
            "uses": {
                "per_day": 1
            }
        },
        "+spells.prestidigitation": {
            "_description": "Prestidigitations are minor tricks that novice spellcasters use for practice. Once cast, a prestidigitation spell enables you to perform simple magical effects for 1 hour. The effects are minor and have severe limitations. A prestidigitation can slowly lift 1 pound of material. It can color, clean, or soil items in a 1-foot cube each round. It can chill, warm, or flavor 1 pound of nonliving material. It cannot deal damage or affect the concentration of spellcasters. Prestidigitation can create small objects, but they look crude and artificial. The materials created by a prestidigitation spell are extremely fragile, and they cannot be used as tools, weapons, or spell components. Finally, prestidigitation lacks the power to duplicate any other spell effects. Any actual change to an object (beyond just moving, cleaning, or soiling it) persists only 1 hour.",
            "_name": "Prestidigitation",
	    "_icon" : "star-swirl",
            "cast_time": "1 Standard Action",
            "dc": {
                "base": [
                    "class.magus.spell_dc",
                    "spells.prestidigitation.level"
                ]
            },
            "duration": {
                "_suffix": " hour",
                "base": 1
            },
            "level": 0,
            "prepared": false,
            "range": {
                "_suffix": "ft",
                "base": 10
            },
            "require": "VSM (material)",
            "save": "see description",
            "spell_failure": {
                "_suffix": "%",
                "base": "stats.spell_failure"
            },
            "target": "see description",
            "uses": {
                "per_day": 1
            }
        },
        "+spells.ray_of_frost": {
            "_description": "A ray of freezing air and ice projects from your pointing finger. You must succeed on a ranged touch attack with the ray to deal damage to a target. The ray deals 1d3 points of cold damage.",
            "_name": "Ray of Frost",
	    "_icon" : "ice-spear",
            "cast_time": "1 Standard Action",
            "damage": {
                "_bonus": 0,
                "_suffix": "d3",
                "dice": 1
            },
            "dc": {
                "base": [
                    "class.magus.spell_dc",
                    "spells.ray_of_frost.level"
                ]
            },
            "duration": "Instant",
            "level": 0,
            "prepared": true,
            "range": {
                "_suffix": "ft",
                "base": 25,
                "multiply": [
                    5,
                    {
                        "divide": [
                            "stats.caster_level",
                            2
                        ]
                    }
                ]
            },
            "require": "V, S",
            "save": "None",
            "spell_failure": {
                "_suffix": "%",
                "base": "stats.spell_failure"
            },
            "target": "Ray",
            "uses": {
                "per_day": 1
            }
        },
        "+spells.read_magic": {
            "_description": "You can decipher magical inscriptions on objects – books, scrolls, weapons, and the like – that would otherwise be unintelligible. This deciphering does not normally invoke the magic contained in the writing, although it may do so in the case of a cursed or trapped scroll. Furthermore, once the spell is cast and you have read the magical inscription, you are thereafter able to read that particular writing without recourse to the use of read magic. You can read at the rate of one page (250 words) per minute. The spell allows you to identify a glyph of warding with a DC 13 Spellcraft check, a greater glyph of warding with a DC 16 Spellcraft check, or any symbol spell with a Spellcraft check (DC 10 + spell level).\n\nRead magic can be made permanent with a permanency spell.",
            "_name": "Read Magic",
	    "_icon" : "book-aura",
            "cast_time": "1 Standard Action",
            "duration": {
                "_suffix": " minutes",
                "multiply": [
                    10,
                    "stats.caster_level"
                ]
            },
            "level": 0,
            "prepared": true,
            "range": "Personal",
            "require": "V, S, F (clear crystal or mineral prism)",
            "save": "None",
            "spell_failure": {
                "_suffix": "%",
                "base": "stats.spell_failure"
            },
            "target": "Personal",
            "uses": {
                "per_day": 1,
                "used_today": 0
            }
        },
        "+spells.spark": {
            "_description": "You can make an unattended Fine flammable object catch on fire. This works as if you were using flint and steel except that you can use spark in any sort of weather and it takes much less time to actually ignite an object.",
            "_name": "Spark",
	    "_icon" : "spark-spirit",
            "cast_time": "1 Standard Action",
            "dc": {
                "base": [
                    "class.magus.spell_dc",
                    "spells.spark.level"
                ]
            },
            "duration": "Instant",
            "level": 0,
            "prepared": false,
            "range": {
                "_suffix": "ft",
                "base": 25,
                "multiply": [
                    5,
                    {
                        "divide": [
                            "stats.caster_level",
                            2
                        ]
                    }
                ]
            },
            "require": "V or S",
            "save": "Fortitude (Negates)",
            "spell_failure": {
                "_suffix": "%",
                "base": "stats.spell_failure"
            },
            "target": "1 Fine Object",
            "uses": {
                "per_day": 1
            }
        }
}
