{
  "ifrit-standard" : {
    "_name" : "Ifrit (Standard)",
    "_description" : "Humans whose ancestry includes beings of elemental fire such as efreet, ifrits are a passionate and fickle race. No ifrit is satisfied with a sedentary life; like a wildfire, ifrits must keep moving or burn away into nothingness. Ifrits not only adore flames, but personify multiple aspects of them as well, embodying both fire’s dynamic, ever-changing energy and its destructive, pitiless nature.",
    "_icon" : "ifrit",
    "+info.race" : {
      "_name" : "Ifrit",
      "_description" : "Humans whose ancestry includes beings of elemental fire such as efreet, ifrits are a passionate and fickle race. No ifrit is satisfied with a sedentary life; like a wildfire, ifrits must keep moving or burn away into nothingness. Ifrits not only adore flames, but personify multiple aspects of them as well, embodying both fire’s dynamic, ever-changing energy and its destructive, pitiless nature.",
      "physical description" : "Ifrits vary in appearance as widely as their elemental ancestors do. Most have pointy ears, red or mottled horns on the brow, and hair that flickers and waves as if it were aflame. Some possess skin the color of polished brass or have charcoal-hued scales covering their arms and legs. Ifrits favor revealing and ostentatious clothing in bright oranges and reds, preferably paired with gaudy jewelry.",
      "society" : "Ifrits are most often born into human communities, and rarely form societies of their own. Those who grow up in a city are almost always imprisoned or driven off before they reach adulthood; most are simply too hot-headed and independent to fit into civilized society, and their predilection toward pyromania doesn’t endear them to the local authorities. Those born into nomadic or tribal societies fare much better, since ifrits’ instinctive urge to explore and conquer their surroundings can easily earn them a place among their tribe’s leadership.",
      "relations" : "Even the best-natured ifrits tend to view other individuals as tools to use as they see fit, and as such they get along best with races they can charm or browbeat into submission. Half-elves and gnomes often find themselves caught up in an ifrit’s schemes, while halflings, half-orcs, and dwarves usually bridle at ifrits’ controlling nature. Strangely, ifrits sometimes form incredibly close bonds with elves, whose calm, aloof nature seems to counterbalance an ifrit’s impulsiveness. Most ifrits refuse to associate with sylphs, but are otherwise on peaceable terms with the other elemental-touched races.",
      "alignment and religion" : "Ifrits are a dichotomous people—on one hand, fiercely independent, and on the other, imperious and demanding. They are often accused of being morally impoverished, but their troublemaking behavior is rarely motivated by true malice. Ifrits are usually lawful neutral or chaotic neutral, with a few falling into true neutrality. Most ifrits lack the mindset to follow a god’s teachings, and resent the strictures placed on them by organized faith. When ifrits do take to worship (usually venerating a fire-related deity), they prove to be zealous and devoted followers.",
      "adventurers" : "Ifrits adventure for the sheer thrill of it and for the chance to test their skill against worthy foes, but most of all they adventure in search of power. Once ifrits dedicate themselves to a task, they pursue it unflinchingly, never stopping to consider the dangers ahead of them. When this brashness finally catches up with them, ifrits often rely on sorcery or bardic magic to combat their resulting troubles.",
      "ages" : "Adulthood: 60 years, Lifespan: 100s of years",
      "male names" : "Aja, Denat, Efit, Elum, Jalij, Maqej, Urah.",
      "female names" : "Alayi, Etwa, Maqan, Qari, Sami, Zetaya.",
       "male height" : "5ft 4in to 6ft 6in",
       "male weight" : "120 to 190 lbs",
       "female height" : "5ft 2in to 6ft 4in",
       "female weight" : "100-170 lbs",
      "languages_available" : ["aquan", "auran", "dwarven", "elven", "gnome", "halfling", "terran","any regional human language"]
    },
    "+info.type" : ["outsiders", "native"],
    "+stats.languages._suffix" : "Common, ignan",
    "+stats.dex.ifrit" : 2,
    "+stats.wis.ifrit" : -2,
    "+stats.cha.ifrit" : 2,
    "+stats.size.ifrit" : 0,
    "+stats.speed.base" : 30,
    "+stats.vision_dark.base" : 60,
    "+stats.vision_dim.base" : { "multiply" : [2, "stats.vision"] },
    "+stats.vision_dim.description" : "Light sources allow sight 2x farther than normal",
    "+stats.resist_fire" : { "ifrit" : 5, "_name" : "Fire Resistance" },
    "+abilities.burning_hands" : { "_name" : "Burning Hands", "type" : "Sp", "_description" : "Ifrits can use burning hands once per day as a spell-like ability. Caster level equals the ifrit's level. DC 11 + Charisma modifier." },
    "+feats.fire_affinity" : { "_name" : "Fire Affinity", "type" : "Affinity", "_description" : "Ifrit sorcerers with the elemental (fire) bloodline treat their Charisma score as 2 points higher for all sorcerer spells and class abilities. Ifrit spellcasters with the Fire domain use their domain powers and spells at +1 caster level." }
  }
}
